[Killed] BlockStatement
src/crypto.js:12:53
  * @param {number} currentValue - Current value of holdings.
  * @returns {number} ROI percentage.
  */
-function calculateCryptoROI(invested, currentValue) {
-    if (invested <= 0) throw new Error("Invested amount must be positive");
-    
-    const profit = currentValue - invested;
-    return Number(((profit / invested) * 100).toFixed(2));
-}
+function calculateCryptoROI(invested, currentValue) {}
 
 /**
killedBy: Crypto Module calculateCryptoROI should calculate ROI
statusReason: Expected values to be strictly equal:

undefined !== 50

[Killed] EqualityOperator
src/crypto.js:13:9
  * @returns {number} ROI percentage.
  */
 function calculateCryptoROI(invested, currentValue) {
-    if (invested <= 0) throw new Error("Invested amount must be positive");
+    if (invested > 0) throw new Error("Invested amount must be positive");
     
     const profit = currentValue - invested;
killedBy: Crypto Module calculateCryptoROI should calculate ROI
statusReason: Invested amount must be positive

[Killed] ConditionalExpression
src/crypto.js:13:9
  * @returns {number} ROI percentage.
  */
 function calculateCryptoROI(invested, currentValue) {
-    if (invested <= 0) throw new Error("Invested amount must be positive");
+    if (false) throw new Error("Invested amount must be positive");
     
     const profit = currentValue - invested;
killedBy: Crypto Module calculateCryptoROI should throw error for zero invested amount
statusReason: Missing expected exception.

[Killed] ArithmeticOperator
src/crypto.js:15:20
 function calculateCryptoROI(invested, currentValue) {
     if (invested <= 0) throw new Error("Invested amount must be positive");
     
-    const profit = currentValue - invested;
+    const profit = currentValue + invested;
     return Number(((profit / invested) * 100).toFixed(2));
 }
killedBy: Crypto Module calculateCryptoROI should calculate ROI
statusReason: Expected values to be strictly equal:

250 !== 50

[Killed] ArithmeticOperator
src/crypto.js:16:20
     if (invested <= 0) throw new Error("Invested amount must be positive");
     
     const profit = currentValue - invested;
-    return Number(((profit / invested) * 100).toFixed(2));
+    return Number((profit / invested / 100).toFixed(2));
 }
 
killedBy: Crypto Module calculateCryptoROI should calculate ROI
statusReason: Expected values to be strictly equal:

0.01 !== 50

[Killed] ArithmeticOperator
src/crypto.js:16:21
     if (invested <= 0) throw new Error("Invested amount must be positive");
     
     const profit = currentValue - invested;
-    return Number(((profit / invested) * 100).toFixed(2));
+    return Number(((profit * invested) * 100).toFixed(2));
 }
 
killedBy: Crypto Module calculateCryptoROI should calculate ROI
statusReason: Expected values to be strictly equal:

50000000 !== 50

[Killed] BlockStatement
src/crypto.js:26:54
  * @param {number} years - Duration in years.
  * @returns {Object} Total rewards and final balance.
  */
-function calculateStakingRewards(amount, apy, years) {
-    if (amount < 0 || apy < 0 || years < 0) throw new Error("Invalid input parameters");
-
-    const r = apy / 100;
-    const finalBalance = amount * Math.pow(1 + r, years);
-    const rewards = finalBalance - amount;
-
-    return {
-        rewards: Number(rewards.toFixed(4)),
-        finalBalance: Number(finalBalance.toFixed(4))
-    };
-}
+function calculateStakingRewards(amount, apy, years) {}
 
 /**
killedBy: Crypto Module calculateStakingRewards should calculate staking rewards
statusReason: Cannot read properties of undefined (reading 'finalBalance')

[Killed] ConditionalExpression
src/crypto.js:27:9
  * @returns {Object} Total rewards and final balance.
  */
 function calculateStakingRewards(amount, apy, years) {
-    if (amount < 0 || apy < 0 || years < 0) throw new Error("Invalid input parameters");
+    if (true) throw new Error("Invalid input parameters");
 
     const r = apy / 100;
killedBy: Crypto Module calculateStakingRewards should calculate staking rewards
statusReason: Invalid input parameters

[Killed] EqualityOperator
src/crypto.js:27:9
  * @returns {Object} Total rewards and final balance.
  */
 function calculateStakingRewards(amount, apy, years) {
-    if (amount < 0 || apy < 0 || years < 0) throw new Error("Invalid input parameters");
+    if (amount >= 0 || apy < 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = apy / 100;
killedBy: Crypto Module calculateStakingRewards should calculate staking rewards
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/crypto.js:29:15
 function calculateStakingRewards(amount, apy, years) {
     if (amount < 0 || apy < 0 || years < 0) throw new Error("Invalid input parameters");
 
-    const r = apy / 100;
+    const r = apy * 100;
     const finalBalance = amount * Math.pow(1 + r, years);
     const rewards = finalBalance - amount;
killedBy: Crypto Module calculateStakingRewards should calculate staking rewards
statusReason: Expected values to be strictly equal:

100100 !== 110

[Killed] ArithmeticOperator
src/crypto.js:30:44
     if (amount < 0 || apy < 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = apy / 100;
-    const finalBalance = amount * Math.pow(1 + r, years);
+    const finalBalance = amount * Math.pow(1 - r, years);
     const rewards = finalBalance - amount;
 
killedBy: Crypto Module calculateStakingRewards should calculate staking rewards
statusReason: Expected values to be strictly equal:

90 !== 110

[Killed] ArithmeticOperator
src/crypto.js:30:26
     if (amount < 0 || apy < 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = apy / 100;
-    const finalBalance = amount * Math.pow(1 + r, years);
+    const finalBalance = amount / Math.pow(1 + r, years);
     const rewards = finalBalance - amount;
 
killedBy: Crypto Module calculateStakingRewards should calculate staking rewards
statusReason: Expected values to be strictly equal:

90.9091 !== 110

[Killed] ArithmeticOperator
src/crypto.js:31:21
 
     const r = apy / 100;
     const finalBalance = amount * Math.pow(1 + r, years);
-    const rewards = finalBalance - amount;
+    const rewards = finalBalance + amount;
 
     return {
killedBy: Crypto Module calculateStakingRewards should calculate staking rewards
statusReason: Expected values to be strictly equal:

210 !== 10

[Killed] BlockStatement
src/crypto.js:44:53
  * @param {number} priceChangeRatio - Ratio of new price to old price (e.g., 1.10 for 10% increase).
  * @returns {number} Impermanent loss percentage (negative value).
  */
-function calculateImpermanentLoss(priceChangeRatio) {
-    if (priceChangeRatio <= 0) throw new Error("Price change ratio must be positive");
-
-    // Formula: 2 * sqrt(ratio) / (1 + ratio) - 1
-    const loss = (2 * Math.sqrt(priceChangeRatio) / (1 + priceChangeRatio)) - 1;
-    
-    return Number((loss * 100).toFixed(2));
-}
+function calculateImpermanentLoss(priceChangeRatio) {}
 
 /**
killedBy: Crypto Module calculateImpermanentLoss should calculate impermanent loss
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- -5.72

[Killed] ConditionalExpression
src/crypto.js:45:9
  * @returns {number} Impermanent loss percentage (negative value).
  */
 function calculateImpermanentLoss(priceChangeRatio) {
-    if (priceChangeRatio <= 0) throw new Error("Price change ratio must be positive");
+    if (true) throw new Error("Price change ratio must be positive");
 
     // Formula: 2 * sqrt(ratio) / (1 + ratio) - 1
killedBy: Crypto Module calculateImpermanentLoss should calculate impermanent loss
statusReason: Price change ratio must be positive

[Killed] ConditionalExpression
src/crypto.js:45:9
  * @returns {number} Impermanent loss percentage (negative value).
  */
 function calculateImpermanentLoss(priceChangeRatio) {
-    if (priceChangeRatio <= 0) throw new Error("Price change ratio must be positive");
+    if (false) throw new Error("Price change ratio must be positive");
 
     // Formula: 2 * sqrt(ratio) / (1 + ratio) - 1
killedBy: Crypto Module calculateImpermanentLoss should throw error for invalid inputs
statusReason: Missing expected exception.

[Killed] ArithmeticOperator
src/crypto.js:48:19
     if (priceChangeRatio <= 0) throw new Error("Price change ratio must be positive");
 
     // Formula: 2 * sqrt(ratio) / (1 + ratio) - 1
-    const loss = (2 * Math.sqrt(priceChangeRatio) / (1 + priceChangeRatio)) - 1;
+    const loss = (2 / Math.sqrt(priceChangeRatio) / (1 + priceChangeRatio)) - 1;
     
     return Number((loss * 100).toFixed(2));
killedBy: Crypto Module calculateImpermanentLoss should calculate impermanent loss
statusReason: Expected values to be strictly equal:

-52.86 !== -5.72

[Killed] ArithmeticOperator
src/crypto.js:48:19
     if (priceChangeRatio <= 0) throw new Error("Price change ratio must be positive");
 
     // Formula: 2 * sqrt(ratio) / (1 + ratio) - 1
-    const loss = (2 * Math.sqrt(priceChangeRatio) / (1 + priceChangeRatio)) - 1;
+    const loss = (2 * Math.sqrt(priceChangeRatio) * (1 + priceChangeRatio)) - 1;
     
     return Number((loss * 100).toFixed(2));
killedBy: Crypto Module calculateImpermanentLoss should calculate impermanent loss
statusReason: Expected values to be strictly equal:

748.53 !== -5.72

[Killed] ArithmeticOperator
src/crypto.js:50:20
     // Formula: 2 * sqrt(ratio) / (1 + ratio) - 1
     const loss = (2 * Math.sqrt(priceChangeRatio) / (1 + priceChangeRatio)) - 1;
     
-    return Number((loss * 100).toFixed(2));
+    return Number((loss / 100).toFixed(2));
 }
 
killedBy: Crypto Module calculateImpermanentLoss should calculate impermanent loss
statusReason: Expected values to be strictly equal:

-0 !== -5.72

[Killed] BlockStatement
src/crypto.js:58:48
  * @param {Array<Object>} purchases - Array of { amount, price }.
  * @returns {Object} Average price and total holdings.
  */
-function calculateDollarCostAverage(purchases) {
-    if (!Array.isArray(purchases) || purchases.length === 0) throw new Error("Invalid purchases array");
-
-    let totalCost = 0;
-    let totalCoins = 0;
-
-    for (const p of purchases) {
-        if (p.amount <= 0 || p.price <= 0) continue;
-        
-        const coins = p.amount / p.price;
-        totalCost += p.amount;
-        totalCoins += coins;
-    }
-
-    if (totalCoins === 0) return { averagePrice: 0, totalCoins: 0, totalCost: 0 };
-
-    const averagePrice = totalCost / totalCoins;
-
-    return {
-        averagePrice: Number(averagePrice.toFixed(2)),
-        totalCoins: Number(totalCoins.toFixed(6)),
-        totalCost: Number(totalCost.toFixed(2))
-    };
-}
+function calculateDollarCostAverage(purchases) {}
 
 module.exports = {
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Cannot read properties of undefined (reading 'averagePrice')

[Killed] ConditionalExpression
src/crypto.js:59:9
  * @returns {Object} Average price and total holdings.
  */
 function calculateDollarCostAverage(purchases) {
-    if (!Array.isArray(purchases) || purchases.length === 0) throw new Error("Invalid purchases array");
+    if (false) throw new Error("Invalid purchases array");
 
     let totalCost = 0;
killedBy: Crypto Module calculateDollarCostAverage should throw error for invalid inputs
statusReason: The input did not match the regular expression /Invalid purchases array/. Input:

'TypeError: purchases is not iterable'

[Killed] ConditionalExpression
src/crypto.js:59:38
  * @returns {Object} Average price and total holdings.
  */
 function calculateDollarCostAverage(purchases) {
-    if (!Array.isArray(purchases) || purchases.length === 0) throw new Error("Invalid purchases array");
+    if (!Array.isArray(purchases) || false) throw new Error("Invalid purchases array");
 
     let totalCost = 0;
killedBy: Crypto Module calculateDollarCostAverage should throw error for invalid inputs
statusReason: Missing expected exception.

[Killed] BlockStatement
src/crypto.js:64:32
     let totalCost = 0;
     let totalCoins = 0;
 
-    for (const p of purchases) {
-        if (p.amount <= 0 || p.price <= 0) continue;
-        
-        const coins = p.amount / p.price;
-        totalCost += p.amount;
-        totalCoins += coins;
-    }
+    for (const p of purchases) {}
 
     if (totalCoins === 0) return { averagePrice: 0, totalCoins: 0, totalCost: 0 };
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

0 !== 66.67

[Killed] EqualityOperator
src/crypto.js:65:30
     let totalCoins = 0;
 
     for (const p of purchases) {
-        if (p.amount <= 0 || p.price <= 0) continue;
+        if (p.amount <= 0 || p.price > 0) continue;
         
         const coins = p.amount / p.price;
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

0 !== 66.67

[Killed] EqualityOperator
src/crypto.js:65:13
     let totalCoins = 0;
 
     for (const p of purchases) {
-        if (p.amount <= 0 || p.price <= 0) continue;
+        if (p.amount > 0 || p.price <= 0) continue;
         
         const coins = p.amount / p.price;
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

0 !== 66.67

[Killed] ArithmeticOperator
src/crypto.js:67:23
     for (const p of purchases) {
         if (p.amount <= 0 || p.price <= 0) continue;
         
-        const coins = p.amount / p.price;
+        const coins = p.amount * p.price;
         totalCost += p.amount;
         totalCoins += coins;
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

0.01 !== 66.67

[Killed] AssignmentOperator
src/crypto.js:68:9
         if (p.amount <= 0 || p.price <= 0) continue;
         
         const coins = p.amount / p.price;
-        totalCost += p.amount;
+        totalCost -= p.amount;
         totalCoins += coins;
     }
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

-66.67 !== 66.67

[Killed] AssignmentOperator
src/crypto.js:69:9
         
         const coins = p.amount / p.price;
         totalCost += p.amount;
-        totalCoins += coins;
+        totalCoins -= coins;
     }
 
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

-66.67 !== 66.67

[Killed] ConditionalExpression
src/crypto.js:72:9
         totalCoins += coins;
     }
 
-    if (totalCoins === 0) return { averagePrice: 0, totalCoins: 0, totalCost: 0 };
+    if (true) return { averagePrice: 0, totalCoins: 0, totalCost: 0 };
 
     const averagePrice = totalCost / totalCoins;
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

0 !== 66.67

[Killed] EqualityOperator
src/crypto.js:72:9
         totalCoins += coins;
     }
 
-    if (totalCoins === 0) return { averagePrice: 0, totalCoins: 0, totalCost: 0 };
+    if (totalCoins !== 0) return { averagePrice: 0, totalCoins: 0, totalCost: 0 };
 
     const averagePrice = totalCost / totalCoins;
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

0 !== 66.67

[Killed] ArithmeticOperator
src/crypto.js:74:26
 
     if (totalCoins === 0) return { averagePrice: 0, totalCoins: 0, totalCost: 0 };
 
-    const averagePrice = totalCost / totalCoins;
+    const averagePrice = totalCost * totalCoins;
 
     return {
killedBy: Crypto Module calculateDollarCostAverage should calculate DCA
statusReason: Expected values to be strictly equal:

60000 !== 66.67
