[Killed] BlockStatement
src/budget.js:12:49
  * @param {number} expenses - Total expenses.
  * @returns {number} Savings rate percentage.
  */
-function calculateSavingsRate(income, expenses) {
-    if (income <= 0) throw new Error("Income must be positive");
-    if (expenses < 0) throw new Error("Expenses cannot be negative");
-
-    const savings = income - expenses;
-    return Number(((savings / income) * 100).toFixed(2));
-}
+function calculateSavingsRate(income, expenses) {}
 
 /**
killedBy: Budget Module calculateSavingsRate should calculate savings rate correctly
statusReason: Expected values to be strictly equal:

undefined !== 20

[Killed] EqualityOperator
src/budget.js:13:9
  * @returns {number} Savings rate percentage.
  */
 function calculateSavingsRate(income, expenses) {
-    if (income <= 0) throw new Error("Income must be positive");
+    if (income > 0) throw new Error("Income must be positive");
     if (expenses < 0) throw new Error("Expenses cannot be negative");
 
killedBy: Budget Module calculateSavingsRate should calculate savings rate correctly
statusReason: Income must be positive

[Killed] EqualityOperator
src/budget.js:13:9
  * @returns {number} Savings rate percentage.
  */
 function calculateSavingsRate(income, expenses) {
-    if (income <= 0) throw new Error("Income must be positive");
+    if (income < 0) throw new Error("Income must be positive");
     if (expenses < 0) throw new Error("Expenses cannot be negative");
 
killedBy: Budget Module calculateSavingsRate should throw error for zero income
statusReason: Missing expected exception.

[Killed] EqualityOperator
src/budget.js:14:9
  */
 function calculateSavingsRate(income, expenses) {
     if (income <= 0) throw new Error("Income must be positive");
-    if (expenses < 0) throw new Error("Expenses cannot be negative");
+    if (expenses >= 0) throw new Error("Expenses cannot be negative");
 
     const savings = income - expenses;
killedBy: Budget Module calculateSavingsRate should calculate savings rate correctly
statusReason: Expenses cannot be negative

[Killed] EqualityOperator
src/budget.js:14:9
  */
 function calculateSavingsRate(income, expenses) {
     if (income <= 0) throw new Error("Income must be positive");
-    if (expenses < 0) throw new Error("Expenses cannot be negative");
+    if (expenses <= 0) throw new Error("Expenses cannot be negative");
 
     const savings = income - expenses;
killedBy: Budget Module calculateSavingsRate should handle zero expenses (100% savings)
statusReason: Expenses cannot be negative

[Killed] ArithmeticOperator
src/budget.js:16:21
     if (income <= 0) throw new Error("Income must be positive");
     if (expenses < 0) throw new Error("Expenses cannot be negative");
 
-    const savings = income - expenses;
+    const savings = income + expenses;
     return Number(((savings / income) * 100).toFixed(2));
 }
killedBy: Budget Module calculateSavingsRate should calculate savings rate correctly
statusReason: Expected values to be strictly equal:

180 !== 20

[Killed] ArithmeticOperator
src/budget.js:17:21
     if (expenses < 0) throw new Error("Expenses cannot be negative");
 
     const savings = income - expenses;
-    return Number(((savings / income) * 100).toFixed(2));
+    return Number(((savings * income) * 100).toFixed(2));
 }
 
killedBy: Budget Module calculateSavingsRate should calculate savings rate correctly
statusReason: Expected values to be strictly equal:

500000000 !== 20

[Killed] ArithmeticOperator
src/budget.js:17:20
     if (expenses < 0) throw new Error("Expenses cannot be negative");
 
     const savings = income - expenses;
-    return Number(((savings / income) * 100).toFixed(2));
+    return Number((savings / income / 100).toFixed(2));
 }
 
killedBy: Budget Module calculateSavingsRate should calculate savings rate correctly
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] BooleanLiteral
src/budget.js:26:9
  * @returns {Object} Analysis including total, breakdown by category, and top expense.
  */
 function analyzeExpenses(expenses) {
-    if (!Array.isArray(expenses)) throw new Error("Invalid input parameters");
+    if (Array.isArray(expenses)) throw new Error("Invalid input parameters");
 
     let total = 0;
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Invalid input parameters

[Killed] ConditionalExpression
src/budget.js:26:9
  * @returns {Object} Analysis including total, breakdown by category, and top expense.
  */
 function analyzeExpenses(expenses) {
-    if (!Array.isArray(expenses)) throw new Error("Invalid input parameters");
+    if (true) throw new Error("Invalid input parameters");
 
     let total = 0;
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Invalid input parameters

[Killed] BlockStatement
src/budget.js:33:34
     let maxAmount = 0;
     let topCategory = null;
 
-    for (const item of expenses) {
-        if (item.amount < 0) continue; // Skip negative expenses
-        
-        total += item.amount;
-        
-        if (!breakdown[item.category]) {
-            breakdown[item.category] = 0;
-        }
-        breakdown[item.category] += item.amount;
-
-        if (item.amount > maxAmount) {
-            maxAmount = item.amount;
-            topCategory = item.category;
-        }
-    }
+    for (const item of expenses) {}
 
     // Calculate percentages
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

0 !== 2200

[Killed] ConditionalExpression
src/budget.js:34:13
     let topCategory = null;
 
     for (const item of expenses) {
-        if (item.amount < 0) continue; // Skip negative expenses
+        if (true) continue; // Skip negative expenses
         
         total += item.amount;
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

0 !== 2200

[Killed] EqualityOperator
src/budget.js:34:13
     let topCategory = null;
 
     for (const item of expenses) {
-        if (item.amount < 0) continue; // Skip negative expenses
+        if (item.amount >= 0) continue; // Skip negative expenses
         
         total += item.amount;
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

0 !== 2200

[Killed] AssignmentOperator
src/budget.js:36:9
     for (const item of expenses) {
         if (item.amount < 0) continue; // Skip negative expenses
         
-        total += item.amount;
+        total -= item.amount;
         
         if (!breakdown[item.category]) {
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

-2200 !== 2200

[Killed] BlockStatement
src/budget.js:38:40
         
         total += item.amount;
         
-        if (!breakdown[item.category]) {
-            breakdown[item.category] = 0;
-        }
+        if (!breakdown[item.category]) {}
         breakdown[item.category] += item.amount;
 
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

NaN !== 700

[Killed] ConditionalExpression
src/budget.js:38:13
         
         total += item.amount;
         
-        if (!breakdown[item.category]) {
+        if (true) {
             breakdown[item.category] = 0;
         }
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

200 !== 700

[Killed] AssignmentOperator
src/budget.js:41:9
         if (!breakdown[item.category]) {
             breakdown[item.category] = 0;
         }
-        breakdown[item.category] += item.amount;
+        breakdown[item.category] -= item.amount;
 
         if (item.amount > maxAmount) {
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

-700 !== 700

[Killed] ConditionalExpression
src/budget.js:43:13
         }
         breakdown[item.category] += item.amount;
 
-        if (item.amount > maxAmount) {
+        if (false) {
             maxAmount = item.amount;
             topCategory = item.category;
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

null !== 'Rent'

[Killed] BlockStatement
src/budget.js:43:38
         }
         breakdown[item.category] += item.amount;
 
-        if (item.amount > maxAmount) {
-            maxAmount = item.amount;
-            topCategory = item.category;
-        }
+        if (item.amount > maxAmount) {}
     }
 
killedBy: Budget Module analyzeExpenses should analyze expenses correctly
statusReason: Expected values to be strictly equal:

null !== 'Rent'

[Survived] BlockStatement
src/budget.js:51:34
 
     // Calculate percentages
     const percentageBreakdown = {};
-    for (const cat in breakdown) {
-        percentageBreakdown[cat] = Number(((breakdown[cat] / total) * 100).toFixed(2));
-    }
+    for (const cat in breakdown) {}
 
     return {

[Survived] ArithmeticOperator
src/budget.js:52:45
     // Calculate percentages
     const percentageBreakdown = {};
     for (const cat in breakdown) {
-        percentageBreakdown[cat] = Number(((breakdown[cat] / total) * 100).toFixed(2));
+        percentageBreakdown[cat] = Number(((breakdown[cat] * total) * 100).toFixed(2));
     }
 

[Survived] ArithmeticOperator
src/budget.js:52:44
     // Calculate percentages
     const percentageBreakdown = {};
     for (const cat in breakdown) {
-        percentageBreakdown[cat] = Number(((breakdown[cat] / total) * 100).toFixed(2));
+        percentageBreakdown[cat] = Number((breakdown[cat] / total / 100).toFixed(2));
     }
 

[Killed] BlockStatement
src/budget.js:69:58
  * @param {number} months - Number of months of coverage desired (e.g., 3-6).
  * @returns {number} Total emergency fund needed.
  */
-function calculateEmergencyFund(monthlyExpenses, months) {
-    if (monthlyExpenses < 0 || months < 0) throw new Error("Invalid input parameters");
-    
-    return Number((monthlyExpenses * months).toFixed(2));
-}
+function calculateEmergencyFund(monthlyExpenses, months) {}
 
 /**
killedBy: Budget Module calculateEmergencyFund should calculate emergency fund
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 18000

[Killed] EqualityOperator
src/budget.js:70:32
  * @returns {number} Total emergency fund needed.
  */
 function calculateEmergencyFund(monthlyExpenses, months) {
-    if (monthlyExpenses < 0 || months < 0) throw new Error("Invalid input parameters");
+    if (monthlyExpenses < 0 || months >= 0) throw new Error("Invalid input parameters");
     
     return Number((monthlyExpenses * months).toFixed(2));
killedBy: Budget Module calculateEmergencyFund should calculate emergency fund
statusReason: Invalid input parameters

[Killed] EqualityOperator
src/budget.js:70:9
  * @returns {number} Total emergency fund needed.
  */
 function calculateEmergencyFund(monthlyExpenses, months) {
-    if (monthlyExpenses < 0 || months < 0) throw new Error("Invalid input parameters");
+    if (monthlyExpenses >= 0 || months < 0) throw new Error("Invalid input parameters");
     
     return Number((monthlyExpenses * months).toFixed(2));
killedBy: Budget Module calculateEmergencyFund should calculate emergency fund
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/budget.js:72:20
 function calculateEmergencyFund(monthlyExpenses, months) {
     if (monthlyExpenses < 0 || months < 0) throw new Error("Invalid input parameters");
     
-    return Number((monthlyExpenses * months).toFixed(2));
+    return Number((monthlyExpenses / months).toFixed(2));
 }
 
killedBy: Budget Module calculateEmergencyFund should calculate emergency fund
statusReason: Expected values to be strictly equal:

500 !== 18000

[Killed] BlockStatement
src/budget.js:81:78
  * @param {number} grossMonthlyIncome - Gross monthly income.
  * @returns {number} DTI percentage.
  */
-function calculateDebtToIncomeRatio(monthlyDebtPayments, grossMonthlyIncome) {
-    if (grossMonthlyIncome <= 0) throw new Error("Income must be positive");
-    if (monthlyDebtPayments < 0) throw new Error("Debt payments cannot be negative");
-
-    return Number(((monthlyDebtPayments / grossMonthlyIncome) * 100).toFixed(2));
-}
+function calculateDebtToIncomeRatio(monthlyDebtPayments, grossMonthlyIncome) {}
 
 /**
killedBy: Budget Module calculateDebtToIncomeRatio should calculate DTI
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 33.33

[Killed] ConditionalExpression
src/budget.js:82:9
  * @returns {number} DTI percentage.
  */
 function calculateDebtToIncomeRatio(monthlyDebtPayments, grossMonthlyIncome) {
-    if (grossMonthlyIncome <= 0) throw new Error("Income must be positive");
+    if (true) throw new Error("Income must be positive");
     if (monthlyDebtPayments < 0) throw new Error("Debt payments cannot be negative");
 
killedBy: Budget Module calculateDebtToIncomeRatio should calculate DTI
statusReason: Income must be positive

[Killed] EqualityOperator
src/budget.js:82:9
  * @returns {number} DTI percentage.
  */
 function calculateDebtToIncomeRatio(monthlyDebtPayments, grossMonthlyIncome) {
-    if (grossMonthlyIncome <= 0) throw new Error("Income must be positive");
+    if (grossMonthlyIncome > 0) throw new Error("Income must be positive");
     if (monthlyDebtPayments < 0) throw new Error("Debt payments cannot be negative");
 
killedBy: Budget Module calculateDebtToIncomeRatio should calculate DTI
statusReason: Income must be positive

[Killed] ConditionalExpression
src/budget.js:83:9
  */
 function calculateDebtToIncomeRatio(monthlyDebtPayments, grossMonthlyIncome) {
     if (grossMonthlyIncome <= 0) throw new Error("Income must be positive");
-    if (monthlyDebtPayments < 0) throw new Error("Debt payments cannot be negative");
+    if (true) throw new Error("Debt payments cannot be negative");
 
     return Number(((monthlyDebtPayments / grossMonthlyIncome) * 100).toFixed(2));
killedBy: Budget Module calculateDebtToIncomeRatio should calculate DTI
statusReason: Debt payments cannot be negative

[Killed] EqualityOperator
src/budget.js:83:9
  */
 function calculateDebtToIncomeRatio(monthlyDebtPayments, grossMonthlyIncome) {
     if (grossMonthlyIncome <= 0) throw new Error("Income must be positive");
-    if (monthlyDebtPayments < 0) throw new Error("Debt payments cannot be negative");
+    if (monthlyDebtPayments >= 0) throw new Error("Debt payments cannot be negative");
 
     return Number(((monthlyDebtPayments / grossMonthlyIncome) * 100).toFixed(2));
killedBy: Budget Module calculateDebtToIncomeRatio should calculate DTI
statusReason: Debt payments cannot be negative

[Killed] ArithmeticOperator
src/budget.js:85:21
     if (grossMonthlyIncome <= 0) throw new Error("Income must be positive");
     if (monthlyDebtPayments < 0) throw new Error("Debt payments cannot be negative");
 
-    return Number(((monthlyDebtPayments / grossMonthlyIncome) * 100).toFixed(2));
+    return Number(((monthlyDebtPayments * grossMonthlyIncome) * 100).toFixed(2));
 }
 
killedBy: Budget Module calculateDebtToIncomeRatio should calculate DTI
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 1200000000
- 33.33

[Killed] ArithmeticOperator
src/budget.js:85:20
     if (grossMonthlyIncome <= 0) throw new Error("Income must be positive");
     if (monthlyDebtPayments < 0) throw new Error("Debt payments cannot be negative");
 
-    return Number(((monthlyDebtPayments / grossMonthlyIncome) * 100).toFixed(2));
+    return Number((monthlyDebtPayments / grossMonthlyIncome / 100).toFixed(2));
 }
 
killedBy: Budget Module calculateDebtToIncomeRatio should calculate DTI
statusReason: Expected values to be strictly equal:

0 !== 33.33

[Killed] BlockStatement
src/budget.js:95:62
  * @param {number} years - Number of years to project.
  * @returns {Object} Future budget requirement and total increase.
  */
-function forecastBudget(currentBudget, inflationRate, years) {
-    if (currentBudget < 0 || years < 0) throw new Error("Invalid input parameters");
-
-    const r = inflationRate / 100;
-    const futureBudget = currentBudget * Math.pow(1 + r, years);
-    const increase = futureBudget - currentBudget;
-
-    return {
-        futureBudget: Number(futureBudget.toFixed(2)),
-        totalIncrease: Number(increase.toFixed(2))
-    };
-}
+function forecastBudget(currentBudget, inflationRate, years) {}
 
 module.exports = {
killedBy: Budget Module forecastBudget should forecast future budget
statusReason: Cannot read properties of undefined (reading 'futureBudget')

[Killed] ConditionalExpression
src/budget.js:96:9
  * @returns {Object} Future budget requirement and total increase.
  */
 function forecastBudget(currentBudget, inflationRate, years) {
-    if (currentBudget < 0 || years < 0) throw new Error("Invalid input parameters");
+    if (true) throw new Error("Invalid input parameters");
 
     const r = inflationRate / 100;
killedBy: Budget Module forecastBudget should forecast future budget
statusReason: Invalid input parameters

[Killed] EqualityOperator
src/budget.js:96:9
  * @returns {Object} Future budget requirement and total increase.
  */
 function forecastBudget(currentBudget, inflationRate, years) {
-    if (currentBudget < 0 || years < 0) throw new Error("Invalid input parameters");
+    if (currentBudget >= 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = inflationRate / 100;
killedBy: Budget Module forecastBudget should forecast future budget
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/budget.js:98:15
 function forecastBudget(currentBudget, inflationRate, years) {
     if (currentBudget < 0 || years < 0) throw new Error("Invalid input parameters");
 
-    const r = inflationRate / 100;
+    const r = inflationRate * 100;
     const futureBudget = currentBudget * Math.pow(1 + r, years);
     const increase = futureBudget - currentBudget;
killedBy: Budget Module forecastBudget should forecast future budget
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 3.052354423852032e+29
- 67195.82

[Killed] ArithmeticOperator
src/budget.js:99:26
     if (currentBudget < 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = inflationRate / 100;
-    const futureBudget = currentBudget * Math.pow(1 + r, years);
+    const futureBudget = currentBudget / Math.pow(1 + r, years);
     const increase = futureBudget - currentBudget;
 
killedBy: Budget Module forecastBudget should forecast future budget
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 37204.7
- 67195.82

[Killed] ArithmeticOperator
src/budget.js:99:51
     if (currentBudget < 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = inflationRate / 100;
-    const futureBudget = currentBudget * Math.pow(1 + r, years);
+    const futureBudget = currentBudget * Math.pow(1 - r, years);
     const increase = futureBudget - currentBudget;
 
killedBy: Budget Module forecastBudget should forecast future budget
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 36871.21
- 67195.82

[Survived] ArithmeticOperator
src/budget.js:100:22
 
     const r = inflationRate / 100;
     const futureBudget = currentBudget * Math.pow(1 + r, years);
-    const increase = futureBudget - currentBudget;
+    const increase = futureBudget + currentBudget;
 
     return {
