[Killed] BlockStatement
src/creditCard.js:13:69
  * @param {number} monthlyPayment - Fixed monthly payment amount.
  * @returns {number} Months to payoff.
  */
-function calculatePayoffTime(balance, interestRate, monthlyPayment) {
-    if (balance <= 0) return 0;
-    if (interestRate < 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
-
-    const monthlyRate = interestRate / 100 / 12;
-    
-    // Check if payment covers interest
-    if (balance * monthlyRate >= monthlyPayment) {
-        throw new Error("Monthly payment is too low to cover interest");
-    }
-
-    // N = -log(1 - (r * B) / P) / log(1 + r)
-    const numerator = Math.log(1 - (monthlyRate * balance) / monthlyPayment);
-    const denominator = Math.log(1 + monthlyRate);
-    
-    const months = -numerator / denominator;
-    
-    return Math.ceil(months);
-}
+function calculatePayoffTime(balance, interestRate, monthlyPayment) {}
 
 /**
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Expected values to be strictly equal:

undefined !== 11

[Killed] EqualityOperator
src/creditCard.js:14:9
  * @returns {number} Months to payoff.
  */
 function calculatePayoffTime(balance, interestRate, monthlyPayment) {
-    if (balance <= 0) return 0;
+    if (balance < 0) return 0;
     if (interestRate < 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
 
killedBy: Credit Card Module calculatePayoffTime should return 0 for zero or negative balance
statusReason: Expected values to be strictly equal:
+ actual - expected

+ -0
- 0

[Killed] ConditionalExpression
src/creditCard.js:14:9
  * @returns {number} Months to payoff.
  */
 function calculatePayoffTime(balance, interestRate, monthlyPayment) {
-    if (balance <= 0) return 0;
+    if (false) return 0;
     if (interestRate < 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
 
killedBy: Credit Card Module calculatePayoffTime should return 0 for zero or negative balance
statusReason: Expected values to be strictly equal:
+ actual - expected

+ -0
- 0

[Killed] EqualityOperator
src/creditCard.js:15:9
  */
 function calculatePayoffTime(balance, interestRate, monthlyPayment) {
     if (balance <= 0) return 0;
-    if (interestRate < 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
+    if (interestRate >= 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
 
     const monthlyRate = interestRate / 100 / 12;
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Invalid input parameters

[Killed] LogicalOperator
src/creditCard.js:15:9
  */
 function calculatePayoffTime(balance, interestRate, monthlyPayment) {
     if (balance <= 0) return 0;
-    if (interestRate < 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
+    if (interestRate < 0 && monthlyPayment <= 0) throw new Error("Invalid input parameters");
 
     const monthlyRate = interestRate / 100 / 12;
killedBy: Credit Card Module calculatePayoffTime should throw error for invalid inputs
statusReason: Missing expected exception.

[Killed] ArithmeticOperator
src/creditCard.js:17:25
     if (balance <= 0) return 0;
     if (interestRate < 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
 
-    const monthlyRate = interestRate / 100 / 12;
+    const monthlyRate = interestRate * 100 / 12;
     
     // Check if payment covers interest
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Monthly payment is too low to cover interest

[Killed] ArithmeticOperator
src/creditCard.js:17:25
     if (balance <= 0) return 0;
     if (interestRate < 0 || monthlyPayment <= 0) throw new Error("Invalid input parameters");
 
-    const monthlyRate = interestRate / 100 / 12;
+    const monthlyRate = interestRate / 100 * 12;
     
     // Check if payment covers interest
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Monthly payment is too low to cover interest

[Killed] ArithmeticOperator
src/creditCard.js:20:9
     const monthlyRate = interestRate / 100 / 12;
     
     // Check if payment covers interest
-    if (balance * monthlyRate >= monthlyPayment) {
+    if (balance / monthlyRate >= monthlyPayment) {
         throw new Error("Monthly payment is too low to cover interest");
     }
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Monthly payment is too low to cover interest

[Killed] ConditionalExpression
src/creditCard.js:20:9
     const monthlyRate = interestRate / 100 / 12;
     
     // Check if payment covers interest
-    if (balance * monthlyRate >= monthlyPayment) {
+    if (false) {
         throw new Error("Monthly payment is too low to cover interest");
     }
killedBy: Credit Card Module calculatePayoffTime should throw error if payment too low
statusReason: Missing expected exception.

[Killed] ArithmeticOperator
src/creditCard.js:25:36
     }
 
     // N = -log(1 - (r * B) / P) / log(1 + r)
-    const numerator = Math.log(1 - (monthlyRate * balance) / monthlyPayment);
+    const numerator = Math.log(1 - monthlyRate * balance * monthlyPayment);
     const denominator = Math.log(1 + monthlyRate);
     
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Expected values to be strictly equal:

NaN !== 11

[Killed] ArithmeticOperator
src/creditCard.js:25:32
     }
 
     // N = -log(1 - (r * B) / P) / log(1 + r)
-    const numerator = Math.log(1 - (monthlyRate * balance) / monthlyPayment);
+    const numerator = Math.log(1 + monthlyRate * balance / monthlyPayment);
     const denominator = Math.log(1 + monthlyRate);
     
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Expected values to be strictly equal:

-9 !== 11

[Killed] ArithmeticOperator
src/creditCard.js:26:34
 
     // N = -log(1 - (r * B) / P) / log(1 + r)
     const numerator = Math.log(1 - (monthlyRate * balance) / monthlyPayment);
-    const denominator = Math.log(1 + monthlyRate);
+    const denominator = Math.log(1 - monthlyRate);
     
     const months = -numerator / denominator;
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Expected values to be strictly equal:

-10 !== 11

[Killed] ArithmeticOperator
src/creditCard.js:28:20
     const numerator = Math.log(1 - (monthlyRate * balance) / monthlyPayment);
     const denominator = Math.log(1 + monthlyRate);
     
-    const months = -numerator / denominator;
+    const months = -numerator * denominator;
     
     return Math.ceil(months);
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Expected values to be strictly equal:

1 !== 11

[Killed] UnaryOperator
src/creditCard.js:28:20
     const numerator = Math.log(1 - (monthlyRate * balance) / monthlyPayment);
     const denominator = Math.log(1 + monthlyRate);
     
-    const months = -numerator / denominator;
+    const months = +numerator / denominator;
     
     return Math.ceil(months);
killedBy: Credit Card Module calculatePayoffTime should calculate payoff time correctly
statusReason: Expected values to be strictly equal:

-10 !== 11

[Killed] BlockStatement
src/creditCard.js:40:66
  * @param {number} months - Number of months.
  * @returns {number} Total interest charged.
  */
-function calculateInterestCharges(balance, interestRate, months) {
-    if (balance < 0 || interestRate < 0 || months < 0) throw new Error("Invalid input parameters");
-
-    const monthlyRate = interestRate / 100 / 12;
-    const futureValue = balance * Math.pow(1 + monthlyRate, months);
-    
-    return Number((futureValue - balance).toFixed(2));
-}
+function calculateInterestCharges(balance, interestRate, months) {}
 
 /**
killedBy: Credit Card Module calculateInterestCharges should calculate interest charges
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 195.62

[Killed] EqualityOperator
src/creditCard.js:41:24
  * @returns {number} Total interest charged.
  */
 function calculateInterestCharges(balance, interestRate, months) {
-    if (balance < 0 || interestRate < 0 || months < 0) throw new Error("Invalid input parameters");
+    if (balance < 0 || interestRate >= 0 || months < 0) throw new Error("Invalid input parameters");
 
     const monthlyRate = interestRate / 100 / 12;
killedBy: Credit Card Module calculateInterestCharges should calculate interest charges
statusReason: Invalid input parameters

[Killed] ConditionalExpression
src/creditCard.js:41:9
  * @returns {number} Total interest charged.
  */
 function calculateInterestCharges(balance, interestRate, months) {
-    if (balance < 0 || interestRate < 0 || months < 0) throw new Error("Invalid input parameters");
+    if (true) throw new Error("Invalid input parameters");
 
     const monthlyRate = interestRate / 100 / 12;
killedBy: Credit Card Module calculateInterestCharges should calculate interest charges
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/creditCard.js:44:44
     if (balance < 0 || interestRate < 0 || months < 0) throw new Error("Invalid input parameters");
 
     const monthlyRate = interestRate / 100 / 12;
-    const futureValue = balance * Math.pow(1 + monthlyRate, months);
+    const futureValue = balance * Math.pow(1 - monthlyRate, months);
     
     return Number((futureValue - balance).toFixed(2));
killedBy: Credit Card Module calculateInterestCharges should calculate interest charges
statusReason: Expected values to be strictly equal:
+ actual - expected

+ -165.87
- 195.62

[Killed] ArithmeticOperator
src/creditCard.js:44:25
     if (balance < 0 || interestRate < 0 || months < 0) throw new Error("Invalid input parameters");
 
     const monthlyRate = interestRate / 100 / 12;
-    const futureValue = balance * Math.pow(1 + monthlyRate, months);
+    const futureValue = balance / Math.pow(1 + monthlyRate, months);
     
     return Number((futureValue - balance).toFixed(2));
killedBy: Credit Card Module calculateInterestCharges should calculate interest charges
statusReason: Expected values to be strictly equal:
+ actual - expected

+ -163.61
- 195.62

[Killed] ArithmeticOperator
src/creditCard.js:46:20
     const monthlyRate = interestRate / 100 / 12;
     const futureValue = balance * Math.pow(1 + monthlyRate, months);
     
-    return Number((futureValue - balance).toFixed(2));
+    return Number((futureValue + balance).toFixed(2));
 }
 
killedBy: Credit Card Module calculateInterestCharges should calculate interest charges
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 2195.62
- 195.62

[Killed] BlockStatement
src/creditCard.js:55:59
  * @param {number} minPaymentRate - Minimum payment percentage (e.g., 2%).
  * @returns {number} Minimum payment amount.
  */
-function calculateMinimumPayment(balance, minPaymentRate) {
-    if (balance < 0 || minPaymentRate < 0) throw new Error("Invalid input parameters");
-    
-    const payment = balance * (minPaymentRate / 100);
-    // Usually there's a floor, e.g., $25. Let's assume a $25 floor or the balance if lower.
-    const floor = 25;
-    
-    if (balance < floor) return balance;
-    return Number(Math.max(payment, floor).toFixed(2));
-}
+function calculateMinimumPayment(balance, minPaymentRate) {}
 
 /**
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Expected values to be strictly equal:

undefined !== 40

[Killed] EqualityOperator
src/creditCard.js:56:24
  * @returns {number} Minimum payment amount.
  */
 function calculateMinimumPayment(balance, minPaymentRate) {
-    if (balance < 0 || minPaymentRate < 0) throw new Error("Invalid input parameters");
+    if (balance < 0 || minPaymentRate >= 0) throw new Error("Invalid input parameters");
     
     const payment = balance * (minPaymentRate / 100);
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Invalid input parameters

[Killed] ConditionalExpression
src/creditCard.js:56:9
  * @returns {number} Minimum payment amount.
  */
 function calculateMinimumPayment(balance, minPaymentRate) {
-    if (balance < 0 || minPaymentRate < 0) throw new Error("Invalid input parameters");
+    if (true) throw new Error("Invalid input parameters");
     
     const payment = balance * (minPaymentRate / 100);
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/creditCard.js:58:21
 function calculateMinimumPayment(balance, minPaymentRate) {
     if (balance < 0 || minPaymentRate < 0) throw new Error("Invalid input parameters");
     
-    const payment = balance * (minPaymentRate / 100);
+    const payment = balance / (minPaymentRate / 100);
     // Usually there's a floor, e.g., $25. Let's assume a $25 floor or the balance if lower.
     const floor = 25;
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Expected values to be strictly equal:

100000 !== 40

[Killed] ArithmeticOperator
src/creditCard.js:58:32
 function calculateMinimumPayment(balance, minPaymentRate) {
     if (balance < 0 || minPaymentRate < 0) throw new Error("Invalid input parameters");
     
-    const payment = balance * (minPaymentRate / 100);
+    const payment = balance * (minPaymentRate * 100);
     // Usually there's a floor, e.g., $25. Let's assume a $25 floor or the balance if lower.
     const floor = 25;
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Expected values to be strictly equal:

400000 !== 40

[Killed] EqualityOperator
src/creditCard.js:62:9
     // Usually there's a floor, e.g., $25. Let's assume a $25 floor or the balance if lower.
     const floor = 25;
     
-    if (balance < floor) return balance;
+    if (balance >= floor) return balance;
     return Number(Math.max(payment, floor).toFixed(2));
 }
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Expected values to be strictly equal:

2000 !== 40

[Killed] ConditionalExpression
src/creditCard.js:62:9
     // Usually there's a floor, e.g., $25. Let's assume a $25 floor or the balance if lower.
     const floor = 25;
     
-    if (balance < floor) return balance;
+    if (true) return balance;
     return Number(Math.max(payment, floor).toFixed(2));
 }
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Expected values to be strictly equal:

2000 !== 40

[Killed] MethodExpression
src/creditCard.js:63:19
     const floor = 25;
     
     if (balance < floor) return balance;
-    return Number(Math.max(payment, floor).toFixed(2));
+    return Number(Math.min(payment, floor).toFixed(2));
 }
 
killedBy: Credit Card Module calculateMinimumPayment should calculate minimum payment
statusReason: Expected values to be strictly equal:

25 !== 40

[Killed] BlockStatement
src/creditCard.js:73:50
  * @param {number} annualSpend - Total annual spending.
  * @returns {Object} Comparison result.
  */
-function compareCards(card1, card2, annualSpend) {
-    if (annualSpend < 0) throw new Error("Annual spend cannot be negative");
-
-    const calculateNetValue = (card) => {
-        const rewards = annualSpend * (card.rewardRate / 100);
-        return rewards - card.annualFee;
-    };
-
-    const net1 = calculateNetValue(card1);
-    const net2 = calculateNetValue(card2);
-
-    let betterCard = null;
-    if (net1 > net2) betterCard = card1.name;
-    else if (net2 > net1) betterCard = card2.name;
-    else betterCard = "Equal";
-
-    return {
-        [card1.name]: Number(net1.toFixed(2)),
-        [card2.name]: Number(net2.toFixed(2)),
-        betterChoice: betterCard,
-        difference: Number(Math.abs(net1 - net2).toFixed(2))
-    };
-}
+function compareCards(card1, card2, annualSpend) {}
 
 module.exports = {
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Cannot read properties of undefined (reading 'betterChoice')

[Killed] EqualityOperator
src/creditCard.js:74:9
  * @returns {Object} Comparison result.
  */
 function compareCards(card1, card2, annualSpend) {
-    if (annualSpend < 0) throw new Error("Annual spend cannot be negative");
+    if (annualSpend >= 0) throw new Error("Annual spend cannot be negative");
 
     const calculateNetValue = (card) => {
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Annual spend cannot be negative

[Killed] ConditionalExpression
src/creditCard.js:74:9
  * @returns {Object} Comparison result.
  */
 function compareCards(card1, card2, annualSpend) {
-    if (annualSpend < 0) throw new Error("Annual spend cannot be negative");
+    if (true) throw new Error("Annual spend cannot be negative");
 
     const calculateNetValue = (card) => {
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Annual spend cannot be negative

[Killed] BlockStatement
src/creditCard.js:76:41
 function compareCards(card1, card2, annualSpend) {
     if (annualSpend < 0) throw new Error("Annual spend cannot be negative");
 
-    const calculateNetValue = (card) => {
-        const rewards = annualSpend * (card.rewardRate / 100);
-        return rewards - card.annualFee;
-    };
+    const calculateNetValue = (card) => {};
 
     const net1 = calculateNetValue(card1);
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/creditCard.js:77:40
     if (annualSpend < 0) throw new Error("Annual spend cannot be negative");
 
     const calculateNetValue = (card) => {
-        const rewards = annualSpend * (card.rewardRate / 100);
+        const rewards = annualSpend * (card.rewardRate * 100);
         return rewards - card.annualFee;
     };
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Expected values to be strictly equal:

2000000 !== 200

[Killed] ArithmeticOperator
src/creditCard.js:77:25
     if (annualSpend < 0) throw new Error("Annual spend cannot be negative");
 
     const calculateNetValue = (card) => {
-        const rewards = annualSpend * (card.rewardRate / 100);
+        const rewards = annualSpend / (card.rewardRate / 100);
         return rewards - card.annualFee;
     };
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Expected values to be strictly equal:

'A' !== 'B'

[Killed] ArithmeticOperator
src/creditCard.js:78:16
 
     const calculateNetValue = (card) => {
         const rewards = annualSpend * (card.rewardRate / 100);
-        return rewards - card.annualFee;
+        return rewards + card.annualFee;
     };
 
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Expected values to be strictly equal:

495 !== 305

[Killed] ConditionalExpression
src/creditCard.js:85:9
     const net2 = calculateNetValue(card2);
 
     let betterCard = null;
-    if (net1 > net2) betterCard = card1.name;
+    if (true) betterCard = card1.name;
     else if (net2 > net1) betterCard = card2.name;
     else betterCard = "Equal";
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Expected values to be strictly equal:

'A' !== 'B'

[Killed] EqualityOperator
src/creditCard.js:85:9
     const net2 = calculateNetValue(card2);
 
     let betterCard = null;
-    if (net1 > net2) betterCard = card1.name;
+    if (net1 <= net2) betterCard = card1.name;
     else if (net2 > net1) betterCard = card2.name;
     else betterCard = "Equal";
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Expected values to be strictly equal:

'A' !== 'B'

[Killed] ConditionalExpression
src/creditCard.js:86:14
 
     let betterCard = null;
     if (net1 > net2) betterCard = card1.name;
-    else if (net2 > net1) betterCard = card2.name;
+    else if (false) betterCard = card2.name;
     else betterCard = "Equal";
 
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Expected values to be strictly equal:

'Equal' !== 'B'

[Killed] EqualityOperator
src/creditCard.js:86:14
 
     let betterCard = null;
     if (net1 > net2) betterCard = card1.name;
-    else if (net2 > net1) betterCard = card2.name;
+    else if (net2 <= net1) betterCard = card2.name;
     else betterCard = "Equal";
 
killedBy: Credit Card Module compareCards should compare cards correctly
statusReason: Expected values to be strictly equal:

'Equal' !== 'B'

[NoCoverage] StringLiteral
src/creditCard.js:87:23
     let betterCard = null;
     if (net1 > net2) betterCard = card1.name;
     else if (net2 > net1) betterCard = card2.name;
-    else betterCard = "Equal";
+    else betterCard = "";
 
     return {

[Survived] ArithmeticOperator
src/creditCard.js:93:37
         [card1.name]: Number(net1.toFixed(2)),
         [card2.name]: Number(net2.toFixed(2)),
         betterChoice: betterCard,
-        difference: Number(Math.abs(net1 - net2).toFixed(2))
+        difference: Number(Math.abs(net1 + net2).toFixed(2))
     };
 }
