[Killed] BlockStatement
src/loan.js:8:68
  * @param {number} termYears - The term of the loan in years.
  * @returns {number} The monthly payment amount.
  */
-function calculateMonthlyPayment(principal, annualRate, termYears) {
-  if (principal <= 0 || annualRate < 0 || termYears <= 0) {
-    throw new Error("Invalid input parameters");
-  }
-
-  if (annualRate === 0) {
-    return principal / (termYears * 12);
-  }
-
-  const monthlyRate = annualRate / 100 / 12;
-  const numberOfPayments = termYears * 12;
-
-  const numerator = principal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
-  const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
-
-  return numerator / denominator;
-}
+function calculateMonthlyPayment(principal, annualRate, termYears) {}
 
 /**
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] ConditionalExpression
src/loan.js:9:7
  * @returns {number} The monthly payment amount.
  */
 function calculateMonthlyPayment(principal, annualRate, termYears) {
-  if (principal <= 0 || annualRate < 0 || termYears <= 0) {
+  if (true) {
     throw new Error("Invalid input parameters");
   }
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Invalid input parameters

[Killed] ConditionalExpression
src/loan.js:9:43
  * @returns {number} The monthly payment amount.
  */
 function calculateMonthlyPayment(principal, annualRate, termYears) {
-  if (principal <= 0 || annualRate < 0 || termYears <= 0) {
+  if (principal <= 0 || annualRate < 0 || false) {
     throw new Error("Invalid input parameters");
   }
killedBy: Loan Module calculateMonthlyPayment should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/loan.js:10:21
  */
 function calculateMonthlyPayment(principal, annualRate, termYears) {
   if (principal <= 0 || annualRate < 0 || termYears <= 0) {
-    throw new Error("Invalid input parameters");
+    throw new Error("");
   }
 
killedBy: Loan Module calculateMonthlyPayment should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got ''

[Killed] ConditionalExpression
src/loan.js:13:7
     throw new Error("Invalid input parameters");
   }
 
-  if (annualRate === 0) {
+  if (false) {
     return principal / (termYears * 12);
   }
killedBy: Loan Module calculateMonthlyPayment should handle zero interest rate
statusReason: expected NaN to be close to 833.33 +/- 0.01

[Killed] ConditionalExpression
src/loan.js:13:7
     throw new Error("Invalid input parameters");
   }
 
-  if (annualRate === 0) {
+  if (true) {
     return principal / (termYears * 12);
   }
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Mortgage should decrease

[Killed] ArithmeticOperator
src/loan.js:14:25
   }
 
   if (annualRate === 0) {
-    return principal / (termYears * 12);
+    return principal / (termYears / 12);
   }
 
killedBy: Loan Module calculateMonthlyPayment should handle zero interest rate
statusReason: expected 120000 to be close to 833.33 +/- 0.01

[Killed] ArithmeticOperator
src/loan.js:14:12
   }
 
   if (annualRate === 0) {
-    return principal / (termYears * 12);
+    return principal * (termYears * 12);
   }
 
killedBy: Loan Module calculateMonthlyPayment should handle zero interest rate
statusReason: expected 12000000 to be close to 833.33 +/- 0.01

[Killed] ArithmeticOperator
src/loan.js:17:23
     return principal / (termYears * 12);
   }
 
-  const monthlyRate = annualRate / 100 / 12;
+  const monthlyRate = annualRate * 100 / 12;
   const numberOfPayments = termYears * 12;
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Net worth should be positive

[Killed] ArithmeticOperator
src/loan.js:17:23
     return principal / (termYears * 12);
   }
 
-  const monthlyRate = annualRate / 100 / 12;
+  const monthlyRate = annualRate / 100 * 12;
   const numberOfPayments = termYears * 12;
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] ArithmeticOperator
src/loan.js:18:28
   }
 
   const monthlyRate = annualRate / 100 / 12;
-  const numberOfPayments = termYears * 12;
+  const numberOfPayments = termYears / 12;
 
   const numerator = principal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] ArithmeticOperator
src/loan.js:20:21
   const monthlyRate = annualRate / 100 / 12;
   const numberOfPayments = termYears * 12;
 
-  const numerator = principal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
+  const numerator = principal / monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
   const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] ArithmeticOperator
src/loan.js:20:56
   const monthlyRate = annualRate / 100 / 12;
   const numberOfPayments = termYears * 12;
 
-  const numerator = principal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
+  const numerator = principal * monthlyRate * Math.pow(1 - monthlyRate, numberOfPayments);
   const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Mortgage should decrease

[Killed] ArithmeticOperator
src/loan.js:21:23
   const numberOfPayments = termYears * 12;
 
   const numerator = principal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
-  const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
+  const denominator = Math.pow(1 + monthlyRate, numberOfPayments) + 1;
 
   return numerator / denominator;
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Mortgage should decrease

[Killed] ArithmeticOperator
src/loan.js:21:32
   const numberOfPayments = termYears * 12;
 
   const numerator = principal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
-  const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
+  const denominator = Math.pow(1 - monthlyRate, numberOfPayments) - 1;
 
   return numerator / denominator;
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Net worth should be positive

[Killed] ArithmeticOperator
src/loan.js:23:10
   const numerator = principal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
   const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
 
-  return numerator / denominator;
+  return numerator * denominator;
 }
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] ArithmeticOperator
src/loan.js:35:25
  */
 function calculateAmortizationSchedule(principal, annualRate, termYears) {
     const monthlyPayment = calculateMonthlyPayment(principal, annualRate, termYears);
-    const monthlyRate = annualRate / 100 / 12;
+    const monthlyRate = annualRate / 100 * 12;
     const numberOfPayments = termYears * 12;
     
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Net worth should be positive

[Killed] ArithmeticOperator
src/loan.js:35:25
  */
 function calculateAmortizationSchedule(principal, annualRate, termYears) {
     const monthlyPayment = calculateMonthlyPayment(principal, annualRate, termYears);
-    const monthlyRate = annualRate / 100 / 12;
+    const monthlyRate = annualRate * 100 / 12;
     const numberOfPayments = termYears * 12;
     
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Net worth should be positive

[Killed] BlockStatement
src/loan.js:41:49
     let balance = principal;
     const schedule = [];
 
-    for (let i = 1; i <= numberOfPayments; i++) {
-        const interestPayment = balance * monthlyRate;
-        let principalPayment = monthlyPayment - interestPayment;
-        
-        // Adjust for the last payment to bring balance exactly to 0
-        if (balance - principalPayment < 0.01) {
-             principalPayment = balance;
-        }
-
-        balance -= principalPayment;
-        
-        // Handle floating point errors near zero
-        if (balance < 0) balance = 0;
-
-        schedule.push({
-            paymentNumber: i,
-            payment: Number(monthlyPayment.toFixed(2)),
-            principalPayment: Number(principalPayment.toFixed(2)),
-            interestPayment: Number(interestPayment.toFixed(2)),
-            balance: Number(balance.toFixed(2))
-        });
-        
-        if (balance === 0) break;
-    }
+    for (let i = 1; i <= numberOfPayments; i++) {}
 
     return schedule;
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] EqualityOperator
src/loan.js:41:21
     let balance = principal;
     const schedule = [];
 
-    for (let i = 1; i <= numberOfPayments; i++) {
+    for (let i = 1; i < numberOfPayments; i++) {
         const interestPayment = balance * monthlyRate;
         let principalPayment = monthlyPayment - interestPayment;
killedBy: Loan Module calculateAmortizationSchedule should generate correct number of payments
statusReason: expected [ { paymentNumber: 1, …(4) }, …(10) ] to have a length of 12 but got 11

[Killed] ArithmeticOperator
src/loan.js:42:33
     const schedule = [];
 
     for (let i = 1; i <= numberOfPayments; i++) {
-        const interestPayment = balance * monthlyRate;
+        const interestPayment = balance / monthlyRate;
         let principalPayment = monthlyPayment - interestPayment;
         
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Net worth should be positive

[Killed] ArithmeticOperator
src/loan.js:43:32
 
     for (let i = 1; i <= numberOfPayments; i++) {
         const interestPayment = balance * monthlyRate;
-        let principalPayment = monthlyPayment - interestPayment;
+        let principalPayment = monthlyPayment + interestPayment;
         
         // Adjust for the last payment to bring balance exactly to 0
killedBy: Loan Module calculateAmortizationSchedule should verify specific schedule values
statusReason: Cannot read properties of undefined (reading 'paymentNumber')

[Killed] ConditionalExpression
src/loan.js:46:13
         let principalPayment = monthlyPayment - interestPayment;
         
         // Adjust for the last payment to bring balance exactly to 0
-        if (balance - principalPayment < 0.01) {
+        if (true) {
              principalPayment = balance;
         }
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] EqualityOperator
src/loan.js:46:13
         let principalPayment = monthlyPayment - interestPayment;
         
         // Adjust for the last payment to bring balance exactly to 0
-        if (balance - principalPayment < 0.01) {
+        if (balance - principalPayment >= 0.01) {
              principalPayment = balance;
         }
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] AssignmentOperator
src/loan.js:50:9
              principalPayment = balance;
         }
 
-        balance -= principalPayment;
+        balance += principalPayment;
         
         // Handle floating point errors near zero
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Mortgage should decrease

[Killed] ConditionalExpression
src/loan.js:53:13
         balance -= principalPayment;
         
         // Handle floating point errors near zero
-        if (balance < 0) balance = 0;
+        if (true) balance = 0;
 
         schedule.push({
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] EqualityOperator
src/loan.js:53:13
         balance -= principalPayment;
         
         // Handle floating point errors near zero
-        if (balance < 0) balance = 0;
+        if (balance >= 0) balance = 0;
 
         schedule.push({
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] ConditionalExpression
src/loan.js:63:13
             balance: Number(balance.toFixed(2))
         });
         
-        if (balance === 0) break;
+        if (true) break;
     }
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] EqualityOperator
src/loan.js:63:13
             balance: Number(balance.toFixed(2))
         });
         
-        if (balance === 0) break;
+        if (balance !== 0) break;
     }
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] ConditionalExpression
src/loan.js:80:9
  * @returns {Object} Analysis of savings and break-even point.
  */
 function calculateRefinanceImpact(currentPrincipal, currentRate, currentRemainingTerm, newRate, newTermYears, closingCosts) {
-    if (currentPrincipal <= 0 || currentRate < 0 || currentRemainingTerm <= 0 || newRate < 0 || newTermYears <= 0 || closingCosts < 0) {
+    if (true) {
         throw new Error("Invalid input parameters");
     }
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: Invalid input parameters

[Killed] BlockStatement
src/loan.js:80:136
  * @returns {Object} Analysis of savings and break-even point.
  */
 function calculateRefinanceImpact(currentPrincipal, currentRate, currentRemainingTerm, newRate, newTermYears, closingCosts) {
-    if (currentPrincipal <= 0 || currentRate < 0 || currentRemainingTerm <= 0 || newRate < 0 || newTermYears <= 0 || closingCosts < 0) {
-        throw new Error("Invalid input parameters");
-    }
+    if (currentPrincipal <= 0 || currentRate < 0 || currentRemainingTerm <= 0 || newRate < 0 || newTermYears <= 0 || closingCosts < 0) {}
 
     // Current Loan Details
killedBy: Loan Module calculateRefinanceImpact should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/loan.js:85:32
     }
 
     // Current Loan Details
-    const currentMonthlyRate = currentRate / 100 / 12;
+    const currentMonthlyRate = currentRate * 100 / 12;
     // Calculate current monthly payment based on remaining term (assuming fully amortizing)
     // Formula: P * r * (1+r)^n / ((1+r)^n - 1)
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected NaN to be above +0

[Killed] ArithmeticOperator
src/loan.js:85:32
     }
 
     // Current Loan Details
-    const currentMonthlyRate = currentRate / 100 / 12;
+    const currentMonthlyRate = currentRate / 100 * 12;
     // Calculate current monthly payment based on remaining term (assuming fully amortizing)
     // Formula: P * r * (1+r)^n / ((1+r)^n - 1)
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected 1 to equal 18

[Killed] ArithmeticOperator
src/loan.js:88:28
     const currentMonthlyRate = currentRate / 100 / 12;
     // Calculate current monthly payment based on remaining term (assuming fully amortizing)
     // Formula: P * r * (1+r)^n / ((1+r)^n - 1)
-    const currentPayment = currentPrincipal * currentMonthlyRate * Math.pow(1 + currentMonthlyRate, currentRemainingTerm) / (Math.pow(1 + currentMonthlyRate, currentRemainingTerm) - 1);
+    const currentPayment = currentPrincipal * currentMonthlyRate / Math.pow(1 + currentMonthlyRate, currentRemainingTerm) / (Math.pow(1 + currentMonthlyRate, currentRemainingTerm) - 1);
     const totalCurrentCost = currentPayment * currentRemainingTerm;
 
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected -904.78 to be above +0

[Killed] ArithmeticOperator
src/loan.js:88:77
     const currentMonthlyRate = currentRate / 100 / 12;
     // Calculate current monthly payment based on remaining term (assuming fully amortizing)
     // Formula: P * r * (1+r)^n / ((1+r)^n - 1)
-    const currentPayment = currentPrincipal * currentMonthlyRate * Math.pow(1 + currentMonthlyRate, currentRemainingTerm) / (Math.pow(1 + currentMonthlyRate, currentRemainingTerm) - 1);
+    const currentPayment = currentPrincipal * currentMonthlyRate * Math.pow(1 - currentMonthlyRate, currentRemainingTerm) / (Math.pow(1 + currentMonthlyRate, currentRemainingTerm) - 1);
     const totalCurrentCost = currentPayment * currentRemainingTerm;
 
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected -905.28 to be above +0

[Survived] ArithmeticOperator
src/loan.js:89:30
     // Calculate current monthly payment based on remaining term (assuming fully amortizing)
     // Formula: P * r * (1+r)^n / ((1+r)^n - 1)
     const currentPayment = currentPrincipal * currentMonthlyRate * Math.pow(1 + currentMonthlyRate, currentRemainingTerm) / (Math.pow(1 + currentMonthlyRate, currentRemainingTerm) - 1);
-    const totalCurrentCost = currentPayment * currentRemainingTerm;
+    const totalCurrentCost = currentPayment / currentRemainingTerm;
 
     // New Loan Details

[Survived] ArithmeticOperator
src/loan.js:93:32
 
     // New Loan Details
     const newMonthlyPayment = calculateMonthlyPayment(currentPrincipal, newRate, newTermYears);
-    const newTotalTermMonths = newTermYears * 12;
+    const newTotalTermMonths = newTermYears / 12;
     const totalNewCost = (newMonthlyPayment * newTotalTermMonths) + closingCosts;
 

[Survived] ArithmeticOperator
src/loan.js:94:27
     // New Loan Details
     const newMonthlyPayment = calculateMonthlyPayment(currentPrincipal, newRate, newTermYears);
     const newTotalTermMonths = newTermYears * 12;
-    const totalNewCost = (newMonthlyPayment * newTotalTermMonths) + closingCosts;
+    const totalNewCost = (newMonthlyPayment / newTotalTermMonths) + closingCosts;
 
     const monthlySavings = currentPayment - newMonthlyPayment;

[Survived] ArithmeticOperator
src/loan.js:94:26
     // New Loan Details
     const newMonthlyPayment = calculateMonthlyPayment(currentPrincipal, newRate, newTermYears);
     const newTotalTermMonths = newTermYears * 12;
-    const totalNewCost = (newMonthlyPayment * newTotalTermMonths) + closingCosts;
+    const totalNewCost = newMonthlyPayment * newTotalTermMonths - closingCosts;
 
     const monthlySavings = currentPayment - newMonthlyPayment;

[Killed] ArithmeticOperator
src/loan.js:96:28
     const newTotalTermMonths = newTermYears * 12;
     const totalNewCost = (newMonthlyPayment * newTotalTermMonths) + closingCosts;
 
-    const monthlySavings = currentPayment - newMonthlyPayment;
+    const monthlySavings = currentPayment + newMonthlyPayment;
     const totalSavings = totalCurrentCost - totalNewCost;
     
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected 2 to equal 18

[Survived] ArithmeticOperator
src/loan.js:97:26
     const totalNewCost = (newMonthlyPayment * newTotalTermMonths) + closingCosts;
 
     const monthlySavings = currentPayment - newMonthlyPayment;
-    const totalSavings = totalCurrentCost - totalNewCost;
+    const totalSavings = totalCurrentCost + totalNewCost;
     
     let breakEvenMonths = 0;

[Killed] BlockStatement
src/loan.js:100:29
     const totalSavings = totalCurrentCost - totalNewCost;
     
     let breakEvenMonths = 0;
-    if (monthlySavings > 0) {
-        breakEvenMonths = Math.ceil(closingCosts / monthlySavings);
-    } else {
+    if (monthlySavings > 0) {} else {
         breakEvenMonths = Infinity; // Never break even if new payment is higher
     }
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected +0 to equal 18

[Killed] EqualityOperator
src/loan.js:100:9
     const totalSavings = totalCurrentCost - totalNewCost;
     
     let breakEvenMonths = 0;
-    if (monthlySavings > 0) {
+    if (monthlySavings <= 0) {
         breakEvenMonths = Math.ceil(closingCosts / monthlySavings);
     } else {
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected Infinity to equal 18

[Killed] ArithmeticOperator
src/loan.js:101:37
     
     let breakEvenMonths = 0;
     if (monthlySavings > 0) {
-        breakEvenMonths = Math.ceil(closingCosts / monthlySavings);
+        breakEvenMonths = Math.ceil(closingCosts * monthlySavings);
     } else {
         breakEvenMonths = Infinity; // Never break even if new payment is higher
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected 503799 to equal 18

[Killed] BlockStatement
src/loan.js:102:12
     let breakEvenMonths = 0;
     if (monthlySavings > 0) {
         breakEvenMonths = Math.ceil(closingCosts / monthlySavings);
-    } else {
-        breakEvenMonths = Infinity; // Never break even if new payment is higher
-    }
+    } else {}
 
     return {
killedBy: Loan Module calculateRefinanceImpact should handle negative savings (bad refinance)
statusReason: expected +0 to equal Infinity

[Killed] ObjectLiteral
src/loan.js:106:12
         breakEvenMonths = Infinity; // Never break even if new payment is higher
     }
 
-    return {
-        currentMonthlyPayment: Number(currentPayment.toFixed(2)),
-        newMonthlyPayment: Number(newMonthlyPayment.toFixed(2)),
-        monthlySavings: Number(monthlySavings.toFixed(2)),
-        totalSavings: Number(totalSavings.toFixed(2)),
-        breakEvenMonths: breakEvenMonths
-    };
+    return {};
 }
 
killedBy: Loan Module calculateRefinanceImpact should calculate refinance savings correctly
statusReason: expected undefined to be a number or a date

[Killed] ConditionalExpression
src/loan.js:124:9
  * @returns {Object} Schedule and savings summary.
  */
 function calculateExtraPaymentSchedule(principal, annualRate, termYears, extraPayment) {
-    if (principal <= 0 || annualRate < 0 || termYears <= 0 || extraPayment < 0) {
+    if (false) {
         throw new Error("Invalid input parameters");
     }
killedBy: Loan Module calculateExtraPaymentSchedule should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/loan.js:124:45
  * @returns {Object} Schedule and savings summary.
  */
 function calculateExtraPaymentSchedule(principal, annualRate, termYears, extraPayment) {
-    if (principal <= 0 || annualRate < 0 || termYears <= 0 || extraPayment < 0) {
+    if (principal <= 0 || annualRate < 0 || termYears > 0 || extraPayment < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: Invalid input parameters

[Killed] StringLiteral
src/loan.js:125:25
  */
 function calculateExtraPaymentSchedule(principal, annualRate, termYears, extraPayment) {
     if (principal <= 0 || annualRate < 0 || termYears <= 0 || extraPayment < 0) {
-        throw new Error("Invalid input parameters");
+        throw new Error("");
     }
 
killedBy: Loan Module calculateExtraPaymentSchedule should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got ''

[Killed] ArithmeticOperator
src/loan.js:129:26
     }
 
     const regularPayment = calculateMonthlyPayment(principal, annualRate, termYears);
-    const totalPayment = regularPayment + extraPayment;
+    const totalPayment = regularPayment - extraPayment;
     const monthlyRate = annualRate / 100 / 12;
     
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected 721 to be below 360

[Killed] ArithmeticOperator
src/loan.js:130:25
 
     const regularPayment = calculateMonthlyPayment(principal, annualRate, termYears);
     const totalPayment = regularPayment + extraPayment;
-    const monthlyRate = annualRate / 100 / 12;
+    const monthlyRate = annualRate * 100 / 12;
     
     let balance = principal;
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected 721 to be below 360

[Killed] ArithmeticOperator
src/loan.js:130:25
 
     const regularPayment = calculateMonthlyPayment(principal, annualRate, termYears);
     const totalPayment = regularPayment + extraPayment;
-    const monthlyRate = annualRate / 100 / 12;
+    const monthlyRate = annualRate / 100 * 12;
     
     let balance = principal;
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected 721 to be below 360

[Killed] ConditionalExpression
src/loan.js:137:12
     let months = 0;
     const schedule = [];
 
-    while (balance > 0) {
+    while (false) {
         months++;
         const interestPayment = balance * monthlyRate;
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected +0 to equal 360

[Killed] EqualityOperator
src/loan.js:137:12
     let months = 0;
     const schedule = [];
 
-    while (balance > 0) {
+    while (balance >= 0) {
         months++;
         const interestPayment = balance * monthlyRate;
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected 721 to be below 360

[Killed] UpdateOperator
src/loan.js:138:9
     const schedule = [];
 
     while (balance > 0) {
-        months++;
+        months--;
         const interestPayment = balance * monthlyRate;
         let principalPayment = totalPayment - interestPayment;
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected -360 to equal 360

[Killed] ArithmeticOperator
src/loan.js:139:33
 
     while (balance > 0) {
         months++;
-        const interestPayment = balance * monthlyRate;
+        const interestPayment = balance / monthlyRate;
         let principalPayment = totalPayment - interestPayment;
         
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected 721 to be below 360

[Killed] ArithmeticOperator
src/loan.js:140:32
     while (balance > 0) {
         months++;
         const interestPayment = balance * monthlyRate;
-        let principalPayment = totalPayment - interestPayment;
+        let principalPayment = totalPayment + interestPayment;
         
         if (balance - principalPayment < 0.01) {
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 138 to equal 360

[Killed] ConditionalExpression
src/loan.js:142:13
         const interestPayment = balance * monthlyRate;
         let principalPayment = totalPayment - interestPayment;
         
-        if (balance - principalPayment < 0.01) {
+        if (true) {
             principalPayment = balance;
         }
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 1 to equal 360

[Killed] EqualityOperator
src/loan.js:142:13
         const interestPayment = balance * monthlyRate;
         let principalPayment = totalPayment - interestPayment;
         
-        if (balance - principalPayment < 0.01) {
+        if (balance - principalPayment >= 0.01) {
             principalPayment = balance;
         }
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 1 to equal 360

[Killed] AssignmentOperator
src/loan.js:147:9
         }
 
         balance -= principalPayment;
-        totalInterest += interestPayment;
+        totalInterest -= interestPayment;
         
         if (balance < 0) balance = 0;
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 186511.47 to be close to 0 +/- 0.1
