[Killed] EqualityOperator
src/loan.js:149:13
         balance -= principalPayment;
         totalInterest += interestPayment;
         
-        if (balance < 0) balance = 0;
+        if (balance >= 0) balance = 0;
 
         schedule.push({
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 1 to equal 360

[Killed] ConditionalExpression
src/loan.js:149:13
         balance -= principalPayment;
         totalInterest += interestPayment;
         
-        if (balance < 0) balance = 0;
+        if (true) balance = 0;
 
         schedule.push({
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 1 to equal 360

[Survived] ObjectLiteral
src/loan.js:151:23
         
         if (balance < 0) balance = 0;
 
-        schedule.push({
-            paymentNumber: months,
-            payment: Number((interestPayment + principalPayment).toFixed(2)),
-            principalPayment: Number(principalPayment.toFixed(2)),
-            interestPayment: Number(interestPayment.toFixed(2)),
-            balance: Number(balance.toFixed(2))
-        });
+        schedule.push({});
 
         if (months > termYears * 12 * 2) break; // Safety break

[Survived] ArithmeticOperator
src/loan.js:153:30
 
         schedule.push({
             paymentNumber: months,
-            payment: Number((interestPayment + principalPayment).toFixed(2)),
+            payment: Number((interestPayment - principalPayment).toFixed(2)),
             principalPayment: Number(principalPayment.toFixed(2)),
             interestPayment: Number(interestPayment.toFixed(2)),

[Killed] EqualityOperator
src/loan.js:159:13
             balance: Number(balance.toFixed(2))
         });
 
-        if (months > termYears * 12 * 2) break; // Safety break
+        if (months <= termYears * 12 * 2) break; // Safety break
     }
 
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 1 to equal 360

[Killed] ArithmeticOperator
src/loan.js:159:22
             balance: Number(balance.toFixed(2))
         });
 
-        if (months > termYears * 12 * 2) break; // Safety break
+        if (months > termYears / 12 * 2) break; // Safety break
     }
 
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 6 to equal 360

[Killed] ArithmeticOperator
src/loan.js:164:66
 
     // Calculate original interest
     const originalSchedule = calculateAmortizationSchedule(principal, annualRate, termYears);
-    const originalInterest = originalSchedule.reduce((sum, p) => sum + p.interestPayment, 0);
+    const originalInterest = originalSchedule.reduce((sum, p) => sum - p.interestPayment, 0);
 
     return {
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected -155931.22 to be above +0

[Killed] ArrowFunction
src/loan.js:164:54
 
     // Calculate original interest
     const originalSchedule = calculateAmortizationSchedule(principal, annualRate, termYears);
-    const originalInterest = originalSchedule.reduce((sum, p) => sum + p.interestPayment, 0);
+    const originalInterest = originalSchedule.reduce(() => undefined, 0);
 
     return {
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected NaN to be above +0

[Killed] ObjectLiteral
src/loan.js:166:12
     const originalSchedule = calculateAmortizationSchedule(principal, annualRate, termYears);
     const originalInterest = originalSchedule.reduce((sum, p) => sum + p.interestPayment, 0);
 
-    return {
-        schedule,
-        newTermMonths: months,
-        interestSaved: Number((originalInterest - totalInterest).toFixed(2))
-    };
+    return {};
 }
 
killedBy: Loan Module calculateExtraPaymentSchedule should reduce term and save interest
statusReason: expected undefined to be a number or a date

[Killed] ArithmeticOperator
src/loan.js:169:32
     return {
         schedule,
         newTermMonths: months,
-        interestSaved: Number((originalInterest - totalInterest).toFixed(2))
+        interestSaved: Number((originalInterest + totalInterest).toFixed(2))
     };
 }
killedBy: Loan Module calculateExtraPaymentSchedule should handle zero extra payment
statusReason: expected 186511.47 to be close to 0 +/- 0.1

[Killed] BlockStatement
src/loan.js:181:83
  * @param {number} balloonAmount - Amount due at the end.
  * @returns {number} Monthly payment.
  */
-function calculateBalloonPayment(principal, annualRate, termYears, balloonAmount) {
-     if (principal <= 0 || annualRate < 0 || termYears <= 0 || balloonAmount < 0) {
-        throw new Error("Invalid input parameters");
-    }
-    
-    // PV of Balloon = Balloon / (1+r)^n
-    // PV of Payments = Principal - PV of Balloon
-    // Payment = (Principal - PV of Balloon) * (r * (1+r)^n) / ((1+r)^n - 1)
-    
-    const monthlyRate = annualRate / 100 / 12;
-    const numberOfPayments = termYears * 12;
-    
-    const pvBalloon = balloonAmount / Math.pow(1 + monthlyRate, numberOfPayments);
-    const amortizedPrincipal = principal - pvBalloon;
-    
-    if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
-
-    const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
-    const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
-
-    return Number((numerator / denominator).toFixed(2));
-}
+function calculateBalloonPayment(principal, annualRate, termYears, balloonAmount) {}
 
 module.exports = {
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected undefined to be numeric

[Killed] EqualityOperator
src/loan.js:182:28
  * @returns {number} Monthly payment.
  */
 function calculateBalloonPayment(principal, annualRate, termYears, balloonAmount) {
-     if (principal <= 0 || annualRate < 0 || termYears <= 0 || balloonAmount < 0) {
+     if (principal <= 0 || annualRate >= 0 || termYears <= 0 || balloonAmount < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: Invalid input parameters

[Killed] ConditionalExpression
src/loan.js:182:10
  * @returns {number} Monthly payment.
  */
 function calculateBalloonPayment(principal, annualRate, termYears, balloonAmount) {
-     if (principal <= 0 || annualRate < 0 || termYears <= 0 || balloonAmount < 0) {
+     if (false) {
         throw new Error("Invalid input parameters");
     }
killedBy: Loan Module calculateBalloonPayment should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/loan.js:183:25
  */
 function calculateBalloonPayment(principal, annualRate, termYears, balloonAmount) {
      if (principal <= 0 || annualRate < 0 || termYears <= 0 || balloonAmount < 0) {
-        throw new Error("Invalid input parameters");
+        throw new Error("");
     }
     
killedBy: Loan Module calculateBalloonPayment should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got ''

[Killed] ArithmeticOperator
src/loan.js:193:48
     const monthlyRate = annualRate / 100 / 12;
     const numberOfPayments = termYears * 12;
     
-    const pvBalloon = balloonAmount / Math.pow(1 + monthlyRate, numberOfPayments);
+    const pvBalloon = balloonAmount / Math.pow(1 - monthlyRate, numberOfPayments);
     const amortizedPrincipal = principal - pvBalloon;
     
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected 674.93 to be close to 1151 +/- 10

[Killed] ArithmeticOperator
src/loan.js:193:23
     const monthlyRate = annualRate / 100 / 12;
     const numberOfPayments = termYears * 12;
     
-    const pvBalloon = balloonAmount / Math.pow(1 + monthlyRate, numberOfPayments);
+    const pvBalloon = balloonAmount * Math.pow(1 + monthlyRate, numberOfPayments);
     const amortizedPrincipal = principal - pvBalloon;
     
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected 676.2 to be close to 1151 +/- 10

[Killed] ArithmeticOperator
src/loan.js:194:32
     const numberOfPayments = termYears * 12;
     
     const pvBalloon = balloonAmount / Math.pow(1 + monthlyRate, numberOfPayments);
-    const amortizedPrincipal = principal - pvBalloon;
+    const amortizedPrincipal = principal + pvBalloon;
     
     if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected 2622.35 to be close to 1151 +/- 10

[Killed] EqualityOperator
src/loan.js:196:9
     const pvBalloon = balloonAmount / Math.pow(1 + monthlyRate, numberOfPayments);
     const amortizedPrincipal = principal - pvBalloon;
     
-    if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
+    if (amortizedPrincipal > 0) return 0; // Balloon covers everything? Unlikely but possible.
 
     const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected +0 to be close to 1151 +/- 10

[Killed] ConditionalExpression
src/loan.js:196:9
     const pvBalloon = balloonAmount / Math.pow(1 + monthlyRate, numberOfPayments);
     const amortizedPrincipal = principal - pvBalloon;
     
-    if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
+    if (true) return 0; // Balloon covers everything? Unlikely but possible.
 
     const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected +0 to be close to 1151 +/- 10

[Killed] ArithmeticOperator
src/loan.js:198:67
     
     if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
 
-    const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
+    const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 - monthlyRate, numberOfPayments);
     const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
 
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected 698.66 to be close to 1151 +/- 10

[Killed] ArithmeticOperator
src/loan.js:198:23
     
     if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
 
-    const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
+    const numerator = amortizedPrincipal / monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
     const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
 
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected 66349152.89 to be close to 1151 +/- 10

[Killed] ArithmeticOperator
src/loan.js:199:34
     if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
 
     const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
-    const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
+    const denominator = Math.pow(1 - monthlyRate, numberOfPayments) - 1;
 
     return Number((numerator / denominator).toFixed(2));
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected -1472.88 to be close to 1151 +/- 10

[Killed] ArithmeticOperator
src/loan.js:199:25
     if (amortizedPrincipal <= 0) return 0; // Balloon covers everything? Unlikely but possible.
 
     const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
-    const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
+    const denominator = Math.pow(1 + monthlyRate, numberOfPayments) + 1;
 
     return Number((numerator / denominator).toFixed(2));
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected 142.95 to be close to 1151 +/- 10

[Killed] ArithmeticOperator
src/loan.js:201:20
     const numerator = amortizedPrincipal * monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
     const denominator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
 
-    return Number((numerator / denominator).toFixed(2));
+    return Number((numerator * denominator).toFixed(2));
 }
 
killedBy: Loan Module calculateBalloonPayment should calculate balloon payment loan correctly
statusReason: expected 92.49 to be close to 1151 +/- 10

[Killed] BlockStatement
src/loan.js:220:79
  * @param {number} termYears - Loan term in years.
  * @returns {number} Maximum loan principal.
  */
-function calculateLoanAffordability(maxMonthlyPayment, annualRate, termYears) {
-    if (maxMonthlyPayment <= 0 || annualRate < 0 || termYears <= 0) {
-        throw new Error("Invalid input parameters");
-    }
-
-    if (annualRate === 0) {
-        return Number((maxMonthlyPayment * termYears * 12).toFixed(2));
-    }
-
-    const monthlyRate = annualRate / 100 / 12;
-    const numberOfPayments = termYears * 12;
-
-    // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
-    const numerator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
-    const denominator = monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
-    
-    const principal = maxMonthlyPayment * (numerator / denominator);
-    
-    return Number(principal.toFixed(2));
-}
+function calculateLoanAffordability(maxMonthlyPayment, annualRate, termYears) {}
 
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected undefined to be numeric

[Killed] BlockStatement
src/loan.js:221:69
  * @returns {number} Maximum loan principal.
  */
 function calculateLoanAffordability(maxMonthlyPayment, annualRate, termYears) {
-    if (maxMonthlyPayment <= 0 || annualRate < 0 || termYears <= 0) {
-        throw new Error("Invalid input parameters");
-    }
+    if (maxMonthlyPayment <= 0 || annualRate < 0 || termYears <= 0) {}
 
     if (annualRate === 0) {
killedBy: Loan Module calculateLoanAffordability should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/loan.js:221:35
  * @returns {number} Maximum loan principal.
  */
 function calculateLoanAffordability(maxMonthlyPayment, annualRate, termYears) {
-    if (maxMonthlyPayment <= 0 || annualRate < 0 || termYears <= 0) {
+    if (maxMonthlyPayment <= 0 || annualRate >= 0 || termYears <= 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: Invalid input parameters

[Killed] StringLiteral
src/loan.js:222:25
  */
 function calculateLoanAffordability(maxMonthlyPayment, annualRate, termYears) {
     if (maxMonthlyPayment <= 0 || annualRate < 0 || termYears <= 0) {
-        throw new Error("Invalid input parameters");
+        throw new Error("");
     }
 
killedBy: Loan Module calculateLoanAffordability should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got ''

[Killed] EqualityOperator
src/loan.js:225:9
         throw new Error("Invalid input parameters");
     }
 
-    if (annualRate === 0) {
+    if (annualRate !== 0) {
         return Number((maxMonthlyPayment * termYears * 12).toFixed(2));
     }
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected 360000 to be close to 186281.62 +/- 1

[NoCoverage] ArithmeticOperator
src/loan.js:226:24
     }
 
     if (annualRate === 0) {
-        return Number((maxMonthlyPayment * termYears * 12).toFixed(2));
+        return Number((maxMonthlyPayment / termYears * 12).toFixed(2));
     }
 

[NoCoverage] ArithmeticOperator
src/loan.js:226:24
     }
 
     if (annualRate === 0) {
-        return Number((maxMonthlyPayment * termYears * 12).toFixed(2));
+        return Number((maxMonthlyPayment * termYears / 12).toFixed(2));
     }
 

[Killed] ArithmeticOperator
src/loan.js:233:23
     const numberOfPayments = termYears * 12;
 
     // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
-    const numerator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
+    const numerator = Math.pow(1 + monthlyRate, numberOfPayments) + 1;
     const denominator = monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
     
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected 293718.38 to be close to 186281.62 +/- 1

[Killed] ArithmeticOperator
src/loan.js:233:32
     const numberOfPayments = termYears * 12;
 
     // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
-    const numerator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
+    const numerator = Math.pow(1 - monthlyRate, numberOfPayments) - 1;
     const denominator = monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
     
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected -41769.69 to be close to 186281.62 +/- 1

[Killed] ArithmeticOperator
src/loan.js:234:48
 
     // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
     const numerator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
-    const denominator = monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
+    const denominator = monthlyRate * Math.pow(1 - monthlyRate, numberOfPayments);
     
     const principal = maxMonthlyPayment * (numerator / denominator);
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected 3741631.26 to be close to 186281.62 +/- 1

[Killed] ArithmeticOperator
src/loan.js:234:25
 
     // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
     const numerator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
-    const denominator = monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
+    const denominator = monthlyRate / Math.pow(1 + monthlyRate, numberOfPayments);
     
     const principal = maxMonthlyPayment * (numerator / denominator);
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected 3718318.79 to be close to 186281.62 +/- 1

[Killed] ArithmeticOperator
src/loan.js:236:23
     const numerator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
     const denominator = monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
     
-    const principal = maxMonthlyPayment * (numerator / denominator);
+    const principal = maxMonthlyPayment / (numerator / denominator);
     
     return Number(principal.toFixed(2));
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected 5.37 to be close to 186281.62 +/- 1

[Killed] ArithmeticOperator
src/loan.js:236:44
     const numerator = Math.pow(1 + monthlyRate, numberOfPayments) - 1;
     const denominator = monthlyRate * Math.pow(1 + monthlyRate, numberOfPayments);
     
-    const principal = maxMonthlyPayment * (numerator / denominator);
+    const principal = maxMonthlyPayment * (numerator * denominator);
     
     return Number(principal.toFixed(2));
killedBy: Loan Module calculateLoanAffordability should calculate max loan amount correctly
statusReason: expected 64.55 to be close to 186281.62 +/- 1
