[Killed] ConditionalExpression
src/realEstate.js:16:69
  * @returns {Object} Max mortgage amount and monthly payment details.
  */
 function calculateMortgageMax(annualIncome, monthlyDebts, interestRate, termYears) {
-    if (annualIncome < 0 || monthlyDebts < 0 || interestRate < 0 || termYears <= 0) {
+    if (annualIncome < 0 || monthlyDebts < 0 || interestRate < 0 || false) {
         throw new Error("Invalid input parameters");
     }
killedBy: Real Estate Module calculateMortgageMax should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/realEstate.js:16:49
  * @returns {Object} Max mortgage amount and monthly payment details.
  */
 function calculateMortgageMax(annualIncome, monthlyDebts, interestRate, termYears) {
-    if (annualIncome < 0 || monthlyDebts < 0 || interestRate < 0 || termYears <= 0) {
+    if (annualIncome < 0 || monthlyDebts < 0 || interestRate >= 0 || termYears <= 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on front-end ratio
statusReason: Invalid input parameters

[Killed] StringLiteral
src/realEstate.js:17:25
  */
 function calculateMortgageMax(annualIncome, monthlyDebts, interestRate, termYears) {
     if (annualIncome < 0 || monthlyDebts < 0 || interestRate < 0 || termYears <= 0) {
-        throw new Error("Invalid input parameters");
+        throw new Error("");
     }
 
killedBy: Real Estate Module calculateMortgageMax should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got ''

[Killed] ArithmeticOperator
src/realEstate.js:20:27
         throw new Error("Invalid input parameters");
     }
 
-    const monthlyIncome = annualIncome / 12;
+    const monthlyIncome = annualIncome * 12;
     
     // Front-end ratio: Housing costs should not exceed 28% of gross income
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on front-end ratio
statusReason: Expected values to be strictly equal:

403200 !== 2800

[Killed] ArithmeticOperator
src/realEstate.js:23:32
     const monthlyIncome = annualIncome / 12;
     
     // Front-end ratio: Housing costs should not exceed 28% of gross income
-    const maxPaymentFrontEnd = monthlyIncome * 0.28;
+    const maxPaymentFrontEnd = monthlyIncome / 0.28;
     
     // Back-end ratio: Total debt (housing + other) should not exceed 36% of gross income
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on front-end ratio
statusReason: Expected values to be strictly equal:

3100 !== 2800

[Killed] ArithmeticOperator
src/realEstate.js:26:33
     const maxPaymentFrontEnd = monthlyIncome * 0.28;
     
     // Back-end ratio: Total debt (housing + other) should not exceed 36% of gross income
-    const maxTotalDebtPayment = monthlyIncome * 0.36;
+    const maxTotalDebtPayment = monthlyIncome / 0.36;
     const maxPaymentBackEnd = maxTotalDebtPayment - monthlyDebts;
     
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on back-end ratio
statusReason: Expected values to be strictly equal:

2800 !== 2100

[Killed] ArithmeticOperator
src/realEstate.js:27:31
     
     // Back-end ratio: Total debt (housing + other) should not exceed 36% of gross income
     const maxTotalDebtPayment = monthlyIncome * 0.36;
-    const maxPaymentBackEnd = maxTotalDebtPayment - monthlyDebts;
+    const maxPaymentBackEnd = maxTotalDebtPayment + monthlyDebts;
     
     // The lower of the two is the limit
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on back-end ratio
statusReason: Expected values to be strictly equal:

2800 !== 2100

[Killed] MethodExpression
src/realEstate.js:30:31
     const maxPaymentBackEnd = maxTotalDebtPayment - monthlyDebts;
     
     // The lower of the two is the limit
-    const maxMonthlyPayment = Math.min(maxPaymentFrontEnd, maxPaymentBackEnd);
+    const maxMonthlyPayment = Math.max(maxPaymentFrontEnd, maxPaymentBackEnd);
     
     if (maxMonthlyPayment <= 0) {
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on front-end ratio
statusReason: Expected values to be strictly equal:

3100 !== 2800

[Killed] BlockStatement
src/realEstate.js:32:33
     // The lower of the two is the limit
     const maxMonthlyPayment = Math.min(maxPaymentFrontEnd, maxPaymentBackEnd);
     
-    if (maxMonthlyPayment <= 0) {
-        return {
-            maxMortgage: 0,
-            maxMonthlyPayment: 0,
-            limitingFactor: "Debt-to-Income Ratio"
-        };
-    }
+    if (maxMonthlyPayment <= 0) {}
 
     // Calculate max principal based on max payment
killedBy: Real Estate Module calculateMortgageMax should handle zero income (return 0)
statusReason: Expected values to be strictly equal:

-500 !== 0

[Killed] ConditionalExpression
src/realEstate.js:32:9
     // The lower of the two is the limit
     const maxMonthlyPayment = Math.min(maxPaymentFrontEnd, maxPaymentBackEnd);
     
-    if (maxMonthlyPayment <= 0) {
+    if (false) {
         return {
             maxMortgage: 0,
killedBy: Real Estate Module calculateMortgageMax should handle zero income (return 0)
statusReason: Expected values to be strictly equal:

-500 !== 0

[Survived] ArithmeticOperator
src/realEstate.js:42:15
 
     // Calculate max principal based on max payment
     // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
-    const r = interestRate / 100 / 12;
+    const r = interestRate * 100 / 12;
     const n = termYears * 12;
     

[Survived] ArithmeticOperator
src/realEstate.js:42:15
 
     // Calculate max principal based on max payment
     // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
-    const r = interestRate / 100 / 12;
+    const r = interestRate / 100 * 12;
     const n = termYears * 12;
     

[Survived] ArithmeticOperator
src/realEstate.js:43:15
     // Calculate max principal based on max payment
     // P = M * ((1+r)^n - 1) / (r * (1+r)^n)
     const r = interestRate / 100 / 12;
-    const n = termYears * 12;
+    const n = termYears / 12;
     
     let maxMortgage = 0;

[Survived] ConditionalExpression
src/realEstate.js:46:9
     const n = termYears * 12;
     
     let maxMortgage = 0;
-    if (interestRate === 0) {
+    if (true) {
         maxMortgage = maxMonthlyPayment * n;
     } else {

[Survived] EqualityOperator
src/realEstate.js:46:9
     const n = termYears * 12;
     
     let maxMortgage = 0;
-    if (interestRate === 0) {
+    if (interestRate !== 0) {
         maxMortgage = maxMonthlyPayment * n;
     } else {

[NoCoverage] ArithmeticOperator
src/realEstate.js:47:23
     
     let maxMortgage = 0;
     if (interestRate === 0) {
-        maxMortgage = maxMonthlyPayment * n;
+        maxMortgage = maxMonthlyPayment / n;
     } else {
         maxMortgage = maxMonthlyPayment * (Math.pow(1 + r, n) - 1) / (r * Math.pow(1 + r, n));

[Survived] BlockStatement
src/realEstate.js:48:12
     let maxMortgage = 0;
     if (interestRate === 0) {
         maxMortgage = maxMonthlyPayment * n;
-    } else {
-        maxMortgage = maxMonthlyPayment * (Math.pow(1 + r, n) - 1) / (r * Math.pow(1 + r, n));
-    }
+    } else {}
 
     return {

[Survived] ArithmeticOperator
src/realEstate.js:49:84
     if (interestRate === 0) {
         maxMortgage = maxMonthlyPayment * n;
     } else {
-        maxMortgage = maxMonthlyPayment * (Math.pow(1 + r, n) - 1) / (r * Math.pow(1 + r, n));
+        maxMortgage = maxMonthlyPayment * (Math.pow(1 + r, n) - 1) / (r * Math.pow(1 - r, n));
     }
 

[Survived] ArithmeticOperator
src/realEstate.js:49:71
     if (interestRate === 0) {
         maxMortgage = maxMonthlyPayment * n;
     } else {
-        maxMortgage = maxMonthlyPayment * (Math.pow(1 + r, n) - 1) / (r * Math.pow(1 + r, n));
+        maxMortgage = maxMonthlyPayment * (Math.pow(1 + r, n) - 1) / (r / Math.pow(1 + r, n));
     }
 

[Killed] EqualityOperator
src/realEstate.js:55:25
     return {
         maxMortgage: Number(maxMortgage.toFixed(2)),
         maxMonthlyPayment: Number(maxMonthlyPayment.toFixed(2)),
-        limitingFactor: maxPaymentFrontEnd < maxPaymentBackEnd ? "Front-End Ratio (28%)" : "Back-End Ratio (36%)"
+        limitingFactor: maxPaymentFrontEnd >= maxPaymentBackEnd ? "Front-End Ratio (28%)" : "Back-End Ratio (36%)"
     };
 }
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on front-end ratio
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Back-End Ratio (36%)'
- 'Front-End Ratio (28%)'

[Killed] ConditionalExpression
src/realEstate.js:55:25
     return {
         maxMortgage: Number(maxMortgage.toFixed(2)),
         maxMonthlyPayment: Number(maxMonthlyPayment.toFixed(2)),
-        limitingFactor: maxPaymentFrontEnd < maxPaymentBackEnd ? "Front-End Ratio (28%)" : "Back-End Ratio (36%)"
+        limitingFactor: false ? "Front-End Ratio (28%)" : "Back-End Ratio (36%)"
     };
 }
killedBy: Real Estate Module calculateMortgageMax should calculate max mortgage based on front-end ratio
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Back-End Ratio (36%)'
- 'Front-End Ratio (28%)'

[Killed] BlockStatement
src/realEstate.js:66:74
  * @param {number} annualExpenses - Total annual expenses (taxes, insurance, maintenance, etc.).
  * @returns {Object} Yield percentages.
  */
-function calculateRentalYield(annualRent, propertyValue, annualExpenses) {
-    if (annualRent < 0 || propertyValue <= 0 || annualExpenses < 0) {
-        throw new Error("Invalid input parameters");
-    }
-
-    const grossYield = (annualRent / propertyValue) * 100;
-    const netIncome = annualRent - annualExpenses;
-    const netYield = (netIncome / propertyValue) * 100;
-
-    return {
-        grossYield: Number(grossYield.toFixed(2)),
-        netYield: Number(netYield.toFixed(2)),
-        netAnnualIncome: Number(netIncome.toFixed(2))
-    };
-}
+function calculateRentalYield(annualRent, propertyValue, annualExpenses) {}
 
 /**
killedBy: Real Estate Module calculateRentalYield should calculate gross and net yield
statusReason: Cannot read properties of undefined (reading 'grossYield')

[Killed] EqualityOperator
src/realEstate.js:67:27
  * @returns {Object} Yield percentages.
  */
 function calculateRentalYield(annualRent, propertyValue, annualExpenses) {
-    if (annualRent < 0 || propertyValue <= 0 || annualExpenses < 0) {
+    if (annualRent < 0 || propertyValue < 0 || annualExpenses < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Real Estate Module calculateRentalYield should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/realEstate.js:67:69
  * @returns {Object} Yield percentages.
  */
 function calculateRentalYield(annualRent, propertyValue, annualExpenses) {
-    if (annualRent < 0 || propertyValue <= 0 || annualExpenses < 0) {
-        throw new Error("Invalid input parameters");
-    }
+    if (annualRent < 0 || propertyValue <= 0 || annualExpenses < 0) {}
 
     const grossYield = (annualRent / propertyValue) * 100;
killedBy: Real Estate Module calculateRentalYield should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/realEstate.js:71:24
         throw new Error("Invalid input parameters");
     }
 
-    const grossYield = (annualRent / propertyValue) * 100;
+    const grossYield = annualRent / propertyValue / 100;
     const netIncome = annualRent - annualExpenses;
     const netYield = (netIncome / propertyValue) * 100;
killedBy: Real Estate Module calculateRentalYield should calculate gross and net yield
statusReason: Expected values to be strictly equal:

0 !== 8

[Killed] ArithmeticOperator
src/realEstate.js:71:25
         throw new Error("Invalid input parameters");
     }
 
-    const grossYield = (annualRent / propertyValue) * 100;
+    const grossYield = (annualRent * propertyValue) * 100;
     const netIncome = annualRent - annualExpenses;
     const netYield = (netIncome / propertyValue) * 100;
killedBy: Real Estate Module calculateRentalYield should calculate gross and net yield
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 720000000000
- 8

[Killed] ArithmeticOperator
src/realEstate.js:72:23
     }
 
     const grossYield = (annualRent / propertyValue) * 100;
-    const netIncome = annualRent - annualExpenses;
+    const netIncome = annualRent + annualExpenses;
     const netYield = (netIncome / propertyValue) * 100;
 
killedBy: Real Estate Module calculateRentalYield should calculate gross and net yield
statusReason: Expected values to be strictly equal:

10.67 !== 5.33

[Killed] ArithmeticOperator
src/realEstate.js:73:23
 
     const grossYield = (annualRent / propertyValue) * 100;
     const netIncome = annualRent - annualExpenses;
-    const netYield = (netIncome / propertyValue) * 100;
+    const netYield = (netIncome * propertyValue) * 100;
 
     return {
killedBy: Real Estate Module calculateRentalYield should calculate gross and net yield
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 480000000000
- 5.33

[Killed] ArithmeticOperator
src/realEstate.js:73:22
 
     const grossYield = (annualRent / propertyValue) * 100;
     const netIncome = annualRent - annualExpenses;
-    const netYield = (netIncome / propertyValue) * 100;
+    const netYield = netIncome / propertyValue / 100;
 
     return {
killedBy: Real Estate Module calculateRentalYield should calculate gross and net yield
statusReason: Expected values to be strictly equal:

0 !== 5.33

[Killed] BlockStatement
src/realEstate.js:88:62
  * @param {number} propertyValue - Current market value.
  * @returns {number} Cap Rate percentage.
  */
-function calculateCapRate(netOperatingIncome, propertyValue) {
-    if (propertyValue <= 0) throw new Error("Property value must be positive");
-    
-    return Number(((netOperatingIncome / propertyValue) * 100).toFixed(2));
-}
+function calculateCapRate(netOperatingIncome, propertyValue) {}
 
 /**
killedBy: Real Estate Module calculateCapRate should calculate cap rate correctly
statusReason: Expected values to be strictly equal:

undefined !== 6

[Killed] ConditionalExpression
src/realEstate.js:89:9
  * @returns {number} Cap Rate percentage.
  */
 function calculateCapRate(netOperatingIncome, propertyValue) {
-    if (propertyValue <= 0) throw new Error("Property value must be positive");
+    if (true) throw new Error("Property value must be positive");
     
     return Number(((netOperatingIncome / propertyValue) * 100).toFixed(2));
killedBy: Real Estate Module calculateCapRate should calculate cap rate correctly
statusReason: Property value must be positive

[Killed] EqualityOperator
src/realEstate.js:89:9
  * @returns {number} Cap Rate percentage.
  */
 function calculateCapRate(netOperatingIncome, propertyValue) {
-    if (propertyValue <= 0) throw new Error("Property value must be positive");
+    if (propertyValue > 0) throw new Error("Property value must be positive");
     
     return Number(((netOperatingIncome / propertyValue) * 100).toFixed(2));
killedBy: Real Estate Module calculateCapRate should calculate cap rate correctly
statusReason: Property value must be positive

[Killed] ArithmeticOperator
src/realEstate.js:91:20
 function calculateCapRate(netOperatingIncome, propertyValue) {
     if (propertyValue <= 0) throw new Error("Property value must be positive");
     
-    return Number(((netOperatingIncome / propertyValue) * 100).toFixed(2));
+    return Number((netOperatingIncome / propertyValue / 100).toFixed(2));
 }
 
killedBy: Real Estate Module calculateCapRate should calculate cap rate correctly
statusReason: Expected values to be strictly equal:

0 !== 6

[Killed] ArithmeticOperator
src/realEstate.js:91:21
 function calculateCapRate(netOperatingIncome, propertyValue) {
     if (propertyValue <= 0) throw new Error("Property value must be positive");
     
-    return Number(((netOperatingIncome / propertyValue) * 100).toFixed(2));
+    return Number(((netOperatingIncome * propertyValue) * 100).toFixed(2));
 }
 
killedBy: Real Estate Module calculateCapRate should calculate cap rate correctly
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 375000000000
- 6

[Killed] BlockStatement
src/realEstate.js:100:71
  * @param {number} totalCashInvested - Total cash invested (down payment + closing costs + rehab).
  * @returns {number} Cash-on-Cash Return percentage.
  */
-function calculateCashOnCashReturn(annualCashFlow, totalCashInvested) {
-    if (totalCashInvested === 0) throw new Error("Total cash invested cannot be zero");
-    
-    return Number(((annualCashFlow / totalCashInvested) * 100).toFixed(2));
-}
+function calculateCashOnCashReturn(annualCashFlow, totalCashInvested) {}
 
 /**
killedBy: Real Estate Module calculateCashOnCashReturn should calculate CoC return
statusReason: Expected values to be strictly equal:

undefined !== 10

[Killed] ConditionalExpression
src/realEstate.js:101:9
  * @returns {number} Cash-on-Cash Return percentage.
  */
 function calculateCashOnCashReturn(annualCashFlow, totalCashInvested) {
-    if (totalCashInvested === 0) throw new Error("Total cash invested cannot be zero");
+    if (true) throw new Error("Total cash invested cannot be zero");
     
     return Number(((annualCashFlow / totalCashInvested) * 100).toFixed(2));
killedBy: Real Estate Module calculateCashOnCashReturn should calculate CoC return
statusReason: Total cash invested cannot be zero

[Killed] ConditionalExpression
src/realEstate.js:101:9
  * @returns {number} Cash-on-Cash Return percentage.
  */
 function calculateCashOnCashReturn(annualCashFlow, totalCashInvested) {
-    if (totalCashInvested === 0) throw new Error("Total cash invested cannot be zero");
+    if (false) throw new Error("Total cash invested cannot be zero");
     
     return Number(((annualCashFlow / totalCashInvested) * 100).toFixed(2));
killedBy: Real Estate Module calculateCashOnCashReturn should throw error for zero investment
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/realEstate.js:103:21
 function calculateCashOnCashReturn(annualCashFlow, totalCashInvested) {
     if (totalCashInvested === 0) throw new Error("Total cash invested cannot be zero");
     
-    return Number(((annualCashFlow / totalCashInvested) * 100).toFixed(2));
+    return Number(((annualCashFlow * totalCashInvested) * 100).toFixed(2));
 }
 
killedBy: Real Estate Module calculateCashOnCashReturn should calculate CoC return
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 25000000000
- 10

[Killed] ArithmeticOperator
src/realEstate.js:103:20
 function calculateCashOnCashReturn(annualCashFlow, totalCashInvested) {
     if (totalCashInvested === 0) throw new Error("Total cash invested cannot be zero");
     
-    return Number(((annualCashFlow / totalCashInvested) * 100).toFixed(2));
+    return Number((annualCashFlow / totalCashInvested / 100).toFixed(2));
 }
 
killedBy: Real Estate Module calculateCashOnCashReturn should calculate CoC return
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] BlockStatement
src/realEstate.js:113:65
  * @param {number} years - Number of years to project.
  * @returns {Object} Future value and total appreciation.
  */
-function calculateAppreciation(currentValue, annualRate, years) {
-    if (currentValue < 0 || years < 0) throw new Error("Invalid input parameters");
-
-    const r = annualRate / 100;
-    const futureValue = currentValue * Math.pow(1 + r, years);
-    const totalAppreciation = futureValue - currentValue;
-
-    return {
-        futureValue: Number(futureValue.toFixed(2)),
-        totalAppreciation: Number(totalAppreciation.toFixed(2))
-    };
-}
+function calculateAppreciation(currentValue, annualRate, years) {}
 
 /**
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Cannot read properties of undefined (reading 'futureValue')

[Killed] ConditionalExpression
src/realEstate.js:114:9
  * @returns {Object} Future value and total appreciation.
  */
 function calculateAppreciation(currentValue, annualRate, years) {
-    if (currentValue < 0 || years < 0) throw new Error("Invalid input parameters");
+    if (false) throw new Error("Invalid input parameters");
 
     const r = annualRate / 100;
killedBy: Real Estate Module calculateAppreciation should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/realEstate.js:114:9
  * @returns {Object} Future value and total appreciation.
  */
 function calculateAppreciation(currentValue, annualRate, years) {
-    if (currentValue < 0 || years < 0) throw new Error("Invalid input parameters");
+    if (false || years < 0) throw new Error("Invalid input parameters");
 
     const r = annualRate / 100;
killedBy: Real Estate Module calculateAppreciation should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/realEstate.js:116:15
 function calculateAppreciation(currentValue, annualRate, years) {
     if (currentValue < 0 || years < 0) throw new Error("Invalid input parameters");
 
-    const r = annualRate / 100;
+    const r = annualRate * 100;
     const futureValue = currentValue * Math.pow(1 + r, years);
     const totalAppreciation = futureValue - currentValue;
killedBy: Real Estate Module calculateAppreciation should project property value
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 9.962704720391381e+31
- 162889.46

[Killed] ArithmeticOperator
src/realEstate.js:117:25
     if (currentValue < 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = annualRate / 100;
-    const futureValue = currentValue * Math.pow(1 + r, years);
+    const futureValue = currentValue / Math.pow(1 + r, years);
     const totalAppreciation = futureValue - currentValue;
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Property should appreciate

[Killed] ArithmeticOperator
src/realEstate.js:117:49
     if (currentValue < 0 || years < 0) throw new Error("Invalid input parameters");
 
     const r = annualRate / 100;
-    const futureValue = currentValue * Math.pow(1 + r, years);
+    const futureValue = currentValue * Math.pow(1 - r, years);
     const totalAppreciation = futureValue - currentValue;
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Property should appreciate

[Survived] ArithmeticOperator
src/realEstate.js:118:31
 
     const r = annualRate / 100;
     const futureValue = currentValue * Math.pow(1 + r, years);
-    const totalAppreciation = futureValue - currentValue;
+    const totalAppreciation = futureValue + currentValue;
 
     return {

[Killed] ObjectLiteral
src/realEstate.js:120:12
     const futureValue = currentValue * Math.pow(1 + r, years);
     const totalAppreciation = futureValue - currentValue;
 
-    return {
-        futureValue: Number(futureValue.toFixed(2)),
-        totalAppreciation: Number(totalAppreciation.toFixed(2))
-    };
+    return {};
 }
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Net worth should be positive

[Killed] LogicalOperator
src/realEstate.js:133:9
  * @returns {Object} Estimated closing costs breakdown.
  */
 function calculateClosingCosts(propertyValue, locationFactor = 1.0) {
-    if (propertyValue < 0 || locationFactor <= 0) throw new Error("Invalid input parameters");
+    if (propertyValue < 0 && locationFactor <= 0) throw new Error("Invalid input parameters");
 
     // Typical closing costs range from 2% to 5% of purchase price
killedBy: Real Estate Module calculateClosingCosts should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/realEstate.js:133:9
  * @returns {Object} Estimated closing costs breakdown.
  */
 function calculateClosingCosts(propertyValue, locationFactor = 1.0) {
-    if (propertyValue < 0 || locationFactor <= 0) throw new Error("Invalid input parameters");
+    if (false) throw new Error("Invalid input parameters");
 
     // Typical closing costs range from 2% to 5% of purchase price
killedBy: Real Estate Module calculateClosingCosts should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Survived] ArithmeticOperator
src/realEstate.js:138:22
     // Typical closing costs range from 2% to 5% of purchase price
     // We'll use a detailed breakdown estimation
     
-    const baseRate = 0.03 * locationFactor; // Average 3% adjusted by location
+    const baseRate = 0.03 / locationFactor; // Average 3% adjusted by location
     
     const estimatedTotal = propertyValue * baseRate;

[Killed] ArithmeticOperator
src/realEstate.js:140:28
     
     const baseRate = 0.03 * locationFactor; // Average 3% adjusted by location
     
-    const estimatedTotal = propertyValue * baseRate;
+    const estimatedTotal = propertyValue / baseRate;
     
     // Rough breakdown
killedBy: Real Estate Module calculateClosingCosts should estimate closing costs
statusReason: Expected values to be strictly equal:

10000000 !== 9000

[Survived] ArithmeticOperator
src/realEstate.js:143:29
     const estimatedTotal = propertyValue * baseRate;
     
     // Rough breakdown
-    const loanOrigination = estimatedTotal * 0.25;
+    const loanOrigination = estimatedTotal / 0.25;
     const appraisal = 500 * locationFactor;
     const titleInsurance = estimatedTotal * 0.30;

[Survived] ArithmeticOperator
src/realEstate.js:144:23
     
     // Rough breakdown
     const loanOrigination = estimatedTotal * 0.25;
-    const appraisal = 500 * locationFactor;
+    const appraisal = 500 / locationFactor;
     const titleInsurance = estimatedTotal * 0.30;
     const recordingFees = 150 * locationFactor;

[Survived] ArithmeticOperator
src/realEstate.js:145:28
     // Rough breakdown
     const loanOrigination = estimatedTotal * 0.25;
     const appraisal = 500 * locationFactor;
-    const titleInsurance = estimatedTotal * 0.30;
+    const titleInsurance = estimatedTotal / 0.30;
     const recordingFees = 150 * locationFactor;
     const prepaidTaxes = estimatedTotal * 0.20;

[Survived] ArithmeticOperator
src/realEstate.js:146:27
     const loanOrigination = estimatedTotal * 0.25;
     const appraisal = 500 * locationFactor;
     const titleInsurance = estimatedTotal * 0.30;
-    const recordingFees = 150 * locationFactor;
+    const recordingFees = 150 / locationFactor;
     const prepaidTaxes = estimatedTotal * 0.20;
     const misc = estimatedTotal - (loanOrigination + appraisal + titleInsurance + recordingFees + prepaidTaxes);

[Survived] ArithmeticOperator
src/realEstate.js:147:26
     const appraisal = 500 * locationFactor;
     const titleInsurance = estimatedTotal * 0.30;
     const recordingFees = 150 * locationFactor;
-    const prepaidTaxes = estimatedTotal * 0.20;
+    const prepaidTaxes = estimatedTotal / 0.20;
     const misc = estimatedTotal - (loanOrigination + appraisal + titleInsurance + recordingFees + prepaidTaxes);
 

[Survived] ArithmeticOperator
src/realEstate.js:148:36
     const titleInsurance = estimatedTotal * 0.30;
     const recordingFees = 150 * locationFactor;
     const prepaidTaxes = estimatedTotal * 0.20;
-    const misc = estimatedTotal - (loanOrigination + appraisal + titleInsurance + recordingFees + prepaidTaxes);
+    const misc = estimatedTotal - (loanOrigination - appraisal + titleInsurance + recordingFees + prepaidTaxes);
 
     return {

[Survived] ArithmeticOperator
src/realEstate.js:148:36
     const titleInsurance = estimatedTotal * 0.30;
     const recordingFees = 150 * locationFactor;
     const prepaidTaxes = estimatedTotal * 0.20;
-    const misc = estimatedTotal - (loanOrigination + appraisal + titleInsurance + recordingFees + prepaidTaxes);
+    const misc = estimatedTotal - (loanOrigination + appraisal + titleInsurance + recordingFees - prepaidTaxes);
 
     return {

[Killed] ObjectLiteral
src/realEstate.js:163:18
     };
 }
 
-module.exports = {
-    calculateMortgageMax,
-    calculateRentalYield,
-    calculateCapRate,
-    calculateCashOnCashReturn,
-    calculateAppreciation,
-    calculateClosingCosts
-};
+module.exports = {};
 
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: realEstate.calculateAppreciation is not a function
