[Killed] LogicalOperator
src/retirement.js:18:9
  * @returns {Object} Projection result containing final balance and year-by-year breakdown.
  */
 function calculate401kProjection(currentBalance, annualContribution, employerMatch, annualReturn, years, salary, salaryGrowth) {
-    if (currentBalance < 0 || annualContribution < 0 || years < 0 || salary < 0) {
+    if ((currentBalance < 0 || annualContribution < 0) && years < 0 || salary < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Retirement Module calculate401kProjection should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/retirement.js:18:9
  * @returns {Object} Projection result containing final balance and year-by-year breakdown.
  */
 function calculate401kProjection(currentBalance, annualContribution, employerMatch, annualReturn, years, salary, salaryGrowth) {
-    if (currentBalance < 0 || annualContribution < 0 || years < 0 || salary < 0) {
+    if (currentBalance >= 0 || annualContribution < 0 || years < 0 || salary < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: Invalid input parameters

[Killed] StringLiteral
src/retirement.js:19:25
  */
 function calculate401kProjection(currentBalance, annualContribution, employerMatch, annualReturn, years, salary, salaryGrowth) {
     if (currentBalance < 0 || annualContribution < 0 || years < 0 || salary < 0) {
-        throw new Error("Invalid input parameters");
+        throw new Error("");
     }
 
killedBy: Retirement Module calculate401kProjection should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got ''

[Killed] ArithmeticOperator
src/retirement.js:22:15
         throw new Error("Invalid input parameters");
     }
 
-    const r = annualReturn / 100;
+    const r = annualReturn * 100;
     const g = salaryGrowth / 100;
     const matchRate = employerMatch / 100;
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 6641500 to be close to 17162.5 +/- 0.1

[Survived] ArithmeticOperator
src/retirement.js:23:15
     }
 
     const r = annualReturn / 100;
-    const g = salaryGrowth / 100;
+    const g = salaryGrowth * 100;
     const matchRate = employerMatch / 100;
 

[Killed] ArithmeticOperator
src/retirement.js:24:23
 
     const r = annualReturn / 100;
     const g = salaryGrowth / 100;
-    const matchRate = employerMatch / 100;
+    const matchRate = employerMatch * 100;
 
     let balance = currentBalance;
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 15390625 to be close to 17162.5 +/- 0.1

[Killed] ConditionalExpression
src/retirement.js:30:21
     let currentSalary = salary;
     const breakdown = [];
 
-    for (let i = 1; i <= years; i++) {
+    for (let i = 1; false; i++) {
         const matchAmount = currentSalary * matchRate;
         const totalContribution = annualContribution + matchAmount;
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 10000 to be close to 17162.5 +/- 0.1

[Killed] EqualityOperator
src/retirement.js:30:21
     let currentSalary = salary;
     const breakdown = [];
 
-    for (let i = 1; i <= years; i++) {
+    for (let i = 1; i > years; i++) {
         const matchAmount = currentSalary * matchRate;
         const totalContribution = annualContribution + matchAmount;
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 10000 to be close to 17162.5 +/- 0.1

[Killed] ArithmeticOperator
src/retirement.js:31:29
     const breakdown = [];
 
     for (let i = 1; i <= years; i++) {
-        const matchAmount = currentSalary * matchRate;
+        const matchAmount = currentSalary / matchRate;
         const totalContribution = annualContribution + matchAmount;
         
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 1723958.33 to be close to 17162.5 +/- 0.1

[Killed] ArithmeticOperator
src/retirement.js:32:35
 
     for (let i = 1; i <= years; i++) {
         const matchAmount = currentSalary * matchRate;
-        const totalContribution = annualContribution + matchAmount;
+        const totalContribution = annualContribution - matchAmount;
         
         // Interest is applied to the balance at start of year + contributions made during year
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 14087.5 to be close to 17162.5 +/- 0.1

[Killed] ArithmeticOperator
src/retirement.js:39:69
         // Let's assume contributions are made monthly, but for simplicity here we'll apply return to start balance
         // and half return to contributions (mid-year convention).
         
-        const investmentGrowth = balance * r + totalContribution * (r / 2);
+        const investmentGrowth = balance * r + totalContribution * (r * 2);
         
         balance += totalContribution + investmentGrowth;
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 17650 to be close to 17162.5 +/- 0.1

[Killed] ArithmeticOperator
src/retirement.js:39:34
         // Let's assume contributions are made monthly, but for simplicity here we'll apply return to start balance
         // and half return to contributions (mid-year convention).
         
-        const investmentGrowth = balance * r + totalContribution * (r / 2);
+        const investmentGrowth = balance * r - totalContribution * (r / 2);
         
         balance += totalContribution + investmentGrowth;
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 16837.5 to be close to 17162.5 +/- 0.1

[Killed] ArithmeticOperator
src/retirement.js:41:20
         
         const investmentGrowth = balance * r + totalContribution * (r / 2);
         
-        balance += totalContribution + investmentGrowth;
+        balance += totalContribution - investmentGrowth;
         
         breakdown.push({
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 15837.5 to be close to 17162.5 +/- 0.1

[Killed] AssignmentOperator
src/retirement.js:41:9
         
         const investmentGrowth = balance * r + totalContribution * (r / 2);
         
-        balance += totalContribution + investmentGrowth;
+        balance -= totalContribution + investmentGrowth;
         
         breakdown.push({
killedBy: Retirement Module calculate401kProjection should project 401k balance correctly
statusReason: expected 2837.5 to be close to 17162.5 +/- 0.1

[Survived] ObjectLiteral
src/retirement.js:43:24
         
         balance += totalContribution + investmentGrowth;
         
-        breakdown.push({
-            year: i,
-            salary: Number(currentSalary.toFixed(2)),
-            contribution: Number(totalContribution.toFixed(2)),
-            balance: Number(balance.toFixed(2))
-        });
+        breakdown.push({});
 
         currentSalary *= (1 + g);

[Survived] AssignmentOperator
src/retirement.js:50:9
             balance: Number(balance.toFixed(2))
         });
 
-        currentSalary *= (1 + g);
+        currentSalary /= 1 + g;
     }
 

[Survived] ArithmeticOperator
src/retirement.js:50:27
             balance: Number(balance.toFixed(2))
         });
 
-        currentSalary *= (1 + g);
+        currentSalary *= (1 - g);
     }
 

[Killed] BlockStatement
src/retirement.js:66:44
  * @param {number} accountBalance - Account balance at end of prior year.
  * @returns {number} The RMD amount.
  */
-function calculateRMD(age, accountBalance) {
-    if (age < 72) return 0; // RMDs start at 72 (simplified rule)
-    if (accountBalance < 0) throw new Error("Invalid account balance");
-
-    // Simplified IRS Uniform Lifetime Table (partial)
-    // Age -> Distribution Period
-    const distributionPeriods = {
-        72: 27.4, 73: 26.5, 74: 25.5, 75: 24.6, 76: 23.7,
-        77: 22.9, 78: 22.0, 79: 21.1, 80: 20.2, 81: 19.4,
-        82: 18.5, 83: 17.7, 84: 16.8, 85: 16.0, 86: 15.2,
-        87: 14.4, 88: 13.7, 89: 12.9, 90: 12.2, 91: 11.5,
-        92: 10.8, 93: 10.1, 94: 9.5, 95: 8.9, 96: 8.4,
-        97: 7.8, 98: 7.3, 99: 6.8, 100: 6.4
-    };
-
-    let period = distributionPeriods[age];
-    if (!period) {
-        if (age > 100) period = 6.0; // Cap for > 100
-        else period = 27.4; // Fallback? Or throw?
-    }
-
-    const rmd = accountBalance / period;
-    return Number(rmd.toFixed(2));
-}
+function calculateRMD(age, accountBalance) {}
 
 /**
killedBy: Retirement Module calculateRMD should return 0 for age < 72
statusReason: expected undefined to equal +0

[Killed] ConditionalExpression
src/retirement.js:67:9
  * @returns {number} The RMD amount.
  */
 function calculateRMD(age, accountBalance) {
-    if (age < 72) return 0; // RMDs start at 72 (simplified rule)
+    if (true) return 0; // RMDs start at 72 (simplified rule)
     if (accountBalance < 0) throw new Error("Invalid account balance");
 
killedBy: Retirement Module calculateRMD should calculate RMD for age 72
statusReason: expected +0 to be close to 3649.64 +/- 0.1

[Killed] EqualityOperator
src/retirement.js:67:9
  * @returns {number} The RMD amount.
  */
 function calculateRMD(age, accountBalance) {
-    if (age < 72) return 0; // RMDs start at 72 (simplified rule)
+    if (age >= 72) return 0; // RMDs start at 72 (simplified rule)
     if (accountBalance < 0) throw new Error("Invalid account balance");
 
killedBy: Retirement Module calculateRMD should return 0 for age < 72
statusReason: expected 3649.64 to equal +0

[Killed] ConditionalExpression
src/retirement.js:68:9
  */
 function calculateRMD(age, accountBalance) {
     if (age < 72) return 0; // RMDs start at 72 (simplified rule)
-    if (accountBalance < 0) throw new Error("Invalid account balance");
+    if (false) throw new Error("Invalid account balance");
 
     // Simplified IRS Uniform Lifetime Table (partial)
killedBy: Retirement Module calculateRMD should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/retirement.js:68:9
  */
 function calculateRMD(age, accountBalance) {
     if (age < 72) return 0; // RMDs start at 72 (simplified rule)
-    if (accountBalance < 0) throw new Error("Invalid account balance");
+    if (accountBalance >= 0) throw new Error("Invalid account balance");
 
     // Simplified IRS Uniform Lifetime Table (partial)
killedBy: Retirement Module calculateRMD should calculate RMD for age 72
statusReason: Invalid account balance

[Killed] BlockStatement
src/retirement.js:82:18
     };
 
     let period = distributionPeriods[age];
-    if (!period) {
-        if (age > 100) period = 6.0; // Cap for > 100
-        else period = 27.4; // Fallback? Or throw?
-    }
+    if (!period) {}
 
     const rmd = accountBalance / period;
killedBy: Retirement Module calculateRMD should handle age > 100 (cap at 6.0 divisor)
statusReason: expected NaN to equal 10000

[Killed] ConditionalExpression
src/retirement.js:82:9
     };
 
     let period = distributionPeriods[age];
-    if (!period) {
+    if (false) {
         if (age > 100) period = 6.0; // Cap for > 100
         else period = 27.4; // Fallback? Or throw?
killedBy: Retirement Module calculateRMD should handle age > 100 (cap at 6.0 divisor)
statusReason: expected NaN to equal 10000

[Killed] EqualityOperator
src/retirement.js:83:13
 
     let period = distributionPeriods[age];
     if (!period) {
-        if (age > 100) period = 6.0; // Cap for > 100
+        if (age <= 100) period = 6.0; // Cap for > 100
         else period = 27.4; // Fallback? Or throw?
     }
killedBy: Retirement Module calculateRMD should handle age > 100 (cap at 6.0 divisor)
statusReason: expected 2189.78 to equal 10000

[Killed] ConditionalExpression
src/retirement.js:83:13
 
     let period = distributionPeriods[age];
     if (!period) {
-        if (age > 100) period = 6.0; // Cap for > 100
+        if (false) period = 6.0; // Cap for > 100
         else period = 27.4; // Fallback? Or throw?
     }
killedBy: Retirement Module calculateRMD should handle age > 100 (cap at 6.0 divisor)
statusReason: expected 2189.78 to equal 10000

[Killed] ArithmeticOperator
src/retirement.js:87:17
         else period = 27.4; // Fallback? Or throw?
     }
 
-    const rmd = accountBalance / period;
+    const rmd = accountBalance * period;
     return Number(rmd.toFixed(2));
 }
killedBy: Retirement Module calculateRMD should calculate RMD for age 72
statusReason: expected 2740000 to be close to 3649.64 +/- 0.1

[Killed] ConditionalExpression
src/retirement.js:103:9
  * @returns {Object} Analysis result including success probability.
  */
 function assessRetirementReadiness(currentSavings, annualSavings, annualExpenses, yearsToRetirement, yearsInRetirement, expectedReturn, stdDev) {
-    if (currentSavings < 0 || annualSavings < 0 || annualExpenses < 0 || yearsToRetirement < 0 || yearsInRetirement < 0) {
+    if (false) {
         throw new Error("Invalid input parameters");
     }
killedBy: Retirement Module assessRetirementReadiness should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/retirement.js:103:9
  * @returns {Object} Analysis result including success probability.
  */
 function assessRetirementReadiness(currentSavings, annualSavings, annualExpenses, yearsToRetirement, yearsInRetirement, expectedReturn, stdDev) {
-    if (currentSavings < 0 || annualSavings < 0 || annualExpenses < 0 || yearsToRetirement < 0 || yearsInRetirement < 0) {
+    if (false || yearsInRetirement < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Retirement Module assessRetirementReadiness should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/retirement.js:110:21
     const simulations = 1000;
     let successCount = 0;
 
-    for (let i = 0; i < simulations; i++) {
+    for (let i = 0; i >= simulations; i++) {
         let balance = currentSavings;
 
killedBy: Retirement Module assessRetirementReadiness should return a probability and recommendation
statusReason: expected +0 to be above +0

[Killed] ConditionalExpression
src/retirement.js:110:21
     const simulations = 1000;
     let successCount = 0;
 
-    for (let i = 0; i < simulations; i++) {
+    for (let i = 0; false; i++) {
         let balance = currentSavings;
 
killedBy: Retirement Module assessRetirementReadiness should return a probability and recommendation
statusReason: expected +0 to be above +0

[Survived] EqualityOperator
src/retirement.js:114:25
         let balance = currentSavings;
 
         // Accumulation Phase
-        for (let y = 0; y < yearsToRetirement; y++) {
+        for (let y = 0; y >= yearsToRetirement; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
             balance = balance * (1 + returnRate) + annualSavings;

[Survived] ConditionalExpression
src/retirement.js:114:25
         let balance = currentSavings;
 
         // Accumulation Phase
-        for (let y = 0; y < yearsToRetirement; y++) {
+        for (let y = 0; false; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
             balance = balance * (1 + returnRate) + annualSavings;

[Survived] ArithmeticOperator
src/retirement.js:115:32
 
         // Accumulation Phase
         for (let y = 0; y < yearsToRetirement; y++) {
-            const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
+            const returnRate = generateRandomNormal(expectedReturn, stdDev) * 100;
             balance = balance * (1 + returnRate) + annualSavings;
         }

[Survived] ArithmeticOperator
src/retirement.js:116:23
         // Accumulation Phase
         for (let y = 0; y < yearsToRetirement; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
-            balance = balance * (1 + returnRate) + annualSavings;
+            balance = balance * (1 + returnRate) - annualSavings;
         }
 

[Survived] ArithmeticOperator
src/retirement.js:116:23
         // Accumulation Phase
         for (let y = 0; y < yearsToRetirement; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
-            balance = balance * (1 + returnRate) + annualSavings;
+            balance = balance / (1 + returnRate) + annualSavings;
         }
 

[Killed] BooleanLiteral
src/retirement.js:120:22
         }
 
         // Decumulation Phase
-        let failed = false;
+        let failed = true;
         for (let y = 0; y < yearsInRetirement; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
killedBy: Retirement Module assessRetirementReadiness should return a probability and recommendation
statusReason: expected +0 to be above +0

[Killed] BlockStatement
src/retirement.js:121:53
 
         // Decumulation Phase
         let failed = false;
-        for (let y = 0; y < yearsInRetirement; y++) {
-            const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
-            balance = balance * (1 + returnRate) - annualExpenses;
-            
-            // Adjust expenses for inflation? Let's keep it simple for now or assume real returns.
-            // Assuming inputs are real returns (inflation-adjusted).
-
-            if (balance < 0) {
-                failed = true;
-                break;
-            }
-        }
+        for (let y = 0; y < yearsInRetirement; y++) {}
 
         if (!failed) successCount++;
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Killed] EqualityOperator
src/retirement.js:121:25
 
         // Decumulation Phase
         let failed = false;
-        for (let y = 0; y < yearsInRetirement; y++) {
+        for (let y = 0; y >= yearsInRetirement; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
             balance = balance * (1 + returnRate) - annualExpenses;
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Survived] ArithmeticOperator
src/retirement.js:122:32
         // Decumulation Phase
         let failed = false;
         for (let y = 0; y < yearsInRetirement; y++) {
-            const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
+            const returnRate = generateRandomNormal(expectedReturn, stdDev) * 100;
             balance = balance * (1 + returnRate) - annualExpenses;
             

[Killed] ArithmeticOperator
src/retirement.js:123:23
         let failed = false;
         for (let y = 0; y < yearsInRetirement; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
-            balance = balance * (1 + returnRate) - annualExpenses;
+            balance = balance * (1 + returnRate) + annualExpenses;
             
             // Adjust expenses for inflation? Let's keep it simple for now or assume real returns.
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Survived] ArithmeticOperator
src/retirement.js:123:23
         let failed = false;
         for (let y = 0; y < yearsInRetirement; y++) {
             const returnRate = generateRandomNormal(expectedReturn, stdDev) / 100;
-            balance = balance * (1 + returnRate) - annualExpenses;
+            balance = balance / (1 + returnRate) - annualExpenses;
             
             // Adjust expenses for inflation? Let's keep it simple for now or assume real returns.

[Killed] BlockStatement
src/retirement.js:128:30
             // Adjust expenses for inflation? Let's keep it simple for now or assume real returns.
             // Assuming inputs are real returns (inflation-adjusted).
 
-            if (balance < 0) {
-                failed = true;
-                break;
-            }
+            if (balance < 0) {}
         }
 
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Killed] ConditionalExpression
src/retirement.js:128:17
             // Adjust expenses for inflation? Let's keep it simple for now or assume real returns.
             // Assuming inputs are real returns (inflation-adjusted).
 
-            if (balance < 0) {
+            if (false) {
                 failed = true;
                 break;
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Killed] BooleanLiteral
src/retirement.js:129:26
             // Assuming inputs are real returns (inflation-adjusted).
 
             if (balance < 0) {
-                failed = true;
+                failed = false;
                 break;
             }
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Killed] ConditionalExpression
src/retirement.js:134:13
             }
         }
 
-        if (!failed) successCount++;
+        if (true) successCount++;
     }
 
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Killed] UpdateOperator
src/retirement.js:134:22
             }
         }
 
-        if (!failed) successCount++;
+        if (!failed) successCount--;
     }
 
killedBy: Retirement Module assessRetirementReadiness should return a probability and recommendation
statusReason: expected -100 to be above +0

[Survived] ArithmeticOperator
src/retirement.js:137:25
         if (!failed) successCount++;
     }
 
-    const probability = (successCount / simulations) * 100;
+    const probability = successCount / simulations / 100;
     
     return {

[Survived] ArithmeticOperator
src/retirement.js:137:26
         if (!failed) successCount++;
     }
 
-    const probability = (successCount / simulations) * 100;
+    const probability = (successCount * simulations) * 100;
     
     return {

[Killed] ConditionalExpression
src/retirement.js:141:58
     
     return {
         successProbability: Number(probability.toFixed(2)),
-        recommendation: probability > 85 ? "On Track" : (probability > 50 ? "At Risk" : "Critical Action Needed")
+        recommendation: probability > 85 ? "On Track" : (true ? "At Risk" : "Critical Action Needed")
     };
 }
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'At Risk' to equal 'Critical Action Needed'

[Killed] ConditionalExpression
src/retirement.js:141:25
     
     return {
         successProbability: Number(probability.toFixed(2)),
-        recommendation: probability > 85 ? "On Track" : (probability > 50 ? "At Risk" : "Critical Action Needed")
+        recommendation: true ? "On Track" : (probability > 50 ? "At Risk" : "Critical Action Needed")
     };
 }
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Killed] BlockStatement
src/retirement.js:148:45
 /**
  * Helper to generate random number from normal distribution (Box-Muller transform).
  */
-function generateRandomNormal(mean, stdDev) {
-    const u1 = Math.random();
-    const u2 = Math.random();
-    
-    const z0 = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
-    return z0 * stdDev + mean;
-}
+function generateRandomNormal(mean, stdDev) {}
 
 module.exports = {
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Killed] UnaryOperator
src/retirement.js:152:26
     const u1 = Math.random();
     const u2 = Math.random();
     
-    const z0 = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
+    const z0 = Math.sqrt(+2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
     return z0 * stdDev + mean;
 }
killedBy: Retirement Module assessRetirementReadiness should handle critical cases
statusReason: expected 'On Track' to equal 'Critical Action Needed'

[Survived] ArithmeticOperator
src/retirement.js:152:16
     const u1 = Math.random();
     const u2 = Math.random();
     
-    const z0 = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
+    const z0 = Math.sqrt(-2.0 * Math.log(u1)) / Math.cos(2.0 * Math.PI * u2);
     return z0 * stdDev + mean;
 }

[Survived] ArithmeticOperator
src/retirement.js:153:12
     const u2 = Math.random();
     
     const z0 = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
-    return z0 * stdDev + mean;
+    return z0 / stdDev + mean;
 }
 

[Survived] ArithmeticOperator
src/retirement.js:153:12
     const u2 = Math.random();
     
     const z0 = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
-    return z0 * stdDev + mean;
+    return z0 * stdDev - mean;
 }
 

[Killed] ObjectLiteral
src/retirement.js:156:18
     return z0 * stdDev + mean;
 }
 
-module.exports = {
-    calculate401kProjection,
-    calculateRMD,
-    assessRetirementReadiness
-};
+module.exports = {};
 
killedBy: Integration Tests Scenario 2: Comprehensive Financial Health Check should assess overall financial health
statusReason: retirement.assessRetirementReadiness is not a function
