[Killed] BlockStatement
src/statistics.js:12:40
  * @param {Array<number>} cashFlows - An array of cash flows, where index 0 is the initial investment (usually negative).
  * @returns {number} The NPV.
  */
-function calculateNPV(rate, cashFlows) {
-    if (typeof rate !== 'number' || !Array.isArray(cashFlows)) {
-        throw new Error("Invalid input parameters");
-    }
-
-    const r = rate / 100;
-    let npv = 0;
-
-    for (let t = 0; t < cashFlows.length; t++) {
-        npv += cashFlows[t] / Math.pow(1 + r, t);
-    }
-
-    return Number(npv.toFixed(2));
-}
+function calculateNPV(rate, cashFlows) {}
 
 /**
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: expected undefined to be numeric

[Killed] LogicalOperator
src/statistics.js:13:9
  * @returns {number} The NPV.
  */
 function calculateNPV(rate, cashFlows) {
-    if (typeof rate !== 'number' || !Array.isArray(cashFlows)) {
+    if (typeof rate !== 'number' && !Array.isArray(cashFlows)) {
         throw new Error("Invalid input parameters");
     }
killedBy: Statistics Module calculateNPV should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/statistics.js:13:9
  * @returns {number} The NPV.
  */
 function calculateNPV(rate, cashFlows) {
-    if (typeof rate !== 'number' || !Array.isArray(cashFlows)) {
+    if (typeof rate === 'number' || !Array.isArray(cashFlows)) {
         throw new Error("Invalid input parameters");
     }
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/statistics.js:17:15
         throw new Error("Invalid input parameters");
     }
 
-    const r = rate / 100;
+    const r = rate * 100;
     let npv = 0;
 
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: expected -999.5 to be close to 243.43 +/- 0.1

[Killed] BlockStatement
src/statistics.js:20:48
     const r = rate / 100;
     let npv = 0;
 
-    for (let t = 0; t < cashFlows.length; t++) {
-        npv += cashFlows[t] / Math.pow(1 + r, t);
-    }
+    for (let t = 0; t < cashFlows.length; t++) {}
 
     return Number(npv.toFixed(2));
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: expected +0 to be close to 243.43 +/- 0.1

[Killed] EqualityOperator
src/statistics.js:20:21
     const r = rate / 100;
     let npv = 0;
 
-    for (let t = 0; t < cashFlows.length; t++) {
+    for (let t = 0; t <= cashFlows.length; t++) {
         npv += cashFlows[t] / Math.pow(1 + r, t);
     }
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: expected NaN to be close to 243.43 +/- 0.1

[Killed] ArithmeticOperator
src/statistics.js:21:40
     let npv = 0;
 
     for (let t = 0; t < cashFlows.length; t++) {
-        npv += cashFlows[t] / Math.pow(1 + r, t);
+        npv += cashFlows[t] / Math.pow(1 - r, t);
     }
 
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: expected 858.71 to be close to 243.43 +/- 0.1

[Killed] ArithmeticOperator
src/statistics.js:21:16
     let npv = 0;
 
     for (let t = 0; t < cashFlows.length; t++) {
-        npv += cashFlows[t] / Math.pow(1 + r, t);
+        npv += cashFlows[t] * Math.pow(1 + r, t);
     }
 
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: expected 820.5 to be close to 243.43 +/- 0.1

[Killed] EqualityOperator
src/statistics.js:35:38
  * @returns {number} The IRR as a percentage.
  */
 function calculateIRR(cashFlows, guess = 0.1) {
-    if (!Array.isArray(cashFlows) || cashFlows.length === 0) {
+    if (!Array.isArray(cashFlows) || cashFlows.length !== 0) {
         throw new Error("Invalid cash flows");
     }
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: Invalid cash flows

[Killed] BooleanLiteral
src/statistics.js:35:9
  * @returns {number} The IRR as a percentage.
  */
 function calculateIRR(cashFlows, guess = 0.1) {
-    if (!Array.isArray(cashFlows) || cashFlows.length === 0) {
+    if (Array.isArray(cashFlows) || cashFlows.length === 0) {
         throw new Error("Invalid cash flows");
     }
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: Invalid cash flows

[Survived] BooleanLiteral
src/statistics.js:40:23
     }
 
     // Check if there is at least one positive and one negative cash flow
-    let hasPositive = false;
+    let hasPositive = true;
     let hasNegative = false;
     for (const flow of cashFlows) {

[Killed] BooleanLiteral
src/statistics.js:41:23
 
     // Check if there is at least one positive and one negative cash flow
     let hasPositive = false;
-    let hasNegative = false;
+    let hasNegative = true;
     for (const flow of cashFlows) {
         if (flow > 0) hasPositive = true;
killedBy: Statistics Module calculateIRR should throw error if no solution found or invalid flows
statusReason: expected [Function] to throw error including 'Cash flows must contain at least one …' but got 'IRR calculation failed: derivative is…'

[Killed] BlockStatement
src/statistics.js:42:35
     // Check if there is at least one positive and one negative cash flow
     let hasPositive = false;
     let hasNegative = false;
-    for (const flow of cashFlows) {
-        if (flow > 0) hasPositive = true;
-        if (flow < 0) hasNegative = true;
-    }
+    for (const flow of cashFlows) {}
     if (!hasPositive || !hasNegative) {
         throw new Error("Cash flows must contain at least one positive and one negative value");
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: Cash flows must contain at least one positive and one negative value

[Killed] ConditionalExpression
src/statistics.js:43:13
     let hasPositive = false;
     let hasNegative = false;
     for (const flow of cashFlows) {
-        if (flow > 0) hasPositive = true;
+        if (false) hasPositive = true;
         if (flow < 0) hasNegative = true;
     }
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: Cash flows must contain at least one positive and one negative value

[Killed] BooleanLiteral
src/statistics.js:43:37
     let hasPositive = false;
     let hasNegative = false;
     for (const flow of cashFlows) {
-        if (flow > 0) hasPositive = true;
+        if (flow > 0) hasPositive = false;
         if (flow < 0) hasNegative = true;
     }
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: Cash flows must contain at least one positive and one negative value

[Killed] ConditionalExpression
src/statistics.js:44:13
     let hasNegative = false;
     for (const flow of cashFlows) {
         if (flow > 0) hasPositive = true;
-        if (flow < 0) hasNegative = true;
+        if (false) hasNegative = true;
     }
     if (!hasPositive || !hasNegative) {
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: Cash flows must contain at least one positive and one negative value

[Killed] ConditionalExpression
src/statistics.js:44:13
     let hasNegative = false;
     for (const flow of cashFlows) {
         if (flow > 0) hasPositive = true;
-        if (flow < 0) hasNegative = true;
+        if (true) hasNegative = true;
     }
     if (!hasPositive || !hasNegative) {
killedBy: Statistics Module calculateIRR should throw error if no solution found or invalid flows
statusReason: expected [Function] to throw error including 'Cash flows must contain at least one …' but got 'IRR calculation failed: derivative is…'

[Killed] LogicalOperator
src/statistics.js:46:9
         if (flow > 0) hasPositive = true;
         if (flow < 0) hasNegative = true;
     }
-    if (!hasPositive || !hasNegative) {
+    if (!hasPositive && !hasNegative) {
         throw new Error("Cash flows must contain at least one positive and one negative value");
     }
killedBy: Statistics Module calculateIRR should throw error if no solution found or invalid flows
statusReason: expected [Function] to throw error including 'Cash flows must contain at least one …' but got 'IRR calculation failed: derivative is…'

[Killed] ConditionalExpression
src/statistics.js:46:9
         if (flow > 0) hasPositive = true;
         if (flow < 0) hasNegative = true;
     }
-    if (!hasPositive || !hasNegative) {
+    if (true) {
         throw new Error("Cash flows must contain at least one positive and one negative value");
     }
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: Cash flows must contain at least one positive and one negative value

[Killed] ConditionalExpression
src/statistics.js:54:21
     const precision = 1e-6;
     let rate = guess;
 
-    for (let i = 0; i < maxIterations; i++) {
+    for (let i = 0; false; i++) {
         let npv = 0;
         let derivativeNpv = 0;
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: IRR calculation did not converge

[Killed] EqualityOperator
src/statistics.js:54:21
     const precision = 1e-6;
     let rate = guess;
 
-    for (let i = 0; i < maxIterations; i++) {
+    for (let i = 0; i >= maxIterations; i++) {
         let npv = 0;
         let derivativeNpv = 0;
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: IRR calculation did not converge

[Killed] BlockStatement
src/statistics.js:58:52
         let npv = 0;
         let derivativeNpv = 0;
 
-        for (let t = 0; t < cashFlows.length; t++) {
-            const denominator = Math.pow(1 + rate, t);
-            npv += cashFlows[t] / denominator;
-            
-            if (t > 0) {
-                // Derivative of CF / (1+r)^t is -t * CF / (1+r)^(t+1)
-                derivativeNpv -= (t * cashFlows[t]) / Math.pow(1 + rate, t + 1);
-            }
-        }
+        for (let t = 0; t < cashFlows.length; t++) {}
 
         if (Math.abs(npv) < precision) {
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: expected 10 to be close to 7.71 +/- 0.1

[Killed] EqualityOperator
src/statistics.js:58:25
         let npv = 0;
         let derivativeNpv = 0;
 
-        for (let t = 0; t < cashFlows.length; t++) {
+        for (let t = 0; t >= cashFlows.length; t++) {
             const denominator = Math.pow(1 + rate, t);
             npv += cashFlows[t] / denominator;
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: expected 10 to be close to 7.71 +/- 0.1

[Killed] ArithmeticOperator
src/statistics.js:59:42
         let derivativeNpv = 0;
 
         for (let t = 0; t < cashFlows.length; t++) {
-            const denominator = Math.pow(1 + rate, t);
+            const denominator = Math.pow(1 - rate, t);
             npv += cashFlows[t] / denominator;
             
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: IRR calculation failed: derivative is zero

[Killed] AssignmentOperator
src/statistics.js:60:13
 
         for (let t = 0; t < cashFlows.length; t++) {
             const denominator = Math.pow(1 + rate, t);
-            npv += cashFlows[t] / denominator;
+            npv -= cashFlows[t] / denominator;
             
             if (t > 0) {
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Killed] ArithmeticOperator
src/statistics.js:60:20
 
         for (let t = 0; t < cashFlows.length; t++) {
             const denominator = Math.pow(1 + rate, t);
-            npv += cashFlows[t] / denominator;
+            npv += cashFlows[t] * denominator;
             
             if (t > 0) {
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: IRR calculation failed: derivative is zero

[Killed] ConditionalExpression
src/statistics.js:62:17
             const denominator = Math.pow(1 + rate, t);
             npv += cashFlows[t] / denominator;
             
-            if (t > 0) {
+            if (false) {
                 // Derivative of CF / (1+r)^t is -t * CF / (1+r)^(t+1)
                 derivativeNpv -= (t * cashFlows[t]) / Math.pow(1 + rate, t + 1);
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Killed] EqualityOperator
src/statistics.js:62:17
             const denominator = Math.pow(1 + rate, t);
             npv += cashFlows[t] / denominator;
             
-            if (t > 0) {
+            if (t <= 0) {
                 // Derivative of CF / (1+r)^t is -t * CF / (1+r)^(t+1)
                 derivativeNpv -= (t * cashFlows[t]) / Math.pow(1 + rate, t + 1);
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Killed] AssignmentOperator
src/statistics.js:64:17
             
             if (t > 0) {
                 // Derivative of CF / (1+r)^t is -t * CF / (1+r)^(t+1)
-                derivativeNpv -= (t * cashFlows[t]) / Math.pow(1 + rate, t + 1);
+                derivativeNpv += t * cashFlows[t] / Math.pow(1 + rate, t + 1);
             }
         }
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Killed] ArithmeticOperator
src/statistics.js:64:35
             
             if (t > 0) {
                 // Derivative of CF / (1+r)^t is -t * CF / (1+r)^(t+1)
-                derivativeNpv -= (t * cashFlows[t]) / Math.pow(1 + rate, t + 1);
+                derivativeNpv -= (t / cashFlows[t]) / Math.pow(1 + rate, t + 1);
             }
         }
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Killed] ConditionalExpression
src/statistics.js:68:13
             }
         }
 
-        if (Math.abs(npv) < precision) {
+        if (true) {
             return Number((rate * 100).toFixed(2));
         }
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: expected 10 to be close to 7.71 +/- 0.1

[Killed] EqualityOperator
src/statistics.js:68:13
             }
         }
 
-        if (Math.abs(npv) < precision) {
+        if (Math.abs(npv) >= precision) {
             return Number((rate * 100).toFixed(2));
         }
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: expected 10 to be close to 7.71 +/- 0.1

[Killed] ArithmeticOperator
src/statistics.js:69:28
         }
 
         if (Math.abs(npv) < precision) {
-            return Number((rate * 100).toFixed(2));
+            return Number((rate / 100).toFixed(2));
         }
 
killedBy: Statistics Module calculateIRR should calculate IRR correctly
statusReason: expected +0 to be close to 10 +/- 0.1

[Killed] EqualityOperator
src/statistics.js:72:13
             return Number((rate * 100).toFixed(2));
         }
 
-        if (derivativeNpv === 0) {
+        if (derivativeNpv !== 0) {
             throw new Error("IRR calculation failed: derivative is zero");
         }
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Killed] ConditionalExpression
src/statistics.js:72:13
             return Number((rate * 100).toFixed(2));
         }
 
-        if (derivativeNpv === 0) {
+        if (true) {
             throw new Error("IRR calculation failed: derivative is zero");
         }
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Killed] ArithmeticOperator
src/statistics.js:76:25
             throw new Error("IRR calculation failed: derivative is zero");
         }
 
-        const newRate = rate - npv / derivativeNpv;
+        const newRate = rate + npv / derivativeNpv;
         
         // If rate jumps too far or becomes invalid, we might fail or clamp
killedBy: Statistics Module calculateIRR should calculate IRR for multi-year flows
statusReason: IRR calculation failed: derivative is zero

[Timeout] ArithmeticOperator
src/statistics.js:76:32
             throw new Error("IRR calculation failed: derivative is zero");
         }
 
-        const newRate = rate - npv / derivativeNpv;
+        const newRate = rate - npv * derivativeNpv;
         
         // If rate jumps too far or becomes invalid, we might fail or clamp

[Survived] EqualityOperator
src/statistics.js:80:13
         
         // If rate jumps too far or becomes invalid, we might fail or clamp
         // For this implementation, we'll just update.
-        if (Math.abs(newRate - rate) < precision) {
+        if (Math.abs(newRate - rate) >= precision) {
              return Number((newRate * 100).toFixed(2));
         }

[Survived] EqualityOperator
src/statistics.js:80:13
         
         // If rate jumps too far or becomes invalid, we might fail or clamp
         // For this implementation, we'll just update.
-        if (Math.abs(newRate - rate) < precision) {
+        if (Math.abs(newRate - rate) <= precision) {
              return Number((newRate * 100).toFixed(2));
         }

[NoCoverage] ArithmeticOperator
src/statistics.js:81:29
         // If rate jumps too far or becomes invalid, we might fail or clamp
         // For this implementation, we'll just update.
         if (Math.abs(newRate - rate) < precision) {
-             return Number((newRate * 100).toFixed(2));
+             return Number((newRate / 100).toFixed(2));
         }
         

[NoCoverage] StringLiteral
src/statistics.js:87:21
         rate = newRate;
     }
 
-    throw new Error("IRR calculation did not converge");
+    throw new Error("");
 }
 

[Killed] BlockStatement
src/statistics.js:95:46
  * @param {Array<number>} returns - An array of percentage returns (e.g., [5, 10, -2]).
  * @returns {number} The standard deviation.
  */
-function calculateStandardDeviation(returns) {
-    if (!Array.isArray(returns) || returns.length === 0) {
-        throw new Error("Invalid returns data");
-    }
-
-    if (returns.length === 1) return 0;
-
-    const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
-    
-    const squaredDiffs = returns.map(val => Math.pow(val - mean, 2));
-    const variance = squaredDiffs.reduce((sum, val) => sum + val, 0) / (returns.length - 1); // Sample standard deviation
-
-    return Number(Math.sqrt(variance).toFixed(4));
-}
+function calculateStandardDeviation(returns) {}
 
 /**
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected undefined to be numeric

[Killed] LogicalOperator
src/statistics.js:96:9
  * @returns {number} The standard deviation.
  */
 function calculateStandardDeviation(returns) {
-    if (!Array.isArray(returns) || returns.length === 0) {
+    if (!Array.isArray(returns) && returns.length === 0) {
         throw new Error("Invalid returns data");
     }
killedBy: Statistics Module calculateStandardDeviation should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid returns data' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/statistics.js:96:9
  * @returns {number} The standard deviation.
  */
 function calculateStandardDeviation(returns) {
-    if (!Array.isArray(returns) || returns.length === 0) {
+    if (false) {
         throw new Error("Invalid returns data");
     }
killedBy: Statistics Module calculateStandardDeviation should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid returns data' but got 'Cannot read properties of null (readi…'

[Killed] EqualityOperator
src/statistics.js:100:9
         throw new Error("Invalid returns data");
     }
 
-    if (returns.length === 1) return 0;
+    if (returns.length !== 1) return 0;
 
     const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected +0 to be close to 5.237 +/- 0.01

[Killed] ConditionalExpression
src/statistics.js:100:9
         throw new Error("Invalid returns data");
     }
 
-    if (returns.length === 1) return 0;
+    if (true) return 0;
 
     const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected +0 to be close to 5.237 +/- 0.01

[Killed] ArithmeticOperator
src/statistics.js:102:18
 
     if (returns.length === 1) return 0;
 
-    const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
+    const mean = returns.reduce((sum, val) => sum + val, 0) * returns.length;
     
     const squaredDiffs = returns.map(val => Math.pow(val - mean, 2));
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected 1212.3083 to be close to 5.237 +/- 0.01

[Killed] ArithmeticOperator
src/statistics.js:102:47
 
     if (returns.length === 1) return 0;
 
-    const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
+    const mean = returns.reduce((sum, val) => sum - val, 0) / returns.length;
     
     const squaredDiffs = returns.map(val => Math.pow(val - mean, 2));
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected 38.8403 to be close to 5.237 +/- 0.01

[Killed] ArrowFunction
src/statistics.js:104:38
 
     const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
     
-    const squaredDiffs = returns.map(val => Math.pow(val - mean, 2));
+    const squaredDiffs = returns.map(() => undefined);
     const variance = squaredDiffs.reduce((sum, val) => sum + val, 0) / (returns.length - 1); // Sample standard deviation
 
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected NaN to be close to 5.237 +/- 0.01

[Killed] ArithmeticOperator
src/statistics.js:104:54
 
     const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
     
-    const squaredDiffs = returns.map(val => Math.pow(val - mean, 2));
+    const squaredDiffs = returns.map(val => Math.pow(val + mean, 2));
     const variance = squaredDiffs.reduce((sum, val) => sum + val, 0) / (returns.length - 1); // Sample standard deviation
 
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected 38.8403 to be close to 5.237 +/- 0.01

[Killed] ArrowFunction
src/statistics.js:105:42
     const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
     
     const squaredDiffs = returns.map(val => Math.pow(val - mean, 2));
-    const variance = squaredDiffs.reduce((sum, val) => sum + val, 0) / (returns.length - 1); // Sample standard deviation
+    const variance = squaredDiffs.reduce(() => undefined, 0) / (returns.length - 1); // Sample standard deviation
 
     return Number(Math.sqrt(variance).toFixed(4));
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected NaN to be close to 5.237 +/- 0.01

[Killed] ArithmeticOperator
src/statistics.js:105:73
     const mean = returns.reduce((sum, val) => sum + val, 0) / returns.length;
     
     const squaredDiffs = returns.map(val => Math.pow(val - mean, 2));
-    const variance = squaredDiffs.reduce((sum, val) => sum + val, 0) / (returns.length - 1); // Sample standard deviation
+    const variance = squaredDiffs.reduce((sum, val) => sum + val, 0) / (returns.length + 1); // Sample standard deviation
 
     return Number(Math.sqrt(variance).toFixed(4));
killedBy: Statistics Module calculateStandardDeviation should calculate standard deviation correctly
statusReason: expected 4.6188 to be close to 5.237 +/- 0.01

[Killed] BlockStatement
src/statistics.js:116:54
  * @param {number} riskFreeRate - The risk-free rate (as a percentage).
  * @returns {number} The Sharpe Ratio.
  */
-function calculateSharpeRatio(returns, riskFreeRate) {
-    if (!Array.isArray(returns) || typeof riskFreeRate !== 'number') {
-        throw new Error("Invalid input parameters");
-    }
-
-    const meanReturn = returns.reduce((sum, val) => sum + val, 0) / returns.length;
-    const stdDev = calculateStandardDeviation(returns);
-
-    if (stdDev === 0) {
-        throw new Error("Standard deviation is zero, cannot calculate Sharpe Ratio");
-    }
-
-    const excessReturn = meanReturn - riskFreeRate;
-    return Number((excessReturn / stdDev).toFixed(4));
-}
+function calculateSharpeRatio(returns, riskFreeRate) {}
 
 module.exports = {
killedBy: Statistics Module calculateSharpeRatio should calculate Sharpe Ratio correctly
statusReason: expected undefined to be numeric

[Killed] BooleanLiteral
src/statistics.js:117:9
  * @returns {number} The Sharpe Ratio.
  */
 function calculateSharpeRatio(returns, riskFreeRate) {
-    if (!Array.isArray(returns) || typeof riskFreeRate !== 'number') {
+    if (Array.isArray(returns) || typeof riskFreeRate !== 'number') {
         throw new Error("Invalid input parameters");
     }
killedBy: Statistics Module calculateSharpeRatio should calculate Sharpe Ratio correctly
statusReason: Invalid input parameters

[Killed] LogicalOperator
src/statistics.js:117:9
  * @returns {number} The Sharpe Ratio.
  */
 function calculateSharpeRatio(returns, riskFreeRate) {
-    if (!Array.isArray(returns) || typeof riskFreeRate !== 'number') {
+    if (!Array.isArray(returns) && typeof riskFreeRate !== 'number') {
         throw new Error("Invalid input parameters");
     }
killedBy: Statistics Module calculateSharpeRatio should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got 'Cannot read properties of null (readi…'

[Killed] StringLiteral
src/statistics.js:118:25
  */
 function calculateSharpeRatio(returns, riskFreeRate) {
     if (!Array.isArray(returns) || typeof riskFreeRate !== 'number') {
-        throw new Error("Invalid input parameters");
+        throw new Error("");
     }
 
killedBy: Statistics Module calculateSharpeRatio should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got ''

[Killed] ArithmeticOperator
src/statistics.js:121:24
         throw new Error("Invalid input parameters");
     }
 
-    const meanReturn = returns.reduce((sum, val) => sum + val, 0) / returns.length;
+    const meanReturn = returns.reduce((sum, val) => sum + val, 0) * returns.length;
     const stdDev = calculateStandardDeviation(returns);
 
killedBy: Statistics Module calculateSharpeRatio should calculate Sharpe Ratio correctly
statusReason: expected 6.7175 to be close to 1.4142 +/- 0.001

[Killed] ArrowFunction
src/statistics.js:121:39
         throw new Error("Invalid input parameters");
     }
 
-    const meanReturn = returns.reduce((sum, val) => sum + val, 0) / returns.length;
+    const meanReturn = returns.reduce(() => undefined, 0) / returns.length;
     const stdDev = calculateStandardDeviation(returns);
 
killedBy: Statistics Module calculateSharpeRatio should calculate Sharpe Ratio correctly
statusReason: expected NaN to be close to 1.4142 +/- 0.001

[Killed] ConditionalExpression
src/statistics.js:124:9
     const meanReturn = returns.reduce((sum, val) => sum + val, 0) / returns.length;
     const stdDev = calculateStandardDeviation(returns);
 
-    if (stdDev === 0) {
+    if (true) {
         throw new Error("Standard deviation is zero, cannot calculate Sharpe Ratio");
     }
killedBy: Statistics Module calculateSharpeRatio should calculate Sharpe Ratio correctly
statusReason: Standard deviation is zero, cannot calculate Sharpe Ratio

[Killed] ConditionalExpression
src/statistics.js:124:9
     const meanReturn = returns.reduce((sum, val) => sum + val, 0) / returns.length;
     const stdDev = calculateStandardDeviation(returns);
 
-    if (stdDev === 0) {
+    if (false) {
         throw new Error("Standard deviation is zero, cannot calculate Sharpe Ratio");
     }
killedBy: Statistics Module calculateSharpeRatio should throw error for zero std dev
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/statistics.js:125:25
     const stdDev = calculateStandardDeviation(returns);
 
     if (stdDev === 0) {
-        throw new Error("Standard deviation is zero, cannot calculate Sharpe Ratio");
+        throw new Error("");
     }
 
killedBy: Statistics Module calculateSharpeRatio should throw error for zero std dev
statusReason: expected [Function] to throw error including 'Standard deviation is zero, cannot ca…' but got ''

[Killed] ArithmeticOperator
src/statistics.js:128:26
         throw new Error("Standard deviation is zero, cannot calculate Sharpe Ratio");
     }
 
-    const excessReturn = meanReturn - riskFreeRate;
+    const excessReturn = meanReturn + riskFreeRate;
     return Number((excessReturn / stdDev).toFixed(4));
 }
killedBy: Statistics Module calculateSharpeRatio should calculate Sharpe Ratio correctly
statusReason: expected 2.1213 to be close to 1.4142 +/- 0.001

[Killed] ArithmeticOperator
src/statistics.js:129:20
     }
 
     const excessReturn = meanReturn - riskFreeRate;
-    return Number((excessReturn / stdDev).toFixed(4));
+    return Number((excessReturn * stdDev).toFixed(4));
 }
 
killedBy: Statistics Module calculateSharpeRatio should calculate Sharpe Ratio correctly
statusReason: expected 45.2552 to be close to 1.4142 +/- 0.001
