[Killed] ObjectLiteral
src/statistics.js:132:18
     return Number((excessReturn / stdDev).toFixed(4));
 }
 
-module.exports = {
-    calculateNPV,
-    calculateIRR,
-    calculateStandardDeviation,
-    calculateSharpeRatio,
-    calculateBeta,
-    calculateTreynorRatio
-};
+module.exports = {};
 
 /**
killedBy: Statistics Module calculateNPV should calculate NPV correctly
statusReason: calculateNPV is not a function

[Killed] BlockStatement
src/statistics.js:148:53
  * @param {Array<number>} marketReturns - Array of market returns.
  * @returns {number} Beta value.
  */
-function calculateBeta(assetReturns, marketReturns) {
-    if (!Array.isArray(assetReturns) || !Array.isArray(marketReturns) || assetReturns.length !== marketReturns.length) {
-        throw new Error("Invalid input parameters: arrays must be of same length");
-    }
-    if (assetReturns.length < 2) throw new Error("Insufficient data points");
-
-    const assetMean = assetReturns.reduce((a, b) => a + b, 0) / assetReturns.length;
-    const marketMean = marketReturns.reduce((a, b) => a + b, 0) / marketReturns.length;
-
-    let covariance = 0;
-    let marketVariance = 0;
-
-    for (let i = 0; i < assetReturns.length; i++) {
-        const assetDiff = assetReturns[i] - assetMean;
-        const marketDiff = marketReturns[i] - marketMean;
-        
-        covariance += assetDiff * marketDiff;
-        marketVariance += marketDiff * marketDiff;
-    }
-
-    if (marketVariance === 0) return 0; // Or throw?
-
-    return Number((covariance / marketVariance).toFixed(4));
-}
+function calculateBeta(assetReturns, marketReturns) {}
 
 /**
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected undefined to equal 2

[Killed] BooleanLiteral
src/statistics.js:149:41
  * @returns {number} Beta value.
  */
 function calculateBeta(assetReturns, marketReturns) {
-    if (!Array.isArray(assetReturns) || !Array.isArray(marketReturns) || assetReturns.length !== marketReturns.length) {
+    if (!Array.isArray(assetReturns) || Array.isArray(marketReturns) || assetReturns.length !== marketReturns.length) {
         throw new Error("Invalid input parameters: arrays must be of same length");
     }
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: Invalid input parameters: arrays must be of same length

[Killed] LogicalOperator
src/statistics.js:149:9
  * @returns {number} Beta value.
  */
 function calculateBeta(assetReturns, marketReturns) {
-    if (!Array.isArray(assetReturns) || !Array.isArray(marketReturns) || assetReturns.length !== marketReturns.length) {
+    if (!Array.isArray(assetReturns) && !Array.isArray(marketReturns) || assetReturns.length !== marketReturns.length) {
         throw new Error("Invalid input parameters: arrays must be of same length");
     }
killedBy: Statistics Module calculateBeta should throw error for invalid inputs
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got 'Cannot read properties of null (readi…'

[Killed] EqualityOperator
src/statistics.js:152:9
     if (!Array.isArray(assetReturns) || !Array.isArray(marketReturns) || assetReturns.length !== marketReturns.length) {
         throw new Error("Invalid input parameters: arrays must be of same length");
     }
-    if (assetReturns.length < 2) throw new Error("Insufficient data points");
+    if (assetReturns.length >= 2) throw new Error("Insufficient data points");
 
     const assetMean = assetReturns.reduce((a, b) => a + b, 0) / assetReturns.length;
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: Insufficient data points

[Killed] ConditionalExpression
src/statistics.js:152:9
     if (!Array.isArray(assetReturns) || !Array.isArray(marketReturns) || assetReturns.length !== marketReturns.length) {
         throw new Error("Invalid input parameters: arrays must be of same length");
     }
-    if (assetReturns.length < 2) throw new Error("Insufficient data points");
+    if (false) throw new Error("Insufficient data points");
 
     const assetMean = assetReturns.reduce((a, b) => a + b, 0) / assetReturns.length;
killedBy: Statistics Module calculateBeta should throw error for insufficient data
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/statistics.js:154:43
     }
     if (assetReturns.length < 2) throw new Error("Insufficient data points");
 
-    const assetMean = assetReturns.reduce((a, b) => a + b, 0) / assetReturns.length;
+    const assetMean = assetReturns.reduce(() => undefined, 0) / assetReturns.length;
     const marketMean = marketReturns.reduce((a, b) => a + b, 0) / marketReturns.length;
 
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected NaN to equal 2

[Survived] ArithmeticOperator
src/statistics.js:154:53
     }
     if (assetReturns.length < 2) throw new Error("Insufficient data points");
 
-    const assetMean = assetReturns.reduce((a, b) => a + b, 0) / assetReturns.length;
+    const assetMean = assetReturns.reduce((a, b) => a - b, 0) / assetReturns.length;
     const marketMean = marketReturns.reduce((a, b) => a + b, 0) / marketReturns.length;
 

[Killed] ArithmeticOperator
src/statistics.js:155:24
     if (assetReturns.length < 2) throw new Error("Insufficient data points");
 
     const assetMean = assetReturns.reduce((a, b) => a + b, 0) / assetReturns.length;
-    const marketMean = marketReturns.reduce((a, b) => a + b, 0) / marketReturns.length;
+    const marketMean = marketReturns.reduce((a, b) => a + b, 0) * marketReturns.length;
 
     let covariance = 0;
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected 0.0052 to equal 2

[Killed] ArrowFunction
src/statistics.js:155:45
     if (assetReturns.length < 2) throw new Error("Insufficient data points");
 
     const assetMean = assetReturns.reduce((a, b) => a + b, 0) / assetReturns.length;
-    const marketMean = marketReturns.reduce((a, b) => a + b, 0) / marketReturns.length;
+    const marketMean = marketReturns.reduce(() => undefined, 0) / marketReturns.length;
 
     let covariance = 0;
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected NaN to equal 2

[Killed] EqualityOperator
src/statistics.js:160:21
     let covariance = 0;
     let marketVariance = 0;
 
-    for (let i = 0; i < assetReturns.length; i++) {
+    for (let i = 0; i <= assetReturns.length; i++) {
         const assetDiff = assetReturns[i] - assetMean;
         const marketDiff = marketReturns[i] - marketMean;
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected NaN to equal 2

[Killed] BlockStatement
src/statistics.js:160:51
     let covariance = 0;
     let marketVariance = 0;
 
-    for (let i = 0; i < assetReturns.length; i++) {
-        const assetDiff = assetReturns[i] - assetMean;
-        const marketDiff = marketReturns[i] - marketMean;
-        
-        covariance += assetDiff * marketDiff;
-        marketVariance += marketDiff * marketDiff;
-    }
+    for (let i = 0; i < assetReturns.length; i++) {}
 
     if (marketVariance === 0) return 0; // Or throw?
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected +0 to equal 2

[Survived] ArithmeticOperator
src/statistics.js:161:27
     let marketVariance = 0;
 
     for (let i = 0; i < assetReturns.length; i++) {
-        const assetDiff = assetReturns[i] - assetMean;
+        const assetDiff = assetReturns[i] + assetMean;
         const marketDiff = marketReturns[i] - marketMean;
         

[Killed] ArithmeticOperator
src/statistics.js:162:28
 
     for (let i = 0; i < assetReturns.length; i++) {
         const assetDiff = assetReturns[i] - assetMean;
-        const marketDiff = marketReturns[i] - marketMean;
+        const marketDiff = marketReturns[i] + marketMean;
         
         covariance += assetDiff * marketDiff;
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected 0.08 to equal 2

[Killed] ArithmeticOperator
src/statistics.js:164:23
         const assetDiff = assetReturns[i] - assetMean;
         const marketDiff = marketReturns[i] - marketMean;
         
-        covariance += assetDiff * marketDiff;
+        covariance += assetDiff / marketDiff;
         marketVariance += marketDiff * marketDiff;
     }
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected NaN to equal 2

[Killed] AssignmentOperator
src/statistics.js:164:9
         const assetDiff = assetReturns[i] - assetMean;
         const marketDiff = marketReturns[i] - marketMean;
         
-        covariance += assetDiff * marketDiff;
+        covariance -= assetDiff * marketDiff;
         marketVariance += marketDiff * marketDiff;
     }
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected -2 to equal 2

[Killed] ArithmeticOperator
src/statistics.js:165:27
         const marketDiff = marketReturns[i] - marketMean;
         
         covariance += assetDiff * marketDiff;
-        marketVariance += marketDiff * marketDiff;
+        marketVariance += marketDiff / marketDiff;
     }
 
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected NaN to equal 2

[Killed] AssignmentOperator
src/statistics.js:165:9
         const marketDiff = marketReturns[i] - marketMean;
         
         covariance += assetDiff * marketDiff;
-        marketVariance += marketDiff * marketDiff;
+        marketVariance -= marketDiff * marketDiff;
     }
 
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected -2 to equal 2

[Killed] ConditionalExpression
src/statistics.js:168:9
         marketVariance += marketDiff * marketDiff;
     }
 
-    if (marketVariance === 0) return 0; // Or throw?
+    if (true) return 0; // Or throw?
 
     return Number((covariance / marketVariance).toFixed(4));
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected +0 to equal 2

[Killed] EqualityOperator
src/statistics.js:168:9
         marketVariance += marketDiff * marketDiff;
     }
 
-    if (marketVariance === 0) return 0; // Or throw?
+    if (marketVariance !== 0) return 0; // Or throw?
 
     return Number((covariance / marketVariance).toFixed(4));
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected +0 to equal 2

[Killed] ArithmeticOperator
src/statistics.js:170:20
 
     if (marketVariance === 0) return 0; // Or throw?
 
-    return Number((covariance / marketVariance).toFixed(4));
+    return Number((covariance * marketVariance).toFixed(4));
 }
 
killedBy: Statistics Module calculateBeta should calculate Beta correctly
statusReason: expected 5000 to equal 2

[Killed] BlockStatement
src/statistics.js:180:64
  * @param {number} beta - Portfolio Beta.
  * @returns {number} Treynor Ratio.
  */
-function calculateTreynorRatio(returnRate, riskFreeRate, beta) {
-    if (beta === 0) throw new Error("Beta cannot be zero");
-    
-    return Number(((returnRate - riskFreeRate) / beta).toFixed(4));
-}
+function calculateTreynorRatio(returnRate, riskFreeRate, beta) {}
 
killedBy: Statistics Module calculateTreynorRatio should calculate Treynor Ratio correctly
statusReason: expected undefined to equal 5

[Killed] ConditionalExpression
src/statistics.js:181:9
  * @returns {number} Treynor Ratio.
  */
 function calculateTreynorRatio(returnRate, riskFreeRate, beta) {
-    if (beta === 0) throw new Error("Beta cannot be zero");
+    if (false) throw new Error("Beta cannot be zero");
     
     return Number(((returnRate - riskFreeRate) / beta).toFixed(4));
killedBy: Statistics Module calculateTreynorRatio should throw error for zero beta
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/statistics.js:181:9
  * @returns {number} Treynor Ratio.
  */
 function calculateTreynorRatio(returnRate, riskFreeRate, beta) {
-    if (beta === 0) throw new Error("Beta cannot be zero");
+    if (true) throw new Error("Beta cannot be zero");
     
     return Number(((returnRate - riskFreeRate) / beta).toFixed(4));
killedBy: Statistics Module calculateTreynorRatio should calculate Treynor Ratio correctly
statusReason: Beta cannot be zero

[Killed] ArithmeticOperator
src/statistics.js:183:21
 function calculateTreynorRatio(returnRate, riskFreeRate, beta) {
     if (beta === 0) throw new Error("Beta cannot be zero");
     
-    return Number(((returnRate - riskFreeRate) / beta).toFixed(4));
+    return Number(((returnRate + riskFreeRate) / beta).toFixed(4));
 }
 
killedBy: Statistics Module calculateTreynorRatio should calculate Treynor Ratio correctly
statusReason: expected 10 to equal 5

[Killed] ArithmeticOperator
src/statistics.js:183:20
 function calculateTreynorRatio(returnRate, riskFreeRate, beta) {
     if (beta === 0) throw new Error("Beta cannot be zero");
     
-    return Number(((returnRate - riskFreeRate) / beta).toFixed(4));
+    return Number(((returnRate - riskFreeRate) * beta).toFixed(4));
 }
 
killedBy: Statistics Module calculateTreynorRatio should calculate Treynor Ratio correctly
statusReason: expected 20 to equal 5
