[Killed] EqualityOperator
src/tax.js:8:7
  * @returns {number} The total tax amount.
  */
 function calculateIncomeTax(income, brackets) {
-  if (income < 0) {
+  if (income <= 0) {
     throw new Error("Income cannot be negative");
   }
killedBy: Tax Module calculateIncomeTax should handle zero income
statusReason: Income cannot be negative

[Killed] ConditionalExpression
src/tax.js:8:7
  * @returns {number} The total tax amount.
  */
 function calculateIncomeTax(income, brackets) {
-  if (income < 0) {
+  if (true) {
     throw new Error("Income cannot be negative");
   }
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: Income cannot be negative

[Killed] StringLiteral
src/tax.js:9:21
  */
 function calculateIncomeTax(income, brackets) {
   if (income < 0) {
-    throw new Error("Income cannot be negative");
+    throw new Error("");
   }
   if (!brackets || brackets.length === 0) {
killedBy: Tax Module calculateIncomeTax should throw error for negative income
statusReason: expected [Function] to throw error including 'Income cannot be negative' but got ''

[Killed] ConditionalExpression
src/tax.js:11:20
   if (income < 0) {
     throw new Error("Income cannot be negative");
   }
-  if (!brackets || brackets.length === 0) {
+  if (!brackets || false) {
       throw new Error("Invalid tax brackets");
   }
killedBy: Tax Module calculateIncomeTax should throw error for invalid brackets
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/tax.js:11:7
   if (income < 0) {
     throw new Error("Income cannot be negative");
   }
-  if (!brackets || brackets.length === 0) {
+  if (false) {
       throw new Error("Invalid tax brackets");
   }
killedBy: Tax Module calculateIncomeTax should throw error for invalid brackets
statusReason: expected [Function] to throw error including 'Invalid tax brackets' but got 'brackets is not iterable'

[Killed] BlockStatement
src/tax.js:19:35
   let remainingIncome = income;
   let previousMax = 0;
 
-  for (const bracket of brackets) {
-    const range = bracket.max - previousMax;
-    const taxableAmount = Math.min(remainingIncome, range);
-
-    if (taxableAmount > 0) {
-      tax += taxableAmount * bracket.rate;
-      remainingIncome -= taxableAmount;
-    }
-    
-    previousMax = bracket.max;
-
-    if (remainingIncome <= 0) break;
-  }
+  for (const bracket of brackets) {}
   
   return Number(tax.toFixed(2));
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: expected +0 to equal 500

[Killed] ArithmeticOperator
src/tax.js:20:19
   let previousMax = 0;
 
   for (const bracket of brackets) {
-    const range = bracket.max - previousMax;
+    const range = bracket.max + previousMax;
     const taxableAmount = Math.min(remainingIncome, range);
 
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for top bracket
statusReason: expected 7000 to equal 9000

[Killed] MethodExpression
src/tax.js:21:27
 
   for (const bracket of brackets) {
     const range = bracket.max - previousMax;
-    const taxableAmount = Math.min(remainingIncome, range);
+    const taxableAmount = Math.max(remainingIncome, range);
 
     if (taxableAmount > 0) {
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: expected 1000 to equal 500

[Killed] BlockStatement
src/tax.js:23:28
     const range = bracket.max - previousMax;
     const taxableAmount = Math.min(remainingIncome, range);
 
-    if (taxableAmount > 0) {
-      tax += taxableAmount * bracket.rate;
-      remainingIncome -= taxableAmount;
-    }
+    if (taxableAmount > 0) {}
     
     previousMax = bracket.max;
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: expected +0 to equal 500

[Killed] ConditionalExpression
src/tax.js:23:9
     const range = bracket.max - previousMax;
     const taxableAmount = Math.min(remainingIncome, range);
 
-    if (taxableAmount > 0) {
+    if (false) {
       tax += taxableAmount * bracket.rate;
       remainingIncome -= taxableAmount;
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: expected +0 to equal 500

[Killed] ArithmeticOperator
src/tax.js:24:14
     const taxableAmount = Math.min(remainingIncome, range);
 
     if (taxableAmount > 0) {
-      tax += taxableAmount * bracket.rate;
+      tax += taxableAmount / bracket.rate;
       remainingIncome -= taxableAmount;
     }
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: expected 50000 to equal 500

[Killed] AssignmentOperator
src/tax.js:24:7
     const taxableAmount = Math.min(remainingIncome, range);
 
     if (taxableAmount > 0) {
-      tax += taxableAmount * bracket.rate;
+      tax -= taxableAmount * bracket.rate;
       remainingIncome -= taxableAmount;
     }
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: expected -500 to equal 500

[Killed] AssignmentOperator
src/tax.js:25:7
 
     if (taxableAmount > 0) {
       tax += taxableAmount * bracket.rate;
-      remainingIncome -= taxableAmount;
+      remainingIncome += taxableAmount;
     }
     
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: expected 7000 to equal 500

[Killed] ConditionalExpression
src/tax.js:30:9
     
     previousMax = bracket.max;
 
-    if (remainingIncome <= 0) break;
+    if (true) break;
   }
   
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for second bracket
statusReason: expected 1000 to equal 2500

[Killed] EqualityOperator
src/tax.js:30:9
     
     previousMax = bracket.max;
 
-    if (remainingIncome <= 0) break;
+    if (remainingIncome > 0) break;
   }
   
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for second bracket
statusReason: expected 1000 to equal 2500

[Killed] BlockStatement
src/tax.js:42:49
  * @param {number} tax - The total tax paid.
  * @returns {number} The effective tax rate as a percentage.
  */
-function calculateEffectiveTaxRate(income, tax) {
-    if (income === 0) return 0;
-    return Number(((tax / income) * 100).toFixed(2));
-}
+function calculateEffectiveTaxRate(income, tax) {}
 
 /**
killedBy: Tax Module calculateEffectiveTaxRate should calculate effective rate correctly
statusReason: expected undefined to equal 18

[Killed] EqualityOperator
src/tax.js:43:9
  * @returns {number} The effective tax rate as a percentage.
  */
 function calculateEffectiveTaxRate(income, tax) {
-    if (income === 0) return 0;
+    if (income !== 0) return 0;
     return Number(((tax / income) * 100).toFixed(2));
 }
killedBy: Tax Module calculateEffectiveTaxRate should calculate effective rate correctly
statusReason: expected +0 to equal 18

[Killed] ConditionalExpression
src/tax.js:43:9
  * @returns {number} The effective tax rate as a percentage.
  */
 function calculateEffectiveTaxRate(income, tax) {
-    if (income === 0) return 0;
+    if (false) return 0;
     return Number(((tax / income) * 100).toFixed(2));
 }
killedBy: Tax Module calculateEffectiveTaxRate should handle zero income
statusReason: expected NaN to equal +0

[Killed] ArithmeticOperator
src/tax.js:44:20
  */
 function calculateEffectiveTaxRate(income, tax) {
     if (income === 0) return 0;
-    return Number(((tax / income) * 100).toFixed(2));
+    return Number((tax / income / 100).toFixed(2));
 }
 
killedBy: Tax Module calculateEffectiveTaxRate should calculate effective rate correctly
statusReason: expected +0 to equal 18

[Killed] ArithmeticOperator
src/tax.js:44:21
  */
 function calculateEffectiveTaxRate(income, tax) {
     if (income === 0) return 0;
-    return Number(((tax / income) * 100).toFixed(2));
+    return Number(((tax * income) * 100).toFixed(2));
 }
 
killedBy: Tax Module calculateEffectiveTaxRate should calculate effective rate correctly
statusReason: expected 45000000000 to equal 18

[Killed] EqualityOperator
src/tax.js:56:26
  * @returns {Object} Tax details (gain, type, taxAmount).
  */
 function calculateCapitalGains(costBasis, sellPrice, yearsHeld, income) {
-    if (costBasis < 0 || sellPrice < 0 || yearsHeld < 0 || income < 0) {
+    if (costBasis < 0 || sellPrice >= 0 || yearsHeld < 0 || income < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: Invalid input parameters

[Killed] EqualityOperator
src/tax.js:56:43
  * @returns {Object} Tax details (gain, type, taxAmount).
  */
 function calculateCapitalGains(costBasis, sellPrice, yearsHeld, income) {
-    if (costBasis < 0 || sellPrice < 0 || yearsHeld < 0 || income < 0) {
+    if (costBasis < 0 || sellPrice < 0 || yearsHeld >= 0 || income < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/tax.js:60:18
         throw new Error("Invalid input parameters");
     }
 
-    const gain = sellPrice - costBasis;
+    const gain = sellPrice + costBasis;
     const type = yearsHeld >= 1 ? 'Long-term' : 'Short-term';
     let taxRate = 0;
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected 3000 to equal 1000

[Killed] EqualityOperator
src/tax.js:61:18
     }
 
     const gain = sellPrice - costBasis;
-    const type = yearsHeld >= 1 ? 'Long-term' : 'Short-term';
+    const type = yearsHeld > 1 ? 'Long-term' : 'Short-term';
     let taxRate = 0;
 
killedBy: Tax Module calculateCapitalGains should handle holding period exactly 1 year (Long-term)
statusReason: expected 'Short-term' to equal 'Long-term'

[Killed] EqualityOperator
src/tax.js:61:18
     }
 
     const gain = sellPrice - costBasis;
-    const type = yearsHeld >= 1 ? 'Long-term' : 'Short-term';
+    const type = yearsHeld < 1 ? 'Long-term' : 'Short-term';
     let taxRate = 0;
 
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected 'Short-term' to equal 'Long-term'

[Killed] ConditionalExpression
src/tax.js:64:9
     const type = yearsHeld >= 1 ? 'Long-term' : 'Short-term';
     let taxRate = 0;
 
-    if (gain <= 0) {
+    if (true) {
         return { gain: gain, type: type, taxAmount: 0 };
     }
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected +0 to equal 150

[Killed] EqualityOperator
src/tax.js:64:9
     const type = yearsHeld >= 1 ? 'Long-term' : 'Short-term';
     let taxRate = 0;
 
-    if (gain <= 0) {
+    if (gain > 0) {
         return { gain: gain, type: type, taxAmount: 0 };
     }
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected +0 to equal 150

[Killed] EqualityOperator
src/tax.js:68:9
         return { gain: gain, type: type, taxAmount: 0 };
     }
 
-    if (type === 'Short-term') {
+    if (type !== 'Short-term') {
         // Taxed as ordinary income. Simplified: use a flat rate based on income roughly?
         // Or just say "Ordinary Income Rate".
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected 220 to equal 150

[Killed] BlockStatement
src/tax.js:68:32
         return { gain: gain, type: type, taxAmount: 0 };
     }
 
-    if (type === 'Short-term') {
-        // Taxed as ordinary income. Simplified: use a flat rate based on income roughly?
-        // Or just say "Ordinary Income Rate".
-        // For this function, let's assume we return the *amount* based on a simplified bracket logic for short term (same as income tax).
-        // But we don't have brackets here. Let's assume a flat 22% for simplicity or require brackets?
-        // Let's use simplified logic: Short term = 22%, Long term = 15% (standard).
-        // Refined: Long term 0% if income < 40k, 15% if < 440k, 20% if > 440k.
-        taxRate = 0.22; // Simplified average
-    } else {
+    if (type === 'Short-term') {} else {
         if (income < 40000) taxRate = 0.0;
         else if (income < 440000) taxRate = 0.15;
killedBy: Tax Module calculateCapitalGains should calculate short-term gains correctly
statusReason: expected +0 to equal 220

[Killed] BlockStatement
src/tax.js:76:12
         // Let's use simplified logic: Short term = 22%, Long term = 15% (standard).
         // Refined: Long term 0% if income < 40k, 15% if < 440k, 20% if > 440k.
         taxRate = 0.22; // Simplified average
-    } else {
-        if (income < 40000) taxRate = 0.0;
-        else if (income < 440000) taxRate = 0.15;
-        else taxRate = 0.20;
-    }
+    } else {}
 
     const taxAmount = gain * taxRate;
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected +0 to equal 150

[Killed] EqualityOperator
src/tax.js:77:13
         // Refined: Long term 0% if income < 40k, 15% if < 440k, 20% if > 440k.
         taxRate = 0.22; // Simplified average
     } else {
-        if (income < 40000) taxRate = 0.0;
+        if (income >= 40000) taxRate = 0.0;
         else if (income < 440000) taxRate = 0.15;
         else taxRate = 0.20;
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected +0 to equal 150

[Killed] ConditionalExpression
src/tax.js:77:13
         // Refined: Long term 0% if income < 40k, 15% if < 440k, 20% if > 440k.
         taxRate = 0.22; // Simplified average
     } else {
-        if (income < 40000) taxRate = 0.0;
+        if (true) taxRate = 0.0;
         else if (income < 440000) taxRate = 0.15;
         else taxRate = 0.20;
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected +0 to equal 150

[Killed] ConditionalExpression
src/tax.js:78:18
         taxRate = 0.22; // Simplified average
     } else {
         if (income < 40000) taxRate = 0.0;
-        else if (income < 440000) taxRate = 0.15;
+        else if (false) taxRate = 0.15;
         else taxRate = 0.20;
     }
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected 200 to equal 150

[Killed] EqualityOperator
src/tax.js:78:18
         taxRate = 0.22; // Simplified average
     } else {
         if (income < 40000) taxRate = 0.0;
-        else if (income < 440000) taxRate = 0.15;
+        else if (income >= 440000) taxRate = 0.15;
         else taxRate = 0.20;
     }
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected 200 to equal 150

[Killed] ArithmeticOperator
src/tax.js:82:23
         else taxRate = 0.20;
     }
 
-    const taxAmount = gain * taxRate;
+    const taxAmount = gain / taxRate;
 
     return {
killedBy: Tax Module calculateCapitalGains should calculate long-term gains correctly
statusReason: expected 6666.67 to equal 150

[Killed] ConditionalExpression
src/tax.js:100:9
  * @returns {number} Estimated tax.
  */
 function estimateTaxLiability(income, filingStatus, itemizedDeductions = 0) {
-    if (income < 0 || itemizedDeductions < 0) throw new Error("Invalid input parameters");
+    if (false) throw new Error("Invalid input parameters");
 
     const standardDeductions = {
killedBy: Tax Module estimateTaxLiability should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/tax.js:100:9
  * @returns {number} Estimated tax.
  */
 function estimateTaxLiability(income, filingStatus, itemizedDeductions = 0) {
-    if (income < 0 || itemizedDeductions < 0) throw new Error("Invalid input parameters");
+    if (false || itemizedDeductions < 0) throw new Error("Invalid input parameters");
 
     const standardDeductions = {
killedBy: Tax Module estimateTaxLiability should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/tax.js:102:32
 function estimateTaxLiability(income, filingStatus, itemizedDeductions = 0) {
     if (income < 0 || itemizedDeductions < 0) throw new Error("Invalid input parameters");
 
-    const standardDeductions = {
-        'single': 12950,
-        'married': 25900,
-        'head': 19400
-    };
+    const standardDeductions = {};
 
     const deduction = Math.max(standardDeductions[filingStatus] || 0, itemizedDeductions);
killedBy: Tax Module estimateTaxLiability should apply standard deduction
statusReason: expected 2194.5 to equal 705

[Killed] ConditionalExpression
src/tax.js:108:32
         'head': 19400
     };
 
-    const deduction = Math.max(standardDeductions[filingStatus] || 0, itemizedDeductions);
+    const deduction = Math.max(false, itemizedDeductions);
     const taxableIncome = Math.max(0, income - deduction);
 
killedBy: Tax Module estimateTaxLiability should apply standard deduction
statusReason: expected 2194.5 to equal 705

[Killed] LogicalOperator
src/tax.js:108:32
         'head': 19400
     };
 
-    const deduction = Math.max(standardDeductions[filingStatus] || 0, itemizedDeductions);
+    const deduction = Math.max(standardDeductions[filingStatus] && 0, itemizedDeductions);
     const taxableIncome = Math.max(0, income - deduction);
 
killedBy: Tax Module estimateTaxLiability should apply standard deduction
statusReason: expected 2194.5 to equal 705

[Killed] MethodExpression
src/tax.js:109:27
     };
 
     const deduction = Math.max(standardDeductions[filingStatus] || 0, itemizedDeductions);
-    const taxableIncome = Math.max(0, income - deduction);
+    const taxableIncome = Math.min(0, income - deduction);
 
     // Use a default bracket set for estimation if not provided
killedBy: Tax Module estimateTaxLiability should apply standard deduction
statusReason: expected +0 to equal 705

[Killed] ArithmeticOperator
src/tax.js:109:39
     };
 
     const deduction = Math.max(standardDeductions[filingStatus] || 0, itemizedDeductions);
-    const taxableIncome = Math.max(0, income - deduction);
+    const taxableIncome = Math.max(0, income + deduction);
 
     // Use a default bracket set for estimation if not provided
killedBy: Tax Module estimateTaxLiability should apply standard deduction
statusReason: expected 3748.5 to equal 705

[Killed] ObjectLiteral
src/tax.js:114:9
     // Use a default bracket set for estimation if not provided
     // 2022-ish brackets for Single
     const defaultBrackets = [
-        { rate: 0.10, max: 10275 },
+        {},
         { rate: 0.12, max: 41775 },
         { rate: 0.22, max: 89075 },
killedBy: Tax Module estimateTaxLiability should apply standard deduction
statusReason: expected 1551 to equal 705

[Survived] ObjectLiteral
src/tax.js:120:9
         { rate: 0.24, max: 170050 },
         { rate: 0.32, max: 215950 },
         { rate: 0.35, max: 539900 },
-        { rate: 0.37, max: Infinity }
+        {}
     ];
 

[NoCoverage] BlockStatement
src/tax.js:125:37
 
     // If married, brackets are roughly double. Simplified: just double the max.
     let brackets = defaultBrackets;
-    if (filingStatus === 'married') {
-        brackets = defaultBrackets.map(b => ({ rate: b.rate, max: b.max === Infinity ? Infinity : b.max * 2 }));
-    }
+    if (filingStatus === 'married') {}
 
     return calculateIncomeTax(taxableIncome, brackets);

[Survived] ConditionalExpression
src/tax.js:125:9
 
     // If married, brackets are roughly double. Simplified: just double the max.
     let brackets = defaultBrackets;
-    if (filingStatus === 'married') {
+    if (false) {
         brackets = defaultBrackets.map(b => ({ rate: b.rate, max: b.max === Infinity ? Infinity : b.max * 2 }));
     }

[NoCoverage] ArithmeticOperator
src/tax.js:126:99
     // If married, brackets are roughly double. Simplified: just double the max.
     let brackets = defaultBrackets;
     if (filingStatus === 'married') {
-        brackets = defaultBrackets.map(b => ({ rate: b.rate, max: b.max === Infinity ? Infinity : b.max * 2 }));
+        brackets = defaultBrackets.map(b => ({ rate: b.rate, max: b.max === Infinity ? Infinity : b.max / 2 }));
     }
 

[NoCoverage] ConditionalExpression
src/tax.js:126:67
     // If married, brackets are roughly double. Simplified: just double the max.
     let brackets = defaultBrackets;
     if (filingStatus === 'married') {
-        brackets = defaultBrackets.map(b => ({ rate: b.rate, max: b.max === Infinity ? Infinity : b.max * 2 }));
+        brackets = defaultBrackets.map(b => ({ rate: b.rate, max: true ? Infinity : b.max * 2 }));
     }
 

[Killed] ObjectLiteral
src/tax.js:132:18
     return calculateIncomeTax(taxableIncome, brackets);
 }
 
-module.exports = {
-  calculateIncomeTax,
-  calculateEffectiveTaxRate,
-  calculateCapitalGains,
-  estimateTaxLiability
-};
+module.exports = {};
 
killedBy: Tax Module calculateIncomeTax should calculate tax correctly for first bracket
statusReason: calculateIncomeTax is not a function
