[Killed] BlockStatement
src/currency.js:9:67
  * @param {Object} rates - An object containing exchange rates relative to a base currency (e.g., USD).
  * @returns {number} The converted amount.
  */
-function convertCurrency(amount, fromCurrency, toCurrency, rates) {
-    if (amount < 0) throw new Error("Amount cannot be negative");
-    if (!rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
-
-    const amountInBase = amount / rates[fromCurrency];
-    const convertedAmount = amountInBase * rates[toCurrency];
-    
-    return Number(convertedAmount.toFixed(2));
-}
+function convertCurrency(amount, fromCurrency, toCurrency, rates) {}
 
 /**
killedBy: Currency Module convertCurrency should convert currency correctly
statusReason: expected undefined to be numeric

[Killed] ConditionalExpression
src/currency.js:10:9
  * @returns {number} The converted amount.
  */
 function convertCurrency(amount, fromCurrency, toCurrency, rates) {
-    if (amount < 0) throw new Error("Amount cannot be negative");
+    if (false) throw new Error("Amount cannot be negative");
     if (!rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
 
killedBy: Currency Module convertCurrency should throw error for negative amount
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/currency.js:10:9
  * @returns {number} The converted amount.
  */
 function convertCurrency(amount, fromCurrency, toCurrency, rates) {
-    if (amount < 0) throw new Error("Amount cannot be negative");
+    if (amount >= 0) throw new Error("Amount cannot be negative");
     if (!rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
 
killedBy: Currency Module convertCurrency should convert currency correctly
statusReason: Amount cannot be negative

[Killed] ConditionalExpression
src/currency.js:11:9
  */
 function convertCurrency(amount, fromCurrency, toCurrency, rates) {
     if (amount < 0) throw new Error("Amount cannot be negative");
-    if (!rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
+    if (true) throw new Error("Invalid currency code");
 
     const amountInBase = amount / rates[fromCurrency];
killedBy: Currency Module convertCurrency should convert currency correctly
statusReason: Invalid currency code

[Killed] BooleanLiteral
src/currency.js:11:9
  */
 function convertCurrency(amount, fromCurrency, toCurrency, rates) {
     if (amount < 0) throw new Error("Amount cannot be negative");
-    if (!rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
+    if (rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
 
     const amountInBase = amount / rates[fromCurrency];
killedBy: Currency Module convertCurrency should convert currency correctly
statusReason: Invalid currency code

[Killed] ArithmeticOperator
src/currency.js:13:26
     if (amount < 0) throw new Error("Amount cannot be negative");
     if (!rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
 
-    const amountInBase = amount / rates[fromCurrency];
+    const amountInBase = amount * rates[fromCurrency];
     const convertedAmount = amountInBase * rates[toCurrency];
     
killedBy: Currency Module convertCurrency should convert currency correctly
statusReason: expected 63.75 to be close to 88.24 +/- 0.01

[Killed] ArithmeticOperator
src/currency.js:14:29
     if (!rates[fromCurrency] || !rates[toCurrency]) throw new Error("Invalid currency code");
 
     const amountInBase = amount / rates[fromCurrency];
-    const convertedAmount = amountInBase * rates[toCurrency];
+    const convertedAmount = amountInBase / rates[toCurrency];
     
     return Number(convertedAmount.toFixed(2));
killedBy: Currency Module convertCurrency should convert currency correctly
statusReason: expected 156.86 to be close to 88.24 +/- 0.01

[Killed] BlockStatement
src/currency.js:25:54
  * @param {string} baseCurrency - The base currency.
  * @returns {Promise<Object>} A promise resolving to the rates object.
  */
-async function getHistoricalRate(date, baseCurrency) {
-    // In a real app, this would fetch from an API.
-    // Here we return a mock object.
-    return new Promise((resolve) => {
-        setTimeout(() => {
-            resolve({
-                [baseCurrency]: 1,
-                'USD': 1,
-                'EUR': 0.85,
-                'GBP': 0.75,
-                'JPY': 110.0
-            });
-        }, 100);
-    });
-}
+async function getHistoricalRate(date, baseCurrency) {}
 
 module.exports = {
killedBy: Currency Module getHistoricalRate should return mock rates
statusReason: Target cannot be null or undefined.

[Timeout] BlockStatement
src/currency.js:28:37
 async function getHistoricalRate(date, baseCurrency) {
     // In a real app, this would fetch from an API.
     // Here we return a mock object.
-    return new Promise((resolve) => {
-        setTimeout(() => {
-            resolve({
-                [baseCurrency]: 1,
-                'USD': 1,
-                'EUR': 0.85,
-                'GBP': 0.75,
-                'JPY': 110.0
-            });
-        }, 100);
-    });
+    return new Promise((resolve) => {});
 }
 

[Timeout] BlockStatement
src/currency.js:29:26
     // In a real app, this would fetch from an API.
     // Here we return a mock object.
     return new Promise((resolve) => {
-        setTimeout(() => {
-            resolve({
-                [baseCurrency]: 1,
-                'USD': 1,
-                'EUR': 0.85,
-                'GBP': 0.75,
-                'JPY': 110.0
-            });
-        }, 100);
+        setTimeout(() => {}, 100);
     });
 }

[Killed] ObjectLiteral
src/currency.js:30:21
     // Here we return a mock object.
     return new Promise((resolve) => {
         setTimeout(() => {
-            resolve({
-                [baseCurrency]: 1,
-                'USD': 1,
-                'EUR': 0.85,
-                'GBP': 0.75,
-                'JPY': 110.0
-            });
+            resolve({});
         }, 100);
     });
killedBy: Currency Module getHistoricalRate should return mock rates
statusReason: expected {} to have property 'EUR'
