[Killed] BlockStatement
src/investment.js:9:81
  * @param {number} frequency - The number of times interest is compounded per year.
  * @returns {number} The future value of the investment.
  */
-function calculateCompoundInterest(principal, annualRate, timeYears, frequency) {
-    if (principal < 0 || annualRate < 0 || timeYears < 0 || frequency <= 0) {
-        throw new Error("Invalid input parameters");
-    }
-
-    const r = annualRate / 100;
-    const n = frequency;
-    const t = timeYears;
-
-    const amount = principal * Math.pow(1 + r / n, n * t);
-    return Number(amount.toFixed(2));
-}
+function calculateCompoundInterest(principal, annualRate, timeYears, frequency) {}
 
 /**
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Net worth should be positive

[Killed] EqualityOperator
src/investment.js:10:61
  * @returns {number} The future value of the investment.
  */
 function calculateCompoundInterest(principal, annualRate, timeYears, frequency) {
-    if (principal < 0 || annualRate < 0 || timeYears < 0 || frequency <= 0) {
+    if (principal < 0 || annualRate < 0 || timeYears < 0 || frequency > 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Integration Tests Scenario 1: Net Worth Calculation should calculate total net worth from assets and liabilities
statusReason: Invalid input parameters

[Killed] EqualityOperator
src/investment.js:10:26
  * @returns {number} The future value of the investment.
  */
 function calculateCompoundInterest(principal, annualRate, timeYears, frequency) {
-    if (principal < 0 || annualRate < 0 || timeYears < 0 || frequency <= 0) {
+    if (principal < 0 || annualRate <= 0 || timeYears < 0 || frequency <= 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module calculateCompoundInterest should handle zero annual rate
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/investment.js:18:45
     const n = frequency;
     const t = timeYears;
 
-    const amount = principal * Math.pow(1 + r / n, n * t);
+    const amount = principal * Math.pow(1 + r * n, n * t);
     return Number(amount.toFixed(2));
 }
killedBy: Investment Module calculateCompoundInterest should calculate compound interest correctly
statusReason: expected 3.121748550316013e+27 to be close to 1647.01 +/- 0.01

[Killed] ArithmeticOperator
src/investment.js:18:20
     const n = frequency;
     const t = timeYears;
 
-    const amount = principal * Math.pow(1 + r / n, n * t);
+    const amount = principal / Math.pow(1 + r / n, n * t);
     return Number(amount.toFixed(2));
 }
killedBy: Investment Module calculateCompoundInterest should calculate compound interest correctly
statusReason: expected 607.16 to be close to 1647.01 +/- 0.01

[Killed] BlockStatement
src/investment.js:30:93
  * @param {number} years - Number of years to forecast.
  * @returns {number} The total portfolio value.
  */
-function forecastPortfolioGrowth(initialInvestment, monthlyContribution, annualRate, years) {
-     if (initialInvestment < 0 || monthlyContribution < 0 || annualRate < 0 || years < 0) {
-        throw new Error("Invalid input parameters");
-    }
-    
-    const monthlyRate = annualRate / 100 / 12;
-    const months = years * 12;
-    
-    let futureValue = initialInvestment * Math.pow(1 + monthlyRate, months);
-    
-    // Future value of a series (monthly contributions)
-    // FV = P * ((1 + r)^n - 1) / r
-    if (monthlyRate > 0) {
-        futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
-    } else {
-        futureValue += monthlyContribution * months;
-    }
-
-    return Number(futureValue.toFixed(2));
-}
+function forecastPortfolioGrowth(initialInvestment, monthlyContribution, annualRate, years) {}
 
 /**
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected undefined to be numeric

[Killed] LogicalOperator
src/investment.js:31:10
  * @returns {number} The total portfolio value.
  */
 function forecastPortfolioGrowth(initialInvestment, monthlyContribution, annualRate, years) {
-     if (initialInvestment < 0 || monthlyContribution < 0 || annualRate < 0 || years < 0) {
+     if ((initialInvestment < 0 || monthlyContribution < 0) && annualRate < 0 || years < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module forecastPortfolioGrowth should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/investment.js:31:62
  * @returns {number} The total portfolio value.
  */
 function forecastPortfolioGrowth(initialInvestment, monthlyContribution, annualRate, years) {
-     if (initialInvestment < 0 || monthlyContribution < 0 || annualRate < 0 || years < 0) {
+     if (initialInvestment < 0 || monthlyContribution < 0 || annualRate >= 0 || years < 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/investment.js:36:20
     }
     
     const monthlyRate = annualRate / 100 / 12;
-    const months = years * 12;
+    const months = years / 12;
     
     let futureValue = initialInvestment * Math.pow(1 + monthlyRate, months);
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected 10465.05 to be close to 106639.01 +/- 0.1

[Killed] ArithmeticOperator
src/investment.js:38:52
     const monthlyRate = annualRate / 100 / 12;
     const months = years * 12;
     
-    let futureValue = initialInvestment * Math.pow(1 + monthlyRate, months);
+    let futureValue = initialInvestment * Math.pow(1 - monthlyRate, months);
     
     // Future value of a series (monthly contributions)
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected 91498.09 to be close to 106639.01 +/- 0.1

[Killed] ArithmeticOperator
src/investment.js:38:23
     const monthlyRate = annualRate / 100 / 12;
     const months = years * 12;
     
-    let futureValue = initialInvestment * Math.pow(1 + monthlyRate, months);
+    let futureValue = initialInvestment / Math.pow(1 + monthlyRate, months);
     
     // Future value of a series (monthly contributions)
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected 91518.37 to be close to 106639.01 +/- 0.1

[Killed] EqualityOperator
src/investment.js:42:9
     
     // Future value of a series (monthly contributions)
     // FV = P * ((1 + r)^n - 1) / r
-    if (monthlyRate > 0) {
+    if (monthlyRate <= 0) {
         futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
     } else {
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected 80096.61 to be close to 106639.01 +/- 0.1

[Killed] ConditionalExpression
src/investment.js:42:9
     
     // Future value of a series (monthly contributions)
     // FV = P * ((1 + r)^n - 1) / r
-    if (monthlyRate > 0) {
+    if (false) {
         futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
     } else {
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected 80096.61 to be close to 106639.01 +/- 0.1

[Killed] ArithmeticOperator
src/investment.js:43:24
     // Future value of a series (monthly contributions)
     // FV = P * ((1 + r)^n - 1) / r
     if (monthlyRate > 0) {
-        futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
+        futureValue += monthlyContribution / (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
     } else {
         futureValue += monthlyContribution * months;
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected 104990.71 to be close to 106639.01 +/- 0.1

[Killed] ArithmeticOperator
src/investment.js:43:47
     // Future value of a series (monthly contributions)
     // FV = P * ((1 + r)^n - 1) / r
     if (monthlyRate > 0) {
-        futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
+        futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) + 1) / monthlyRate;
     } else {
         futureValue += monthlyContribution * months;
killedBy: Investment Module forecastPortfolioGrowth should forecast growth with contributions correctly
statusReason: expected 278067.59 to be close to 106639.01 +/- 0.1

[Killed] BlockStatement
src/investment.js:44:12
     // FV = P * ((1 + r)^n - 1) / r
     if (monthlyRate > 0) {
         futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
-    } else {
-        futureValue += monthlyContribution * months;
-    }
+    } else {}
 
     return Number(futureValue.toFixed(2));
killedBy: Investment Module forecastPortfolioGrowth should handle zero annual rate
statusReason: expected 10000 to equal 70000

[Killed] ArithmeticOperator
src/investment.js:45:24
     if (monthlyRate > 0) {
         futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
     } else {
-        futureValue += monthlyContribution * months;
+        futureValue += monthlyContribution / months;
     }
 
killedBy: Investment Module forecastPortfolioGrowth should handle zero annual rate
statusReason: expected 10004.17 to equal 70000

[Killed] AssignmentOperator
src/investment.js:45:9
     if (monthlyRate > 0) {
         futureValue += monthlyContribution * (Math.pow(1 + monthlyRate, months) - 1) / monthlyRate;
     } else {
-        futureValue += monthlyContribution * months;
+        futureValue -= monthlyContribution * months;
     }
 
killedBy: Investment Module forecastPortfolioGrowth should handle zero annual rate
statusReason: expected -50000 to equal 70000

[Killed] LogicalOperator
src/investment.js:62:9
  * @returns {Object} Simulation results (min, max, median, percentiles).
  */
 function runMonteCarloSimulation(initialInvestment, monthlyContribution, years, meanReturn, stdDev, simulations = 1000) {
-    if (initialInvestment < 0 || monthlyContribution < 0 || years < 0 || simulations <= 0) {
+    if ((initialInvestment < 0 || monthlyContribution < 0) && years < 0 || simulations <= 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module runMonteCarloSimulation should throw error for invalid simulations
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/investment.js:62:74
  * @returns {Object} Simulation results (min, max, median, percentiles).
  */
 function runMonteCarloSimulation(initialInvestment, monthlyContribution, years, meanReturn, stdDev, simulations = 1000) {
-    if (initialInvestment < 0 || monthlyContribution < 0 || years < 0 || simulations <= 0) {
+    if (initialInvestment < 0 || monthlyContribution < 0 || years < 0 || false) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module runMonteCarloSimulation should throw error for invalid simulations
statusReason: expected [Function] to throw error including 'Invalid input parameters' but got 'Cannot read properties of undefined (…'

[Survived] ArithmeticOperator
src/investment.js:67:25
     }
 
     const results = [];
-    const monthlyMean = meanReturn / 100 / 12;
+    const monthlyMean = meanReturn * 100 / 12;
     const monthlyStdDev = (stdDev / 100) / Math.sqrt(12);
     const months = years * 12;

[Survived] ArithmeticOperator
src/investment.js:67:25
     }
 
     const results = [];
-    const monthlyMean = meanReturn / 100 / 12;
+    const monthlyMean = meanReturn / 100 * 12;
     const monthlyStdDev = (stdDev / 100) / Math.sqrt(12);
     const months = years * 12;

[Survived] ArithmeticOperator
src/investment.js:68:27
 
     const results = [];
     const monthlyMean = meanReturn / 100 / 12;
-    const monthlyStdDev = (stdDev / 100) / Math.sqrt(12);
+    const monthlyStdDev = stdDev / 100 * Math.sqrt(12);
     const months = years * 12;
 

[Survived] ArithmeticOperator
src/investment.js:68:28
 
     const results = [];
     const monthlyMean = meanReturn / 100 / 12;
-    const monthlyStdDev = (stdDev / 100) / Math.sqrt(12);
+    const monthlyStdDev = (stdDev * 100) / Math.sqrt(12);
     const months = years * 12;
 

[Survived] ArithmeticOperator
src/investment.js:69:20
     const results = [];
     const monthlyMean = meanReturn / 100 / 12;
     const monthlyStdDev = (stdDev / 100) / Math.sqrt(12);
-    const months = years * 12;
+    const months = years / 12;
 
     for (let i = 0; i < simulations; i++) {

[Killed] BlockStatement
src/investment.js:71:43
     const monthlyStdDev = (stdDev / 100) / Math.sqrt(12);
     const months = years * 12;
 
-    for (let i = 0; i < simulations; i++) {
-        let balance = initialInvestment;
-        for (let m = 0; m < months; m++) {
-            // Box-Muller transform for random normal distribution
-            const u1 = Math.random();
-            const u2 = Math.random();
-            const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
-            
-            const monthlyReturn = monthlyMean + z * monthlyStdDev;
-            balance = balance * (1 + monthlyReturn) + monthlyContribution;
-        }
-        results.push(balance);
-    }
+    for (let i = 0; i < simulations; i++) {}
 
     results.sort((a, b) => a - b);
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] EqualityOperator
src/investment.js:73:25
 
     for (let i = 0; i < simulations; i++) {
         let balance = initialInvestment;
-        for (let m = 0; m < months; m++) {
+        for (let m = 0; m >= months; m++) {
             // Box-Muller transform for random normal distribution
             const u1 = Math.random();
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: expected 10000 to be above 10000

[Killed] BlockStatement
src/investment.js:73:42
 
     for (let i = 0; i < simulations; i++) {
         let balance = initialInvestment;
-        for (let m = 0; m < months; m++) {
-            // Box-Muller transform for random normal distribution
-            const u1 = Math.random();
-            const u2 = Math.random();
-            const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
-            
-            const monthlyReturn = monthlyMean + z * monthlyStdDev;
-            balance = balance * (1 + monthlyReturn) + monthlyContribution;
-        }
+        for (let m = 0; m < months; m++) {}
         results.push(balance);
     }
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: expected 10000 to be above 10000

[Killed] UnaryOperator
src/investment.js:77:33
             // Box-Muller transform for random normal distribution
             const u1 = Math.random();
             const u2 = Math.random();
-            const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
+            const z = Math.sqrt(+2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
             
             const monthlyReturn = monthlyMean + z * monthlyStdDev;
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: expected NaN to be above 10000

[Survived] ArithmeticOperator
src/investment.js:77:33
             // Box-Muller transform for random normal distribution
             const u1 = Math.random();
             const u2 = Math.random();
-            const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
+            const z = Math.sqrt(-2.0 / Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
             
             const monthlyReturn = monthlyMean + z * monthlyStdDev;

[Killed] ArithmeticOperator
src/investment.js:79:49
             const u2 = Math.random();
             const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
             
-            const monthlyReturn = monthlyMean + z * monthlyStdDev;
+            const monthlyReturn = monthlyMean + z / monthlyStdDev;
             balance = balance * (1 + monthlyReturn) + monthlyContribution;
         }
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: expected -1.091613656312879e+147 to be above 10000

[Survived] ArithmeticOperator
src/investment.js:79:35
             const u2 = Math.random();
             const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
             
-            const monthlyReturn = monthlyMean + z * monthlyStdDev;
+            const monthlyReturn = monthlyMean - z * monthlyStdDev;
             balance = balance * (1 + monthlyReturn) + monthlyContribution;
         }

[Killed] ArithmeticOperator
src/investment.js:80:23
             const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
             
             const monthlyReturn = monthlyMean + z * monthlyStdDev;
-            balance = balance * (1 + monthlyReturn) + monthlyContribution;
+            balance = balance * (1 + monthlyReturn) - monthlyContribution;
         }
         results.push(balance);
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: expected -65216.59 to be above 10000

[Survived] ArithmeticOperator
src/investment.js:80:34
             const z = Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
             
             const monthlyReturn = monthlyMean + z * monthlyStdDev;
-            balance = balance * (1 + monthlyReturn) + monthlyContribution;
+            balance = balance * (1 - monthlyReturn) + monthlyContribution;
         }
         results.push(balance);

[Survived] MethodExpression
src/investment.js:85:5
         results.push(balance);
     }
 
-    results.sort((a, b) => a - b);
+    results;
 
     const min = results[0];

[Survived] ArithmeticOperator
src/investment.js:85:28
         results.push(balance);
     }
 
-    results.sort((a, b) => a - b);
+    results.sort((a, b) => a + b);
 
     const min = results[0];

[Killed] ArithmeticOperator
src/investment.js:88:25
     results.sort((a, b) => a - b);
 
     const min = results[0];
-    const max = results[results.length - 1];
+    const max = results[results.length + 1];
     const median = results[Math.floor(results.length / 2)];
     const p10 = results[Math.floor(results.length * 0.1)];
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/investment.js:89:39
 
     const min = results[0];
     const max = results[results.length - 1];
-    const median = results[Math.floor(results.length / 2)];
+    const median = results[Math.floor(results.length * 2)];
     const p10 = results[Math.floor(results.length * 0.1)];
     const p90 = results[Math.floor(results.length * 0.9)];
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/investment.js:90:36
     const min = results[0];
     const max = results[results.length - 1];
     const median = results[Math.floor(results.length / 2)];
-    const p10 = results[Math.floor(results.length * 0.1)];
+    const p10 = results[Math.floor(results.length / 0.1)];
     const p90 = results[Math.floor(results.length * 0.9)];
 
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/investment.js:91:36
     const max = results[results.length - 1];
     const median = results[Math.floor(results.length / 2)];
     const p10 = results[Math.floor(results.length * 0.1)];
-    const p90 = results[Math.floor(results.length * 0.9)];
+    const p90 = results[Math.floor(results.length / 0.9)];
 
     return {
killedBy: Investment Module runMonteCarloSimulation should return simulation statistics
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] ConditionalExpression
src/investment.js:110:9
  * @returns {Array<Object>} Rebalancing actions.
  */
 function calculateAssetAllocation(totalValue, currentHoldings, targetAllocation) {
-    if (totalValue < 0 || !Array.isArray(currentHoldings) || !Array.isArray(targetAllocation)) {
+    if (false) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module calculateAssetAllocation should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/investment.js:110:9
  * @returns {Array<Object>} Rebalancing actions.
  */
 function calculateAssetAllocation(totalValue, currentHoldings, targetAllocation) {
-    if (totalValue < 0 || !Array.isArray(currentHoldings) || !Array.isArray(targetAllocation)) {
+    if (false || !Array.isArray(targetAllocation)) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module calculateAssetAllocation should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/investment.js:118:30
     
     // Create map of targets
     const targets = {};
-    targetAllocation.forEach(t => targets[t.name] = t.percent);
+    targetAllocation.forEach(() => undefined);
 
     // Create map of current
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: Cannot read properties of undefined (reading 'action')

[Killed] ArrowFunction
src/investment.js:122:29
 
     // Create map of current
     const current = {};
-    currentHoldings.forEach(c => current[c.name] = c.value);
+    currentHoldings.forEach(() => undefined);
 
     // Check if targets sum to 100? Or just assume.
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 70000 to equal 10000

[Killed] BlockStatement
src/investment.js:126:38
 
     // Check if targets sum to 100? Or just assume.
     
-    for (const assetName in targets) {
-        const targetPercent = targets[assetName];
-        const targetValue = totalValue * (targetPercent / 100);
-        const currentValue = current[assetName] || 0;
-        const difference = targetValue - currentValue;
-
-        actions.push({
-            name: assetName,
-            currentValue: currentValue,
-            targetValue: Number(targetValue.toFixed(2)),
-            difference: Number(difference.toFixed(2)),
-            action: difference > 0 ? "BUY" : "SELL"
-        });
-    }
+    for (const assetName in targets) {}
 
     return actions;
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: Cannot read properties of undefined (reading 'action')

[Killed] ArithmeticOperator
src/investment.js:128:43
     
     for (const assetName in targets) {
         const targetPercent = targets[assetName];
-        const targetValue = totalValue * (targetPercent / 100);
+        const targetValue = totalValue * (targetPercent * 100);
         const currentValue = current[assetName] || 0;
         const difference = targetValue - currentValue;
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 699940000 to equal 10000

[Killed] ArithmeticOperator
src/investment.js:128:29
     
     for (const assetName in targets) {
         const targetPercent = targets[assetName];
-        const targetValue = totalValue * (targetPercent / 100);
+        const targetValue = totalValue / (targetPercent / 100);
         const currentValue = current[assetName] || 0;
         const difference = targetValue - currentValue;
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 82857.14 to equal 10000

[Killed] ConditionalExpression
src/investment.js:129:30
     for (const assetName in targets) {
         const targetPercent = targets[assetName];
         const targetValue = totalValue * (targetPercent / 100);
-        const currentValue = current[assetName] || 0;
+        const currentValue = true;
         const difference = targetValue - currentValue;
 
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 69999 to equal 10000

[Killed] LogicalOperator
src/investment.js:129:30
     for (const assetName in targets) {
         const targetPercent = targets[assetName];
         const targetValue = totalValue * (targetPercent / 100);
-        const currentValue = current[assetName] || 0;
+        const currentValue = current[assetName] && 0;
         const difference = targetValue - currentValue;
 
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 70000 to equal 10000

[Killed] ArithmeticOperator
src/investment.js:130:28
         const targetPercent = targets[assetName];
         const targetValue = totalValue * (targetPercent / 100);
         const currentValue = current[assetName] || 0;
-        const difference = targetValue - currentValue;
+        const difference = targetValue + currentValue;
 
         actions.push({
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 130000 to equal 10000

[Killed] ObjectLiteral
src/investment.js:132:22
         const currentValue = current[assetName] || 0;
         const difference = targetValue - currentValue;
 
-        actions.push({
-            name: assetName,
-            currentValue: currentValue,
-            targetValue: Number(targetValue.toFixed(2)),
-            difference: Number(difference.toFixed(2)),
-            action: difference > 0 ? "BUY" : "SELL"
-        });
+        actions.push({});
     }
 
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: Cannot read properties of undefined (reading 'action')

[Killed] EqualityOperator
src/investment.js:137:21
             currentValue: currentValue,
             targetValue: Number(targetValue.toFixed(2)),
             difference: Number(difference.toFixed(2)),
-            action: difference > 0 ? "BUY" : "SELL"
+            action: difference <= 0 ? "BUY" : "SELL"
         });
     }
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 'SELL' to equal 'BUY'

[Killed] ConditionalExpression
src/investment.js:137:21
             currentValue: currentValue,
             targetValue: Number(targetValue.toFixed(2)),
             difference: Number(difference.toFixed(2)),
-            action: difference > 0 ? "BUY" : "SELL"
+            action: true ? "BUY" : "SELL"
         });
     }
killedBy: Investment Module calculateAssetAllocation should calculate rebalancing actions
statusReason: expected 'BUY' to equal 'SELL'

[Killed] BlockStatement
src/investment.js:151:70
  * @param {number} years - Number of years.
  * @returns {number} Real value (present purchasing power).
  */
-function calculateInflationImpact(futureValue, inflationRate, years) {
-    if (years < 0) throw new Error("Invalid input parameters");
-    
-    // PV = FV / (1 + r)^n
-    const r = inflationRate / 100;
-    const realValue = futureValue / Math.pow(1 + r, years);
-    
-    return Number(realValue.toFixed(2));
-}
+function calculateInflationImpact(futureValue, inflationRate, years) {}
 
 module.exports = {
killedBy: Investment Module calculateInflationImpact should calculate real value correctly
statusReason: expected undefined to be numeric

[Killed] ConditionalExpression
src/investment.js:152:9
  * @returns {number} Real value (present purchasing power).
  */
 function calculateInflationImpact(futureValue, inflationRate, years) {
-    if (years < 0) throw new Error("Invalid input parameters");
+    if (false) throw new Error("Invalid input parameters");
     
     // PV = FV / (1 + r)^n
killedBy: Investment Module calculateInflationImpact should throw error for negative years
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/investment.js:152:9
  * @returns {number} Real value (present purchasing power).
  */
 function calculateInflationImpact(futureValue, inflationRate, years) {
-    if (years < 0) throw new Error("Invalid input parameters");
+    if (true) throw new Error("Invalid input parameters");
     
     // PV = FV / (1 + r)^n
killedBy: Investment Module calculateInflationImpact should calculate real value correctly
statusReason: Invalid input parameters

[Killed] ArithmeticOperator
src/investment.js:155:15
     if (years < 0) throw new Error("Invalid input parameters");
     
     // PV = FV / (1 + r)^n
-    const r = inflationRate / 100;
+    const r = inflationRate * 100;
     const realValue = futureValue / Math.pow(1 + r, years);
     
killedBy: Investment Module calculateInflationImpact should calculate real value correctly
statusReason: expected +0 to be close to 74409.39 +/- 0.1
