[Killed] ArithmeticOperator
src/investment.js:156:46
     
     // PV = FV / (1 + r)^n
     const r = inflationRate / 100;
-    const realValue = futureValue / Math.pow(1 + r, years);
+    const realValue = futureValue / Math.pow(1 - r, years);
     
     return Number(realValue.toFixed(2));
killedBy: Investment Module calculateInflationImpact should calculate real value correctly
statusReason: expected 135607.17 to be close to 74409.39 +/- 0.1

[Killed] ArithmeticOperator
src/investment.js:156:23
     
     // PV = FV / (1 + r)^n
     const r = inflationRate / 100;
-    const realValue = futureValue / Math.pow(1 + r, years);
+    const realValue = futureValue * Math.pow(1 + r, years);
     
     return Number(realValue.toFixed(2));
killedBy: Investment Module calculateInflationImpact should calculate real value correctly
statusReason: expected 134391.64 to be close to 74409.39 +/- 0.1

[Killed] BlockStatement
src/investment.js:178:60
  * @param {number} years - Number of years.
  * @returns {number} CAGR percentage.
  */
-function calculateCAGR(beginningValue, endingValue, years) {
-    if (beginningValue <= 0 || endingValue < 0 || years <= 0) {
-        throw new Error("Invalid input parameters");
-    }
-
-    const cagr = Math.pow(endingValue / beginningValue, 1 / years) - 1;
-    return Number((cagr * 100).toFixed(2));
-}
+function calculateCAGR(beginningValue, endingValue, years) {}
 
 /**
killedBy: Investment Module calculateCAGR should calculate CAGR correctly
statusReason: expected undefined to equal 14.87

[Killed] ConditionalExpression
src/investment.js:179:51
  * @returns {number} CAGR percentage.
  */
 function calculateCAGR(beginningValue, endingValue, years) {
-    if (beginningValue <= 0 || endingValue < 0 || years <= 0) {
+    if (beginningValue <= 0 || endingValue < 0 || false) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module calculateCAGR should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/investment.js:179:32
  * @returns {number} CAGR percentage.
  */
 function calculateCAGR(beginningValue, endingValue, years) {
-    if (beginningValue <= 0 || endingValue < 0 || years <= 0) {
+    if (beginningValue <= 0 || false || years <= 0) {
         throw new Error("Invalid input parameters");
     }
killedBy: Investment Module calculateCAGR should throw error for invalid inputs
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/investment.js:183:18
         throw new Error("Invalid input parameters");
     }
 
-    const cagr = Math.pow(endingValue / beginningValue, 1 / years) - 1;
+    const cagr = Math.pow(endingValue / beginningValue, 1 / years) + 1;
     return Number((cagr * 100).toFixed(2));
 }
killedBy: Investment Module calculateCAGR should calculate CAGR correctly
statusReason: expected 214.87 to equal 14.87

[Killed] ArithmeticOperator
src/investment.js:183:27
         throw new Error("Invalid input parameters");
     }
 
-    const cagr = Math.pow(endingValue / beginningValue, 1 / years) - 1;
+    const cagr = Math.pow(endingValue * beginningValue, 1 / years) - 1;
     return Number((cagr * 100).toFixed(2));
 }
killedBy: Investment Module calculateCAGR should calculate CAGR correctly
statusReason: expected 1720.56 to equal 14.87

[Killed] ArithmeticOperator
src/investment.js:184:20
     }
 
     const cagr = Math.pow(endingValue / beginningValue, 1 / years) - 1;
-    return Number((cagr * 100).toFixed(2));
+    return Number((cagr / 100).toFixed(2));
 }
 
killedBy: Investment Module calculateCAGR should calculate CAGR correctly
statusReason: expected +0 to equal 14.87

[Killed] BlockStatement
src/investment.js:192:42
  * @param {number} interestRate - Annual interest rate (percent).
  * @returns {number} Years to double.
  */
-function calculateRuleOf72(interestRate) {
-    if (interestRate <= 0) throw new Error("Interest rate must be positive");
-    
-    return Number((72 / interestRate).toFixed(2));
-}
+function calculateRuleOf72(interestRate) {}
 
killedBy: Investment Module calculateRuleOf72 should calculate years to double correctly
statusReason: expected undefined to equal 9

[Killed] EqualityOperator
src/investment.js:193:9
  * @returns {number} Years to double.
  */
 function calculateRuleOf72(interestRate) {
-    if (interestRate <= 0) throw new Error("Interest rate must be positive");
+    if (interestRate < 0) throw new Error("Interest rate must be positive");
     
     return Number((72 / interestRate).toFixed(2));
killedBy: Investment Module calculateRuleOf72 should throw error for non-positive interest rate
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/investment.js:193:9
  * @returns {number} Years to double.
  */
 function calculateRuleOf72(interestRate) {
-    if (interestRate <= 0) throw new Error("Interest rate must be positive");
+    if (false) throw new Error("Interest rate must be positive");
     
     return Number((72 / interestRate).toFixed(2));
killedBy: Investment Module calculateRuleOf72 should throw error for non-positive interest rate
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/investment.js:195:20
 function calculateRuleOf72(interestRate) {
     if (interestRate <= 0) throw new Error("Interest rate must be positive");
     
-    return Number((72 / interestRate).toFixed(2));
+    return Number((72 * interestRate).toFixed(2));
 }
 
killedBy: Investment Module calculateRuleOf72 should calculate years to double correctly
statusReason: expected 576 to equal 9
