[Killed] EqualityOperator
src/creditCard.js:41:9
  * @returns {number} Total interest charged.
  */
 function calculateInterestCharges(balance, interestRate, months) {
-    if (balance < 0 || interestRate < 0 || months < 0) throw new Error("Invalid input parameters");
+    if (balance <= 0 || interestRate < 0 || months < 0) throw new Error("Invalid input parameters");
 
     const monthlyRate = interestRate / 100 / 12;
killedBy: Fuzz Testing Credit Card Module calculateInterestCharges should return non-negative interest
statusReason: Property failed after 46 tests
{ seed: 1421111009, path: "45:0:0", endOnFailure: true }
Counterexample: [0,0,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
