[Killed] ArithmeticOperator
src/realEstate.js:49:53
     if (interestRate === 0) {
         maxMortgage = maxMonthlyPayment * n;
     } else {
-        maxMortgage = maxMonthlyPayment * (Math.pow(1 + r, n) - 1) / (r * Math.pow(1 + r, n));
+        maxMortgage = maxMonthlyPayment * (Math.pow(1 - r, n) - 1) / (r * Math.pow(1 + r, n));
     }
 
killedBy: Fuzz Testing Real Estate Module calculateMortgageMax should return non-negative max mortgage
statusReason: Property failed after 1 tests
{ seed: 1923201439, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [30000,0,0.1,10]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
